<?php
/**
*
* acp_board [Ukrainian]
*
* @package language
* @copyright (c) 2005 phpBB Group
* @license http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// Board Settings
$lang = array_merge($lang, array(
	'ACP_BOARD_SETTINGS_EXPLAIN'	=> 'Тут ви можете встановити загальні параметри конференції, дати їй ім\'я та опис, а також вказати часовий пояс і мова, що будуть використовуватися за замовчуванням.',
	'BOARD_INDEX_TEXT'				=> 'Назва конференції',
	'BOARD_INDEX_TEXT_EXPLAIN'		=> 'Цей текст відображається як посилання на головну сторінку конференції в меню навігації. За замовчуванням буде відображений текст «Список форумів».',
	'CUSTOM_DATEFORMAT'				=> 'Інший…',
	'DEFAULT_DATE_FORMAT'			=> 'Формат дати',
	'DEFAULT_DATE_FORMAT_EXPLAIN'	=> 'Синтаксис ідентичний функції <code><a href="http://www.php.net/date">date</code></a> мови PHP.',
	'DEFAULT_LANGUAGE'				=> 'Мова конференції за замовчуванням',
	'DEFAULT_STYLE'					=> 'Стиль конференції за замовчуванням',
	'DISABLE_BOARD'					=> 'Вимкнути конференцію',
	'DISABLE_BOARD_EXPLAIN'			=> 'Конференція стане недоступною для відвідувачів. Також ви можете ввести коротке повідомлення (до 255 символів), яке будуть бачити відвідувачі.',
	'DISPLAY_LAST_SUBJECT'			=> 'Показувати заголовок останнього повідомлення в списку форумів',
	'DISPLAY_LAST_SUBJECT_EXPLAIN'	=> 'Тема останнього повідомлення буде відображений в списку форумів у вигляді посилання на дане повідомлення. Заголовки повідомлень, надісланих у форумах, захищених паролем, або право доступу до читання яких у користувача відсутній, не відображатимуться.',
	'OVERRIDE_STYLE'				=> 'Замінювати стиль користувача',
	'OVERRIDE_STYLE_EXPLAIN'		=> 'Стиль, вибраний користувачем, буде замінений стилем за замовчуванням.',
	'SITE_DESC'						=> 'Опис конференції',
	'SITE_HOME_TEXT'				=> 'Назва основного сайту',
	'SITE_HOME_TEXT_EXPLAIN'		=> 'Цей текст буде відображений у вигляді посилання на основний сайт в меню навігації конференції. За замовчуванням буде відображений текст «Додому».',
	'SITE_HOME_URL'					=> 'Посилання на основний сайт',
	'SITE_HOME_URL_EXPLAIN'			=> 'Якщо задано, дане посилання буде додана в початок меню навігації конференції, а також до логотипу конференції. Посилання має бути абсолютною, наприклад <samp>http://www.phpbbukraine.net</samp>.',
	'SITE_NAME'						=> 'Назва конференції',
	'SYSTEM_TIMEZONE'				=> 'Часовий пояс для гостей',
	'SYSTEM_TIMEZONE_EXPLAIN'		=> 'Часовий пояс, який використовується для відображення часу у незареєстрованих користувачів (гості, боти). Зареєстровані користувачі налаштовують свій часовий пояс при реєстрації і можуть змінити його в Особистому розділі.',
	'WARNINGS_EXPIRE'				=> 'Тривалість попереджень',
	'WARNINGS_EXPIRE_EXPLAIN'		=> 'Кількість днів, після закінчення яких видане користувачеві попередження буде автоматично знято. Встановіть 0, щоб зробити попередження безстроковими.',
));

// Board Features
$lang = array_merge($lang, array(
	'ACP_BOARD_FEATURES_EXPLAIN'	=> 'Тут ви можете включати і відключати деякі функціональні можливості конференції.',

	'ALLOW_ATTACHMENTS'			=> 'Дозволити додаткові файли',
	'ALLOW_BIRTHDAYS'			=> 'Дозволити дні народження',
	'ALLOW_BIRTHDAYS_EXPLAIN'	=> 'Дозволити вказувати дні народження та відображення віку в профілі. Врахуйте, що список днів народження на сторінці списку форумів включається окремо в налаштуваннях навантаження на сервер.',
	'ALLOW_BOOKMARKS'			=> 'Дозволити закладки на теми',
	'ALLOW_BOOKMARKS_EXPLAIN'	=> 'Користувачі зможуть зберігати особисті закладки на улюблені теми.',
	'ALLOW_BBCODE'				=> 'Дозволити BBCode',
	'ALLOW_FORUM_NOTIFY'		=> 'Дозволити підписку на форуми',
	'ALLOW_NAME_CHANGE'			=> 'Дозволити зміну імені користувача',
	'ALLOW_NO_CENSORS'			=> 'Дозволити відключення автоцензор',
	'ALLOW_NO_CENSORS_EXPLAIN'	=> 'Користувачі зможуть за вибором відключати автоцензор у звичайних і особистих повідомленнях.',
	'ALLOW_PM_ATTACHMENTS'		=> 'Дозволити додаткові файли в приватних повідомленнях',
	'ALLOW_PM_REPORT'			=> 'Дозволити скарги на приватні повідомлення',
	'ALLOW_PM_REPORT_EXPLAIN'	=> 'При включенні даної опції у користувачів з\'явиться можливість скаржитися модераторам на отримані ними приватні повідомлення від інших користувачів. Оскаржувані приватні повідомлення будуть видні в панелі модератора.',
	'ALLOW_QUICK_REPLY'			=> 'Дозволити швидку відповідь',
	'ALLOW_QUICK_REPLY_EXPLAIN'	=> 'При включенні даної опції в необхідних форумах також повинна бути включена опція швидкого відповіді.',
	'ALLOW_QUICK_REPLY_BUTTON'	=> 'Відправити і включити швидку відповідь у всіх форумах',
	'ALLOW_SIG'					=> 'Дозволити підписи',
	'ALLOW_SIG_BBCODE'			=> 'Дозволити BBCode в підписах користувачів',
	'ALLOW_SIG_FLASH'			=> 'Дозволити використання тега BBCode <code>[FLASH]</code> в підписах користувачів',
	'ALLOW_SIG_IMG'				=> 'Дозволити використання тега BBCode <code>[IMG]</code> в підписах користувачів',
	'ALLOW_SIG_LINKS'			=> 'Дозволити посилання в підписах користувачів',
	'ALLOW_SIG_LINKS_EXPLAIN'	=> 'У разі заборони тег BBCode <code>[URL]</code> і автоматичне перетворення тексту в посилання будуть відключені.',
	'ALLOW_SIG_SMILIES'			=> 'Дозволити смайлики в підписах користувачів',
	'ALLOW_SMILIES'				=> 'Дозволити смайлики',
	'ALLOW_TOPIC_NOTIFY'		=> 'Дозволити підписку на теми',
	'BOARD_PM'					=> 'Дозволити приватні повідомлення',
	'BOARD_PM_EXPLAIN'			=> 'Включення обміну приватними повідомленнями для всіх користувачів.',
));

// Avatar Settings
$lang = array_merge($lang, array(
	'ACP_AVATAR_SETTINGS_EXPLAIN'	=> 'Аватари - це невеликі індивідуальні зображення, які користувачі можуть асоціювати зі своїми обліковими записами. Залежно від обраного стилю, аватари зазвичай відображаються під ім\'ям користувача при перегляді тем. Тут ви можете налаштувати використання аватар користувачами. Будь ласка, врахуйте, що для завантаження аватар необхідно створити папку, ім\'я якої задається нижче, і упевнитися в тому, що веб-сервер має права на запис в цю папку. Врахуйте також, що обмеження на розмір файлів накладаються тільки на завантажувані на сервер аватари і не поширюються на віддалені зображення.',

	'ALLOW_AVATARS'					=> 'Дозволити аватари',
	'ALLOW_AVATARS_EXPLAIN'			=> 'Глобальне включення або відключення можливості використання аватар.<br />Примітка: якщо ви вимкнете аватари в цілому або забороните використання деяких режимів аватар, то відключені аватари більше не будуть відображатися на конференції, але користувачі як і раніше зможуть завантажувати свої аватари в Особистому розділі.',
	'ALLOW_GRAVATAR'				=> 'Дозволити глобально розпізнавані аватари (Gravatar)',
	'ALLOW_LOCAL'					=> 'Дозволити галерею аватар',
	'ALLOW_REMOTE'					=> 'Дозволити віддалені аватари',
	'ALLOW_REMOTE_EXPLAIN'			=> 'Посилання на аватари, які відображаються з інших сайтів.',
	'ALLOW_REMOTE_UPLOAD'			=> 'Дозволити віддалене завантаження аватар',
	'ALLOW_REMOTE_UPLOAD_EXPLAIN'	=> 'Дозволити завантаження аватар з інших сайтів.',
	'ALLOW_UPLOAD'					=> 'Дозволити пряме завантаження аватар',
	'AVATAR_GALLERY_PATH'			=> 'Шлях до галереї аватар',
	'AVATAR_GALLERY_PATH_EXPLAIN'	=> 'Шлях до папки із завантаженими в неї малюнками щодо кореневої папки phpBB. Наприклад,, <samp>images/avatars/gallery</samp>.',
	'AVATAR_STORAGE_PATH'			=> 'Папка для завантаження аватар',
	'AVATAR_STORAGE_PATH_EXPLAIN'	=> 'Шлях до папки щодо кореневої папки phpBB. наприклад, <samp>images/avatars/upload</samp>.',
	'MAX_AVATAR_SIZE'				=> 'Максимальні розміри аватар',
	'MAX_AVATAR_SIZE_EXPLAIN'		=> 'Ширина × висота (у пікселах).',
	'MAX_FILESIZE'					=> 'Максимальний розмір файлу аватари',
	'MAX_FILESIZE_EXPLAIN'			=> 'Максимальний розмір файлів завантажуваних аватар. Якщо значення дорівнює 0, розмір файлу обмежений тільки конфігурацією PHP.',
	'MIN_AVATAR_SIZE'				=> 'Мінімальні розміри аватар',
	'MIN_AVATAR_SIZE_EXPLAIN'		=> 'Ширина × висота (у пікселах).',
));

// Message Settings
$lang = array_merge($lang, array(
	'ACP_MESSAGE_SETTINGS_EXPLAIN'		=> 'Тут ви можете задати всі налаштування за замовчуванням для приватних повідомлень (ПП).',

	'ALLOW_BBCODE_PM'			=> 'Дозволити BBCode в ПП',
	'ALLOW_FLASH_PM'			=> 'Дозволити тег BBCode <code>[FLASH]</code>',
	'ALLOW_FLASH_PM_EXPLAIN'	=> 'Врахуйте, що можливість використання flash, якщо вона включена тут, залежить також від встановлених прав доступу.',
	'ALLOW_FORWARD_PM'			=> 'Дозволити пересилку ПП',
	'ALLOW_IMG_PM'				=> 'Дозволити тег BBCode <code>[IMG]</code>',
	'ALLOW_MASS_PM'				=> 'Дозволити відправку ПП декільком користувачам або групам користувачів',
	'ALLOW_MASS_PM_EXPLAIN'		=> 'Отправку ПП группам пользователей можно настроить на странице управления группами.',
	'ALLOW_PRINT_PM'			=> 'Дозволити друкований вигляд в ПП',
	'ALLOW_QUOTE_PM'			=> 'Дозволити цитати в ПП',
	'ALLOW_SIG_PM'				=> 'Дозволити підписи в ПП',
	'ALLOW_SMILIES_PM'			=> 'Дозволити смайлики в ПП',
	'BOXES_LIMIT'				=> 'Максимальна кількість ПП в папці',
	'BOXES_LIMIT_EXPLAIN'		=> 'Користувачі не зможуть зберігати більше, ніж вказану кількість повідомлень, в кожній з папок для ПП. Встановіть 0 для зняття обмежень.',
	'BOXES_MAX'					=> 'Максимальна кількість папок для ПП',
	'BOXES_MAX_EXPLAIN'			=> 'За замовчуванням користувачі не зможуть створювати більше зазначеної кількості папок для ПП.',
	'ENABLE_PM_ICONS'			=> 'Дозволити використання значків тем у ПП',
	'FULL_FOLDER_ACTION'		=> 'Дія за замовчуванням для переповненій папки',
	'FULL_FOLDER_ACTION_EXPLAIN'=> 'Дія за замовчуванням, що виконується для переповненій папки користувача, у випадку, якщо вибране користувачем дію для папки застосовується. Єдиним винятком є ​​папка «Надіслані», для якої дією за замовчуванням завжди є видалення старих повідомлень.',
	'HOLD_NEW_MESSAGES'			=> 'Відкласти нові повідомлення',
	'PM_EDIT_TIME'				=> 'Обмежити час редагування',
	'PM_EDIT_TIME_EXPLAIN'		=> 'Обмежити час, протягом якого доступне редагування відправленого, але ще не отриманого адресатом приватного повідомлення. Встановіть 0 для зняття обмежень.',
	'PM_MAX_RECIPIENTS'			=> 'Максимальне дозволене число одержувачів ПП',
	'PM_MAX_RECIPIENTS_EXPLAIN'	=> 'Максимальна дозволена кількість одержувачів приватного повідомлення. 0 означає відсутність обмеження. Дане значення може бути встановлено для кожної групи користувачів на сторінці управління групами.',
));

// Post Settings
$lang = array_merge($lang, array(
	'ACP_POST_SETTINGS_EXPLAIN'			=> 'Тут ви можете задати налаштування за замовчуванням для розміщуваних повідомлень.',
	'ALLOW_POST_LINKS'					=> 'Дозволити посилання в звичайних/приватних повідомленнях',
	'ALLOW_POST_LINKS_EXPLAIN'			=> 'У разі заборони тег BBCode <code>[URL]</code> і автоматичне перетворення тексту в посилання буде відключене.',
	'ALLOW_POST_FLASH'					=> 'Дозволити тег BBCode <code>[FLASH]</code> в повідомленнях',
	'ALLOW_POST_FLASH_EXPLAIN'			=> 'Якщо тег BBCode <code>[FLASH]</code> заборонений, він буде відключений в повідомленнях. Визначити користувачів, що мають право використовувати тег BBCode <code>[FLASH]</code>, можна за допомогою системи управління правами доступу.',

	'BUMP_INTERVAL'					=> 'Затримка підняття теми',
	'BUMP_INTERVAL_EXPLAIN'			=> 'Кількість хвилин, годин або днів з останнього повідомлення, по закінченні яких можна піднімати тему. Введіть 0 для відключення цієї можливості',
	'CHAR_LIMIT'					=> 'Максимальна кількість символів у повідомленні',
	'CHAR_LIMIT_EXPLAIN'			=> 'Максимальна кількість символів, дозволених в повідомленнях і в особистих повідомленнях. Введіть 0 для зняття обмежень.',
	'DELETE_TIME'					=> 'Обмеження часу на видалення',
	'DELETE_TIME_EXPLAIN'			=> 'Обмеження часу, протягом якого доступно видалення нових повідомлень. Введіть 0 для відключення цієї можливості.',
	'DISPLAY_LAST_EDITED'			=> 'Відображати відомості про останнє редагування',
	'DISPLAY_LAST_EDITED_EXPLAIN'	=> 'Виберіть для відображення інформації про останнє редагування повідомлення.',
	'EDIT_TIME'						=> 'Обмеження часу на редагування',
	'EDIT_TIME_EXPLAIN'				=> 'Обмеження часу, протягом якого доступне редагування нових повідомлень. Введіть 0 для відключення цієї можливості.',
	'FLOOD_INTERVAL'				=> 'Затримка флуду',
	'FLOOD_INTERVAL_EXPLAIN'		=> 'Кількість секунд, яке повинно пройти між двома повідомленнями користувача. Щоб дозволити користувачам ігнорувати це обмеження, встановіть їм відповідні права.',
	'HOT_THRESHOLD'					=> 'Повідомлень у популярній темі',
	'HOT_THRESHOLD_EXPLAIN'			=> 'Необхідна кількість повідомлень в темі для того, щоб вона набула статусу популярної теми. Введіть 0 для відключення популярних тем.',
	'MAX_POLL_OPTIONS'				=> 'Максимальна кількість варіантів відповіді в опитуваннях',
	'MAX_POST_FONT_SIZE'			=> 'Максимальний розмір шрифту в повідомленні',
	'MAX_POST_FONT_SIZE_EXPLAIN'	=> 'Максимальний розмір шрифту, дозволений в повідомленні. Введіть 0 для зняття обмежень.',
	'MAX_POST_IMG_HEIGHT'			=> 'Максимальна висота зображення в повідомленні',
	'MAX_POST_IMG_HEIGHT_EXPLAIN'	=> 'Максимальна висота зображень/flash в повідомленнях. Введіть 0 для зняття обмежень.',
	'MAX_POST_IMG_WIDTH'			=> 'Максимальна ширина зображення в повідомленні',
	'MAX_POST_IMG_WIDTH_EXPLAIN'	=> 'Максимальна ширина зображень/flash в повідомленнях. Введіть 0 для зняття обмежень.',
	'MAX_POST_URLS'					=> 'Максимальна кількість посилань в повідомленні',
	'MAX_POST_URLS_EXPLAIN'			=> 'Максимальна кількість посилань в повідомленні. Введіть 0 для зняття обмежень.',
	'MIN_CHAR_LIMIT'				=> 'Мінімальна кількість символів у повідомленні',
	'MIN_CHAR_LIMIT_EXPLAIN'		=> 'Мінімальна кількість символів, необхідне для публікації повідомлень і приватних повідомлень. Найменше можливе значення дорівнює 1.',
	'POSTING'						=> 'Розміщення повідомлень',
	'POSTS_PER_PAGE'				=> 'Повідомлень на сторінці',
	'QUOTE_DEPTH_LIMIT'				=> 'Максимальна кількість цитат',
	'QUOTE_DEPTH_LIMIT_EXPLAIN'		=> 'Максимальна глибина вкладеності для цитат в повідомленнях. Введіть 0 для зняття обмежень.',
	'SMILIES_LIMIT'					=> 'Максимальна кількість смайликів в повідомленні',
	'SMILIES_LIMIT_EXPLAIN'			=> 'Максимальна кількість смайликів в повідомленні. Введіть 0 для зняття обмежень.',
	'SMILIES_PER_PAGE'				=> 'Смайликів на сторінці',
	'TOPICS_PER_PAGE'				=> 'Тем на сторінці',
));

// Signature Settings
$lang = array_merge($lang, array(
	'ACP_SIGNATURE_SETTINGS_EXPLAIN'	=> 'Тут ви можете задати налаштування за замовчуванням для підписів.',

	'MAX_SIG_FONT_SIZE'				=> 'Максимальний розмір шрифту в підписі',
	'MAX_SIG_FONT_SIZE_EXPLAIN'		=> 'Максимальний розмір шрифту, дозволений в підписах користувачів. Введіть 0 для зняття обмежень.',
	'MAX_SIG_IMG_HEIGHT'			=> 'Максимальна висота зображення в підписі',
	'MAX_SIG_IMG_HEIGHT_EXPLAIN'	=> 'Максимальна висота зображення/flash в підписах користувачів. Введіть 0 для зняття обмежень.',
	'MAX_SIG_IMG_WIDTH'				=> 'Максимальна ширина зображення в підписі',
	'MAX_SIG_IMG_WIDTH_EXPLAIN'		=> 'Максимальна ширина зображення/flash в підписах користувачів. Введіть 0 для зняття обмежень.',
	'MAX_SIG_LENGTH'				=> 'Максимальна довжина підпису',
	'MAX_SIG_LENGTH_EXPLAIN'		=> 'Максимальна кількість символів у підписах користувачів.',
	'MAX_SIG_SMILIES'				=> 'Максимум смайликів в підпису',
	'MAX_SIG_SMILIES_EXPLAIN'		=> 'Максимальна кількість смайлів, дозволена в підписах користувачів. Введіть 0 для зняття обмежень.',
	'MAX_SIG_URLS'					=> 'Максимум посилань в підписі',
	'MAX_SIG_URLS_EXPLAIN'			=> 'Максимальна кількість посилань у підписах користувачів. Введіть 0 для зняття обмежень.',
));

// Registration Settings
$lang = array_merge($lang, array(
	'ACP_REGISTER_SETTINGS_EXPLAIN'		=> 'Тут ви можете задати налаштування, пов\язані з реєстрацією користувачів.',

	'ACC_ACTIVATION'					=> 'Активація облікових записів',
	'ACC_ACTIVATION_EXPLAIN'			=> 'Ця група налаштувань визначає, чи можуть користувачі мати доступ до конференції відразу після реєстрації або для цього потрібне підтвердження реєстрації. Також тут можна вимкнути реєстрацію взагалі.',
	'NEW_MEMBER_POST_LIMIT'				=> 'Ліміт повідомлень для нових користувачів',
	'NEW_MEMBER_POST_LIMIT_EXPLAIN'		=> 'Знову зареєстровані користувачі будуть знаходитися в групі <em>Нові користувачі</em> до тих пір, поки вони не опублікують зазначеного тут кількості повідомлень. Ви можете використовувати цю групу, щоб перешкодити новим користувачам використовувати систему особистих повідомлень, або для попереднього перегляду їх повідомлень. Введіть 0, якщо хочете відключити цю можливість.',
	'NEW_MEMBER_GROUP_DEFAULT'			=> 'Встановити групу «Нові користувачі» як групу за замовчуванням',
	'NEW_MEMBER_GROUP_DEFAULT_EXPLAIN'	=> 'При включенні даної опції і при вказівці ліміту повідомлень для нових користувачів все знову зареєстровані користувачі будуть не тільки входити в групу <em>Нові користувачі</em>, але ця група також буде призначена їм в якості групи за замовчуванням. Це може бути зручно, наприклад, якщо ви хочете призначити на цю групу певне звання або аватару, які будуть успадковувати нові користувачі.',

	'ACC_ADMIN'					=> 'Адміністратором',
	'ACC_DISABLE'				=> 'Вимкнути реєстрацію',
	'ACC_NONE'					=> 'Без активації (негайний доступ)',
	'ACC_USER'					=> 'Користувачем (email-підтвердження)',
//	'ACC_USER_ADMIN'			=> 'User + Admin',
	'ALLOW_EMAIL_REUSE'			=> 'Дозволити повторне використання email-адреси',
	'ALLOW_EMAIL_REUSE_EXPLAIN'	=> 'Різні користувачі зможуть реєструватися з однаковою email-адресою.',
	'COPPA'						=> 'COPPA',
	'COPPA_FAX'					=> 'Номер факсу для COPPA',
	'COPPA_MAIL'				=> 'Поштова адреса для COPPA',
	'COPPA_MAIL_EXPLAIN'		=> 'Поштова адреса, на який батьки повинні відправляти форми реєстрації COPPA.',
	'ENABLE_COPPA'				=> 'Включити COPPA',
	'ENABLE_COPPA_EXPLAIN'		=> 'Від користувача потрібно підтвердити, чи досяг він віку 13 років або старше, для відповідності вимогам U.S. COPPA Act. Якщо відключено, спеціальна група COPPA більше не буде відображена.',
	'MAX_CHARS'					=> 'макс.',
	'MIN_CHARS'					=> 'мінім.',
	'NO_AUTH_PLUGIN'			=> 'Не знайдено відповідного модуля авторизації.',
	'PASSWORD_LENGTH'			=> 'Довжина пароля',
	'PASSWORD_LENGTH_EXPLAIN'	=> 'Мінімальна і максимальна кількість символів у паролі.',
	'REG_LIMIT'					=> 'Спроби реєстрації',
	'REG_LIMIT_EXPLAIN'			=> 'Максимальна кількість спроб реєстрації з підтвердженням проти спам-ботів, дозволене протягом однієї сесії.',
	'USERNAME_ALPHA_ONLY'		=> 'Тільки буквено-цифрові',
	'USERNAME_ALPHA_SPACERS'	=> 'Буквено-цифрові і роздільники',
	'USERNAME_ASCII'			=> 'ASCII (без міжнародного юнікоду)',
	'USERNAME_LETTER_NUM'		=> 'Будь-які літери та цифри',
	'USERNAME_LETTER_NUM_SPACERS'	=> 'Будь-які літери, цифри і роздільники',
	'USERNAME_CHARS'			=> 'Обмеження на символи в імені користувача',
	'USERNAME_CHARS_ANY'		=> 'Будь-які символи',
	'USERNAME_CHARS_EXPLAIN'	=> 'Символи, які можуть бути використані в іменах користувачів. Роздільниками вважаються символи пробілу, -, +, _, [ и ]',
	'USERNAME_LENGTH'			=> 'Довжина імені користувача',
	'USERNAME_LENGTH_EXPLAIN'	=> 'Мінімальна і максимальна кількість символів в іменах користувачів.',
));

// Feeds
$lang = array_merge($lang, array(
	'ACP_FEED_MANAGEMENT'				=> 'Канали новин',
	'ACP_FEED_MANAGEMENT_EXPLAIN'		=> 'Даний модуль надає різні канали новин у форматі ATOM, обробляючи BBCode в повідомленнях і роблячи його легким для читання в зовнішніх програмах читання каналів новин.',

	'ACP_FEED_GENERAL'					=> 'Загальні налаштування каналів новин',
 	'ACP_FEED_POST_BASED'				=> 'Налаштування каналів повідомлень',
 	'ACP_FEED_TOPIC_BASED'				=> 'Налаштування каналів тем',
 	'ACP_FEED_SETTINGS_OTHER'			=> 'Інші налаштування каналів новин',

	'ACP_FEED_ENABLE'					=> 'Включити канали новин',
	'ACP_FEED_ENABLE_EXPLAIN'			=> 'Включення або відключення каналів новин для всієї конференції. При відключенні цієї опції будуть відключені всі канали новин, незалежно від вказаних нижче параметрів.',
	'ACP_FEED_LIMIT'					=> 'Кількість елементів',
	'ACP_FEED_LIMIT_EXPLAIN'			=> 'Максимальна кількість елементів каналу новин для відображення.',

 	'ACP_FEED_OVERALL'					=> 'Увімкнути спільний канал новин',
 	'ACP_FEED_OVERALL_EXPLAIN'			=> 'Нові повідомлення конференції.',
	'ACP_FEED_FORUM'					=> 'Включити канали форумів',
	'ACP_FEED_FORUM_EXPLAIN'			=> 'Нові повідомлення окремих форумів.',
	'ACP_FEED_TOPIC'					=> 'Включити канали тем',
	'ACP_FEED_TOPIC_EXPLAIN'			=> 'Нові повідомлення окремих тем.',

 	'ACP_FEED_TOPICS_NEW'				=> 'Включити канал нових тем',
 	'ACP_FEED_TOPICS_NEW_EXPLAIN'		=> 'Включає канал «Нові теми», який дозволяє отримувати інформацію про нові теми з текстом першого повідомлення.',
 	'ACP_FEED_TOPICS_ACTIVE'			=> 'Включити канал активних тем',
 	'ACP_FEED_TOPICS_ACTIVE_EXPLAIN'	=> 'Включає канал «Активні теми», який дозволяє отримувати нові активні теми з текстом останнього повідомлення.',
 	'ACP_FEED_NEWS'						=> 'Канал новин',
  	'ACP_FEED_NEWS_EXPLAIN'				=> 'Перші повідомлення нових тем зазначених форумів. Не вибирайте форуми, щоб відключити канал новин.<br />Щоб вибрати кілька форумів, користуйтеся мишею, утримуючи кнопку <samp>CTRL</samp>.',

	'ACP_FEED_OVERALL_FORUMS'			=> 'Включити канал форумів',
	'ACP_FEED_OVERALL_FORUMS_EXPLAIN'	=> 'Включає канал «Всі форуми», який дозволяє отримати список форумів.',

 	'ACP_FEED_HTTP_AUTH'				=> 'Дозволити HTTP-аутентифікацію',
 	'ACP_FEED_HTTP_AUTH_EXPLAIN'		=> 'Включає аутентифікацію через HTTP, яка дозволяє користувачам отримувати інформацію, недоступну для гостей, з додаванням параметра <samp>auth=http</samp> в адресний рядок каналу новин. Врахуйте, що для роботи даної функції на деяких серверах може знадобитися внесення додаткових змін в файл .htaccess.',
	'ACP_FEED_ITEM_STATISTICS'			=> 'Статистика елементів',
	'ACP_FEED_ITEM_STATISTICS_EXPLAIN'	=> 'Відображення індивідуальної статистики під елементами каналу (такий як автор повідомлення, дата і час публікації, кількість відповідей і переглядів).',
	'ACP_FEED_EXCLUDE_ID'				=> 'Виключити дані форуми',
	'ACP_FEED_EXCLUDE_ID_EXPLAIN'		=> 'Вміст наступних форумів не буде включено в канали новин. Не вибирайте нічого, якщо бажаєте отримувати дані зі всіх форумів. Щоб вибрати кілька форумів, користуйтеся мишею, утримуючи кнопку <samp>CTRL</samp>.',
));

// Visual Confirmation Settings
$lang = array_merge($lang, array(
	'ACP_VC_SETTINGS_EXPLAIN'				=> 'Тут ви можете вибрати і налаштувати модулі, призначені для боротьби зі спам-ботами. Ці кошти зазвичай використовують перевірку користувача за допомогою <em>CAPTCHA</em> - спеціального тесту, який складний для автоматичного розпізнавання.',
	'AVAILABLE_CAPTCHAS'					=> 'Доступні модулі',
	'CAPTCHA_UNAVAILABLE'					=> 'Даний модуль не може бути обраний, оскільки вимоги для його використання не виконані.',
	'CAPTCHA_GD'							=> 'GD картинка',
	'CAPTCHA_GD_3D'							=> 'GD 3D картинка',
	'CAPTCHA_GD_FOREGROUND_NOISE'			=> 'Шум на передньому плані',
	'CAPTCHA_GD_EXPLAIN'					=> 'Використовувати бібліотеку GD для створення ускладненою картинки проти спам-ботів.',
	'CAPTCHA_GD_FOREGROUND_NOISE_EXPLAIN'	=> 'Використовувати шум на передньому плані, щоб ускладнити розпізнавання картинки.',
	'CAPTCHA_GD_X_GRID'						=> 'Фоновий шум по горизонталі',
	'CAPTCHA_GD_X_GRID_EXPLAIN'				=> 'Використовуйте менше значення для ускладнення розпізнавання картинки. Введіть 0 для відключення шуму по горизонталі.',
	'CAPTCHA_GD_Y_GRID'						=> 'Фонової шум по вертикалі',
	'CAPTCHA_GD_Y_GRID_EXPLAIN'				=> 'Використовуйте менше значення для ускладнення розпізнавання картинки. Введіть 0 для відключення шуму по вертикалі.',
	'CAPTCHA_GD_WAVE'						=> 'Хвильове перекручування',
	'CAPTCHA_GD_WAVE_EXPLAIN'				=> 'Використовувати хвильове спотворення картинки.',
	'CAPTCHA_GD_3D_NOISE'					=> 'Додати 3D-шум',
	'CAPTCHA_GD_3D_NOISE_EXPLAIN'			=> 'Опція додає до картинки додаткові об\'єкти, розташовуючи їх поверх символів.',
	'CAPTCHA_GD_FONTS'						=> 'Використовувати інші шрифти',
	'CAPTCHA_GD_FONTS_EXPLAIN'				=> 'Опція дозволяє управляти кількістю видів використовуваних символів. Ви можете використовувати значення за замовчуванням або додати змінені символи. Можливе додавання символів у нижньому регістрі.',
	'CAPTCHA_FONT_DEFAULT'					=> 'За замовчуванням',
	'CAPTCHA_FONT_NEW'						=> 'Нові види символів',
	'CAPTCHA_FONT_LOWER'					=> 'Також використовувати нижній регістр',
	'CAPTCHA_NO_GD'							=> 'Проста картинка',
	'CAPTCHA_PREVIEW_MSG'					=> 'Це попередній перегляд. Зміни в налаштуваннях не зберегли.',
	'CAPTCHA_PREVIEW_EXPLAIN'				=> 'Тут показується, як працюватиме модуль при використанні поточних налаштувань.',

	'CAPTCHA_SELECT'						=> 'Встановлені модулі',
	'CAPTCHA_SELECT_EXPLAIN'				=> 'У цьому списку містяться модулі, розпізнані вашої конференцією. Модулі, помічені сірим кольором, недоступні, і, можливо, потребують попередньої налаштуванні перед їх використанням.',
	'CAPTCHA_CONFIGURE'						=> 'Налаштування модулів',
	'CAPTCHA_CONFIGURE_EXPLAIN'				=> 'Змінити налаштування обраного модуля.',
	'CONFIGURE'								=> 'Налаштувати',
	'CAPTCHA_NO_OPTIONS'					=> 'Даний модуль не має налаштувань.',

	'VISUAL_CONFIRM_POST'					=> 'Використовувати засоби проти спам-ботів при відправленні повідомлень гостями',
	'VISUAL_CONFIRM_POST_EXPLAIN'			=> 'Анонімним користувачам знадобиться пройти перевірку засобом проти спам-ботів для запобігання автоматичної відправки повідомлень.',
	'VISUAL_CONFIRM_REG'					=> 'Використовувати засоби проти спам-ботів при реєстрації',
	'VISUAL_CONFIRM_REG_EXPLAIN'			=> 'Новим користувачам знадобиться пройти перевірку засобом проти спам-ботів для запобігання автоматичних реєстрацій.',
	'VISUAL_CONFIRM_REFRESH'				=> 'Дозволити користувачам оновлювати завдання тесту проти спам-ботів',
	'VISUAL_CONFIRM_REFRESH_EXPLAIN'		=> 'Опція дозволяє користувачам запитувати нове завдання тесту проти спам-ботів, якщо вони не змогли впоратися з поточним завданням. Деякі модулі можуть не підтримувати цю функцію.',
));

// Cookie Settings
$lang = array_merge($lang, array(
	'ACP_COOKIE_SETTINGS_EXPLAIN'		=> 'Тут ви можете змінити настройки cookies, що відправляються в браузери відвідувачів. У більшості випадків достатньо налаштувань за замовчуванням. Якщо вам все ж потрібно змінити настройки, то робіть це обережно - неправильні значення можуть призвести до неможливості входу користувачів на конференцію.',

	'COOKIE_DOMAIN'				=> 'Домен cookie',
	'COOKIE_NAME'				=> 'Ім\'я cookie',
	'COOKIE_PATH'				=> 'Шлях cookie',
	'COOKIE_SECURE'				=> 'Безпечні cookie [ https ]',
	'COOKIE_SECURE_EXPLAIN'		=> 'Якщо ваш сервер працює через SSL, то включіть цей параметр. В іншому випадку залиште відключеним. Включення цього параметра, якщо сервер працює не через SSL, призведе до помилок при переходах по сторінках конференції і при переадресації.',
	'ONLINE_LENGTH'				=> 'Часовий діапазон онлайн-статистики',
	'ONLINE_LENGTH_EXPLAIN'		=> 'Кількість хвилин, по закінченні яких неактивні користувачі перестануть бути видимими в списку «Хто зараз на конференції». Збільшення цього значення підвищує витрата ресурсів сервера на створення списку.',
	'SESSION_LENGTH'			=> 'Тривалість сесії',
	'SESSION_LENGTH_EXPLAIN'	=> 'Сесія буде завершена після зазначеного часу в секундах.',
));

// Load Settings
$lang = array_merge($lang, array(
	'ACP_LOAD_SETTINGS_EXPLAIN'	=> 'Тут ви можете включати і відключати деякі функції конференції для зниження навантаження на сервер. Для більшості серверів немає необхідності відключати будь-які функції. Проте на деяких системах або колективних хостингах може бути корисним відключення можливостей, які вам не потрібні. Ви можете також задати обмеження для навантаження на сервер і активних сесій, при перевищенні яких конференція буде відключена.',

	'ALLOW_CDN'            			=> 'Дозволити використання зовнішніх джерел даних',
    'ALLOW_CDN_EXPLAIN'        		=> 'Якщо включено, деякі службові файли конференції будуть завантажуватися з зовнішніх серверів замість власного сервера. Це зменшить потребу вашого сервера в трафіку, але для деяких адміністраторів може стати проблемою з точки зору збереження конфіденційності.',
	'CUSTOM_PROFILE_FIELDS'			=> 'Додаткові поля в профілях',
	'LIMIT_LOAD'					=> 'Обмежити навантаження на сервер',
	'LIMIT_LOAD_EXPLAIN'			=> 'Якщо середня щохвилинна навантаження на сервер перевищує задане значення, конференція буде автоматично відключена. Значення, рівне 1.0, означає ≈100% використання ресурсів одного процесора. Ця можливість застосовна тільки для серверів на основі UNIX. Значення буде скинуто в 0, якщо phpBB не зможе отримати межа завантаження системи.',
	'LIMIT_SESSIONS'				=> 'Обмежити сесії',
	'LIMIT_SESSIONS_EXPLAIN'		=> 'Якщо кількість сесій перевищує задане значення протягом однієї хвилини, конференція буде автоматично відключена. Введіть 0 для зняття обмежень.',
	'LOAD_CPF_MEMBERLIST'			=> 'Дозволити відображення додаткових полів профілю в списку користувачів',
	'LOAD_JQUERY_CDN_EXPLAIN'		=> 'Якщо ця функція включена, буде використаний jQuery з бібліотек Google AJAX API CDN замість локальної копії, що входить в пакет phpBB. У разі, якщо завантажити jQuery з бібліотек CDN не вдасться, phpBB спробує використовувати зазначену локальну копію.',
	'LOAD_CPF_VIEWPROFILE'			=> 'Показувати додаткові поля в профілях користувачів',
	'LOAD_CPF_VIEWTOPIC'			=> 'Показувати додаткові поля профілю на сторінках тем',
	'LOAD_USER_ACTIVITY'			=> 'Показати активність користувача',
	'LOAD_USER_ACTIVITY_EXPLAIN'	=> 'Відображення теми/форуми, в яких користувач найбільш активний, в його профілі та особистому розділі. Рекомендується відключити цю функцію на конференціях з більш ніж одним мільйоном повідомлень.',
	'READ_NOTIFICATION_EXPIRE_DAYS'	=> 'Термін дії прочитаного повідомлення',
	'READ_NOTIFICATION_EXPIRE_DAYS_EXPLAIN' => 'Кількість днів, по закінченню яких прочитане сповіщення буде автоматично видалено. Встановіть 0, щоб прочитані сповіщення не видалялись.',
	'RECOMPILE_STYLES'				=> 'Перекомпілювати старі шаблони',
	'RECOMPILE_STYLES_EXPLAIN'		=> 'Перевірка оновлених компонентів стилів і повторна їх компіляція у разі потреби.',
	'YES_ANON_READ_MARKING'			=> 'Включити маркування тем для гостей',
	'YES_ANON_READ_MARKING_EXPLAIN'	=> 'Зберігати інформацію про статус «прочитано/не прочитано:» для гостей. Якщо відключено, повідомлення для гостей завжди позначені як прочитані.',
	'YES_BIRTHDAYS'					=> 'Включити список днів народження',
	'YES_BIRTHDAYS_EXPLAIN'			=> 'Якщо список днів народження відключений, він не буде відображатися. Для того, щоб ця настройка працювала, повинна бути також включена функція днів народження.',
	'YES_JUMPBOX'					=> 'Включити відображення швидкого переходу',
	'YES_MODERATORS'				=> 'Включити відображення модераторів',
	'YES_ONLINE'					=> 'Включити інформацію про активні користувачах',
	'YES_ONLINE_EXPLAIN'			=> 'Відображати інформацію про активні користувачах на головній сторінці, при перегляді форумів і тем.',
	'YES_ONLINE_GUESTS'				=> 'Включити відображення гостей у списках активних користувачів',
	'YES_ONLINE_GUESTS_EXPLAIN'		=> 'Дозволити відображення інформації про гостей при перегляді «Хто зараз на конференції».',
	'YES_ONLINE_TRACK'				=> 'Включити відображення інформації про користувача «в мережі / не в мережі»',
	'YES_ONLINE_TRACK_EXPLAIN'		=> 'Відображати інформацію про знаходження користувача в мережі в профілях і при перегляді тем.',
	'YES_POST_MARKING'				=> 'Включити свої теми',
	'YES_POST_MARKING_EXPLAIN'		=> 'Показувати, залишав чи користувач повідомлення в темі.',
	'YES_READ_MARKING'				=> 'Включити маркування тем на сервері',
	'YES_READ_MARKING_EXPLAIN'		=> 'Зберігати інформацію про статус «прочитано/не прочитано:» у базі даних, а не в cookies.',
	'YES_UNREAD_SEARCH'				=> 'Увімкнути пошук непрочитаних повідомлень',
));

// Auth settings
$lang = array_merge($lang, array(
	'ACP_AUTH_SETTINGS_EXPLAIN'	=> 'phpBB підтримує розширення аутентифікації, або модулі. Вони дозволяють вам встановити спосіб аутентифікації користувачів при їх вході на конференцію. За умовчанням доступні чотири модулі: DB, LDAP, Apache і OAuth. Не всі методи вимагають додаткової інформації, тому заповнюйте лише ті поля, які необхідні для обраного методу.',

	'AUTH_METHOD'				=> 'Вибрати метод аутентифікації',
	
	'AUTH_PROVIDER_OAUTH_ERROR_ELEMENT_MISSING'	=> 'Для кожного провайдера сервісу OAuth повинні бути вказані і ключ (key), і секретний код (secret). Вказуйте тільки ті, що отримані від відповідного провайдера сервісу OAuth.',
	'AUTH_PROVIDER_OAUTH_EXPLAIN'				=> 'Кожен провайдер OAuth вимагає унікальну пару секретного коду і ключа для аутентифікації за допомогою зовнішнього сервера.<br />Вони повинні бути надані провайдером і ведені у точності в тому вигляді, в якому були отримані.<br />Будь сервіс, який не надає одночасно і ключ, і секретний код, буде недоступний для аутентифікації користувачів конференції.',
	'AUTH_PROVIDER_OAUTH_KEY'					=> 'Ключ',
	'AUTH_PROVIDER_OAUTH_TITLE'					=> 'OAuth',
	'AUTH_PROVIDER_OAUTH_SECRET'				=> 'Секретний код',

	'APACHE_SETUP_BEFORE_USE'	=> 'Необхідно налаштувати аутентифікацію Apache при перемиканні phpBB на цей метод аутентифікації. Пам\'ятайте, що ім\'я користувача для аутентифікації в Apache має збігатися з вашим ім\'ям користувача в phpBB. Аутентифікація Apache може використовуватися тільки з mod_php (чи не з версією CGI) і з відключеним safe_mode.',

	'LDAP_DN'						=> 'Основне ім\'я LDAP [ <var>dn</var> ]',
	'LDAP_DN_EXPLAIN'				=> 'Унікальне ім\'я (Distinguished Name), що визначає інформацію про користувача, наприклад <samp>o=My Company,c=US</samp>.',
	'LDAP_EMAIL'					=> 'Email-атрибут LDAP',
	'LDAP_EMAIL_EXPLAIN'			=> 'Задайте ім\'я атрибута email користувача (якщо він існує) для автоматичного присвоєння email-адрес новим користувачам. Якщо це поле залишити порожнім, то email-адреси користувачів, які вперше увійшли на конференцію, також будуть порожніми.',
	'LDAP_INCORRECT_USER_PASSWORD'	=> 'Спроба зв\'язку з сервером LDAP з вказаним ім\'ям або паролем не вдалася.',
	'LDAP_NO_EMAIL'					=> 'Зазначений атрибут email не існує.',
	'LDAP_NO_IDENTITY'				=> 'Не вдалося знайти ідентифікатор входу в систему для %s.',
	'LDAP_PASSWORD'					=> 'Пароль LDAP',
	'LDAP_PASSWORD_EXPLAIN'			=> 'Залиште поле порожнім для використання анонімного з\'єднання. В іншому випадку введіть пароль для вищевказаного користувача. Потрібно для серверів Active Directory.<br /><em><strong>Увага:</strong> цей пароль буде збережений в базі даних в незашифрованому вигляді і буде видно всім, хто має доступ до неї або до цієї сторінки налаштувань.</em>',
	'LDAP_PORT'						=> 'Порт сервера LDAP',
	'LDAP_PORT_EXPLAIN'				=> 'Ви можете вказати порт, що має використовуватися для з\'єднання з сервером LDAP замість порту за замовчуванням 389.',
	'LDAP_SERVER'					=> 'Ім\'я сервера LDAP',
	'LDAP_SERVER_EXPLAIN'			=> 'Якщо використовується LDAP, вкажіть хост або IP-адресу сервера LDAP. Крім цього, ви можете вказати посилання. наприклад, ldap://hostname:port/.',
	'LDAP_UID'						=> 'Ідентифікаційний номер LDAP [ <var>uid</var> ]',
	'LDAP_UID_EXPLAIN'				=> 'Це ключ, за допомогою якого проводиться пошук заданого ідентифікатора входу в систему. Наприклад, <var>uid</var>, <var>sn</var> і так далі.',
	'LDAP_USER'						=> 'Користувач LDAP [ <var>dn</var> ]',
	'LDAP_USER_EXPLAIN'				=> 'Залиште поле порожнім для використання анонімного з\'єднання. Якщо поле заповнене, phpBB використовує вказане ім\'я при з\'єднанні з сервером LDAP для пошуку правильного користувача. Наприклад, <samp>uid=Username,ou=MyUnit,o=MyCompany,c=US</samp>. Потрібно для серверів Active Directory.',
	'LDAP_USER_FILTER'				=> 'Фільтр імені користувача LDAP',
	'LDAP_USER_FILTER_EXPLAIN'		=> 'Надалі ви можете обмежити діапазон шуканих об\'єктів за допомогою додаткових фільтрів. Наприклад, результатом <samp>objectClass=posixGroup</samp> буде <samp>(&amp;(uid=$username)(objectClass=posixGroup))</samp>.',
));

// Server Settings
$lang = array_merge($lang, array(
	'ACP_SERVER_SETTINGS_EXPLAIN'	=> 'Тут задаються налаштування, пов\'язані з сервером і доменом. Переконайтеся в точності зазначених вами даних, помилки призведуть до розсилання email-повідомлень, що містять невірну інформацію. Задаючи ім\'я домену, пам\'ятайте, що воно повинно включати http:// або префікс іншого протоколу. Змінюйте номер порту тільки у випадку, якщо вам точно відомо, що сервер використовує інше значення, порт 80 підходить в більшості випадків.',

	'ENABLE_GZIP'				=> 'Включити стиснення GZip',
	'ENABLE_GZIP_EXPLAIN'		=> 'Генерується вміст буде стискатися за допомогою GZip перед відправкою користувачеві. Включення цієї опції допомагає зменшити витрату мережевого трафіку, але в той же час трохи збільшує використання центрального процесора, як на стороні клієнта, так і на сервері. Потрібен розширення PHP zlib.',
	'FORCE_SERVER_VARS'			=> 'Примусові налаштування URL сервера',
	'FORCE_SERVER_VARS_EXPLAIN'	=> 'Якщо вибрано, то зазначені тут налаштування будуть використані замість автоматично певних значень.',
	'ICONS_PATH'				=> 'Шлях до піктограм повідомлень',
	'ICONS_PATH_EXPLAIN'		=> 'Шлях щодо кореневої папки phpBB. Наприклад, <samp>images/icons</samp>.',
	'MOD_REWRITE_ENABLE'        => 'Вкоючити URL Rewriting',
    'MOD_REWRITE_ENABLE_EXPLAIN' => 'Якщо включено, адреси URL, що містять ’app.php’, будуть змінені так, щоб у них не значилося ім\'я виконуваного файлу (наприклад: app.php/foo буде виглядати як /foo). <strong>Для роботи даної функції потрібно включити модуль mod_rewrite сервера Apache; якщо вона включена в відсутність модуля mod_rewrite, адреси URL на конференції можуть відображатися невірно.</strong>',
    'MOD_REWRITE_DISABLED'      => 'Модуль <strong>mod_rewrite</strong>веб-сервера Apache вимкнено. Увімкніть модуль, або зв\'яжіться з провайдером веб-хостингу для того, щоб використовувати цю функцію.',
    'MOD_REWRITE_INFORMATION_UNAVAILABLE' => 'Неможливо визначити, чи підтримується URL rewriting даним сервером. Дана функція може бути включена, проте, якщо URL rewriting не підтримується, адреси на конференції (такі, як посилання) можуть відображатися невірно. Зв\'яжіться з провайдером веб-хостингу, якщо не впевнені в тому, чи безпечно включення даної функції.',
	'PATH_SETTINGS'				=> 'Параметри шляхів',
	'RANKS_PATH'				=> 'Шлях до картинок звань',
	'RANKS_PATH_EXPLAIN'		=> 'Шлях щодо кореневої папки phpBB. Наприклад, <samp>images/ranks</samp>.',
	'SCRIPT_PATH'				=> 'Шлях до конференції',
	'SCRIPT_PATH_EXPLAIN'		=> 'Шлях до папки, яка містить phpBB, щодо імені домену. Наприклад, <samp>/phpBB3</samp>.',
	'SERVER_NAME'				=> 'Ім\'я домену',
	'SERVER_NAME_EXPLAIN'		=> 'Ім\'я домену, на якому працює конференція. Наприклад, <samp>www.example.com</samp>.',
	'SERVER_PORT'				=> 'Порт сервера',
	'SERVER_PORT_EXPLAIN'		=> 'Порт, на якому запущений сервер, зазвичай це порт 80, змінюйте тільки у випадку, якщо сервер використовує інший порт.',
	'SERVER_PROTOCOL'			=> 'Протокол сервера',
	'SERVER_PROTOCOL_EXPLAIN'	=> 'Використовується в якості протоколу сервера, якщо ці налаштування включені примусово. Якщо не задано або не включене примусово, протокол буде визначений з налагодження безпечних cookie (<samp>http://</samp> или <samp>https://</samp>).',
	'SERVER_URL_SETTINGS'		=> 'Налаштування URL сервера',
	'SMILIES_PATH'				=> 'Шлях до смайликів',
	'SMILIES_PATH_EXPLAIN'		=> 'Шлях щодо кореневої папки phpBB. Наприклад, <samp>images/smilies</samp>.',
	'UPLOAD_ICONS_PATH'			=> 'Шлях до значків груп розширень',
	'UPLOAD_ICONS_PATH_EXPLAIN'	=> 'Шлях щодо кореневої папки phpBB. Наприклад, <samp>images/upload_icons</samp>.',
	'USE_SYSTEM_CRON'		=> 'Виконувати періодичні завдання через системний планувальник (cron)',
	'USE_SYSTEM_CRON_EXPLAIN'		=> 'Якщо відключено, phpBB буде виконувати періодичні завдання автоматично. Якщо включено, phpBB НЕ буде самостійно виконувати періодичні задачі; замість цього, системний адміністратор повинен додати виконання <code>cron.php</code> в системний планувальник (cron) з певним інтервалом (наприклад, кожні 5 хвилин).',
));

// Security Settings
$lang = array_merge($lang, array(
	'ACP_SECURITY_SETTINGS_EXPLAIN'	=> 'Тут ви можете задати налаштування, пов\'язані з сесіями і входом користувачів на конференцію.',

	'ALL'							=> 'Повна',
	'ALLOW_AUTOLOGIN'				=> 'Дозволити функцію «Запам\'ятати мене»',
	'ALLOW_AUTOLOGIN_EXPLAIN'		=> 'Опція визначає, чи дозволено користувачам функція «Запам\'ятати мене» при відвідуванні конференції.',
	'ALLOW_PASSWORD_RESET'			=> 'Дозволити відновлення пароля («Забули пароль»)',
	'AUTOLOGIN_LENGTH'				=> 'Час дії автоматичного входу при використанні функції «Запам\'ятати мене» (днів)',
	'AUTOLOGIN_LENGTH_EXPLAIN'		=> 'Количество дней, по прошествии которых пользователь должен будет снова ввести свои имя и пароль для входа на конференцию, при использовании функции «Запомнить меня». Введите 0 для снятия ограничений.',
	'BROWSER_VALID'					=> 'Перевірка браузера',
	'BROWSER_VALID_EXPLAIN'			=> 'Включає перевірку браузера при кожній сесії для підвищення безпеки.',
	'CHECK_DNSBL'					=> 'Перевірити IP-адресу по чорному списку DNS (DNS Blackhole List)',
	'CHECK_DNSBL_EXPLAIN'			=> 'Якщо включено, IP-адресу користувача буде перевірений за допомогою наступних служб DNSBL при реєстрації або відправці повідомлень: <a href="http://spamcop.net">spamcop.net</a> и <a href="http://www.spamhaus.org">www.spamhaus.org</a>. Ця процедура може зайняти якийсь час залежно від конфігурації сервера. У разі уповільнення роботи сервера або великої кількості помилкових спрацьовувань рекомендується відключити цю перевірку.',
	'CLASS_B'						=> 'A.B',
	'CLASS_C'						=> 'A.B.C',
	'EMAIL_CHECK_MX'				=> 'Перевірити правильність поштового запису в DNS (MX Record) домена email-адреса',
	'EMAIL_CHECK_MX_EXPLAIN'		=> 'Якщо включено, домен email-адреси, вказаний при реєстрації або зміну профілю, перевіряється на правильність поштового запису в DNS (MX Record).',
	'FORCE_PASS_CHANGE'				=> 'Примусова зміна пароля',
	'FORCE_PASS_CHANGE_EXPLAIN'		=> 'Користувач повинен буде змінити свій пароль після зазначеного кількості днів. Введіть 0 для відключення цієї функції.',
	'FORM_TIME_MAX'					=> 'Максимальний час для відправки форми',
	'FORM_TIME_MAX_EXPLAIN'			=> 'Час, за який користувач повинен відправити форму. Встановіть -1 для відключення цієї функції. Врахуйте, що форма може застаріти після закінчення сесії, незалежно від даної опції.',
	'FORM_SID_GUESTS'				=> 'Прив\'язати форми до гостьовим сесіям',
	'FORM_SID_GUESTS_EXPLAIN'		=> 'Якщо включено, форми, що відправляються гостями, будуть прив\'язані до конкретних сесіям. Це може викликати проблеми з деякими інтернет-провайдерами.',
	'FORWARDED_FOR_VALID'			=> 'Перевірка заголовка <var>X_FORWARDED_FOR</var>',
	'FORWARDED_FOR_VALID_EXPLAIN'	=> 'Сесія буде продовжена тільки в тому випадку, якщо відправлений заголовок <var>X_FORWARDED_FOR</var> відповідає відправленому у попередньому запиті. Блокування доступу за IP-адресою здійснюватиметься за IP-адресами із заголовка <var>X_FORWARDED_FOR</var>.',
	'IP_VALID'						=> 'Перевірка IP-адреси сесії',
	'IP_VALID_EXPLAIN'				=> 'Визначає, яка частина IP-адреси користувача використовується для перевірки сесії. <samp>Повна</samp> означає перевірку всієї адреси, <samp>A.B.C</samp> — перших трьох чисел (x.x.x), <samp>A.B</samp> — перших двох чисел (x.x), <samp>Ні</samp> відключає перевірку. В адресах IPv6 <samp>A.B.C</samp> порівнює перші 4 блоки і <samp>A.B</samp> — перші 3 блоки.',
	'IP_LOGIN_LIMIT_MAX'			=> 'Максимальне число спроб входу для одного IP адреси',
	'IP_LOGIN_LIMIT_MAX_EXPLAIN'	=> 'Поріг дозволеного числа спроб входу з однієї IP адреси до включення завдання проти спам-ботів. Введіть 0 для відключення цієї функції.',
	'IP_LOGIN_LIMIT_TIME'			=> 'Час дії для спроб входу з IP адреси',
	'IP_LOGIN_LIMIT_TIME_EXPLAIN'	=> 'Інформація про спроби входу буде очищена після зазначеного часу.',
	'IP_LOGIN_LIMIT_USE_FORWARDED'	=> 'Обмежити кількість спроб входу по заголовку <var>X_FORWARDED_FOR</var>',
	'IP_LOGIN_LIMIT_USE_FORWARDED_EXPLAIN'	=> 'Замість обмеження кількості спроб входу по IP адресою, обмеження буде проводитися за значеннями адреси в заголовку <var>X_FORWARDED_FOR</var>. <br /><em><strong>Увага:</strong> Включайте дану функцію тільки у випадку, якщо використовується проксі-сервер, що встановлює достовірні значення заголовка <var>X_FORWARDED_FOR</var>.</em>',
	'MAX_LOGIN_ATTEMPTS'			=> 'Максимальне число спроб входу по імені користувача',
	'MAX_LOGIN_ATTEMPTS_EXPLAIN'	=> 'Поріг дозволеного числа спроб входу для одного облікового запису до включення завдання проти спам-ботів. Введіть 0 для відключення цієї функції.',
	'NO_IP_VALIDATION'				=> 'Ні',
	'NO_REF_VALIDATION'				=> 'Ні',
	'PASSWORD_TYPE'					=> 'Складність пароля',
	'PASSWORD_TYPE_EXPLAIN'			=> 'Визначає, наскільки складним повинен бути пароль при його установці або зміну. Кожен наступний варіант обмеження включає в себе попередні.',
	'PASS_TYPE_ALPHA'				=> 'Повинен містити буквено-цифрові символи',
	'PASS_TYPE_ANY'					=> 'Вимоги відсутні',
	'PASS_TYPE_CASE'				=> 'Повинен містити символи різного регістру',
	'PASS_TYPE_SYMBOL'				=> 'Повинен містити символи',
	'REF_HOST'						=> 'Перевіряти тільки хост',
	'REF_PATH'						=> 'Перевіряти також шлях',
	'REFERER_VALID'					=> 'Перевіряти реферер',
	'REFERER_VALID_EXPLAIN'			=> 'Якщо включено, реферер для запитів типу POST буде перевірений на параметри хоста/шляху до скрипту. Це може викликати проблеми з конференціями, які використовують декілька доменів або зовнішні аутентифікації.',
	'TPL_ALLOW_PHP'					=> 'Дозволити php в шаблонах',
	'TPL_ALLOW_PHP_EXPLAIN'			=> 'Якщо ця функція включена, команди <code>PHP</code> і <code>INCLUDEPHP</code> будуть розпізнаватися і виконуватися в шаблонах.',
));

// Email Settings
$lang = array_merge($lang, array(
	'ACP_EMAIL_SETTINGS_EXPLAIN'	=> 'Ця інформація використовується для відправки конференцією email-повідомлень користувачам. Переконайтеся в правильності зазначених email-адрес, всі повернуті або недоставлені повідомлення будуть, ймовірно, відправлені на них. Якщо ваш сервер не забезпечує використання вбудованої (в PHP) служби email, Ви можете відправляти повідомлення безпосередньо з використанням SMTP. Для цього необхідний адресу відповідного сервера (якщо потрібно, запитайте про це у провайдера). Якщо сервер вимагає аутентифікації (і тільки в цьому випадку), введіть необхідні ім\'я, пароль і метод аутентифікації.',

	'ADMIN_EMAIL'					=> 'Зворотній email-адреса',
	'ADMIN_EMAIL_EXPLAIN'			=> 'Ця адреса буде використана для повернення всіх email-повідомлень як email-адресу для технічних контактів. Він завжди буде використовуватися в якості адрес <samp>Return-Path</samp> і <samp>Sender</samp> в email-повідомленнях.',
	'BOARD_EMAIL_FORM'				=> 'Розсилка email-повідомлень через конференцію',
	'BOARD_EMAIL_FORM_EXPLAIN'		=> 'Користувачі зможуть відправляти email-повідомлення через конференцію замість їх звичайної відправки.',
	'BOARD_HIDE_EMAILS'				=> 'Приховувати email-адресу',
	'BOARD_HIDE_EMAILS_EXPLAIN'		=> 'Ця функція повністю зберігає в таємниці email-адреса.',
	'CONTACT_EMAIL'					=> 'Контактний email-адрес',
	'CONTACT_EMAIL_EXPLAIN'			=> 'Ця адреса буде використовуватися при кожній необхідності контакту, наприклад, у випадку спаму, помилок і т.п. Він завжди буде використовуватися в якості адрес <samp>From</samp> і <samp>Reply-To</samp> в email-повідомленнях.',
	'EMAIL_FUNCTION_NAME'			=> 'Ім\'я функції email',
	'EMAIL_FUNCTION_NAME_EXPLAIN'	=> 'Функція email, використовувана для відправки повідомлень через PHP.',
	'EMAIL_PACKAGE_SIZE'			=> 'Розмір поштової пакету',
	'EMAIL_PACKAGE_SIZE_EXPLAIN'	=> 'Максимальна кількість email-повідомлень, що відправляються за один раз. Ця настройка застосовується для внутрішньої черги повідомлень; встановіть 0 при виникненні проблем, пов\'язаних з невідправленими повідомленнями по email.',
	'EMAIL_SIG'						=> 'Підпис у email-повідомленні',
	'EMAIL_SIG_EXPLAIN'				=> 'Цей текст буде додано в усі email-повідомлення, що відправляються конференцією.',
	'ENABLE_EMAIL'					=> 'Включити email-повідомлення',
	'ENABLE_EMAIL_EXPLAIN'			=> 'Якщо відключено, відправка будь-яких електронних повідомлень з конференції проводитися не буде. <em>Примітка: дана опція повинна бути включена, якщо ви хочете задіяти активацію облікового запису адміністратором або користувачем. При відключенні даної опції варіанти активації облікового запису користувачем або адміністратором стануть недоступні.</em>',
	'SMTP_AUTH_METHOD'				=> 'Метод аутентифікації для SMTP',
	'SMTP_AUTH_METHOD_EXPLAIN'		=> 'Використовується тільки у випадку, якщо задані ім\'я/пароль. Запитайте у свого провайдера, якщо не впевнені, який метод аутентифікації використовувати.',
	'SMTP_CRAM_MD5'					=> 'CRAM-MD5',
	'SMTP_DIGEST_MD5'				=> 'DIGEST-MD5',
	'SMTP_LOGIN'					=> 'LOGIN',
	'SMTP_PASSWORD'					=> 'Пароль SMTP',
	'SMTP_PASSWORD_EXPLAIN'			=> 'Введіть пароль, тільки якщо SMTP вимагає цього.<br /><em><strong>Увага:</strong> цей пароль буде збережений в базі даних в незашифрованому вигляді і буде видно всім, хто має доступ до неї або до цієї сторінки налаштувань.</em>',
	'SMTP_PLAIN'					=> 'PLAIN',
	'SMTP_POP_BEFORE_SMTP'			=> 'POP-BEFORE-SMTP',
	'SMTP_PORT'						=> 'Порт сервера SMTP',
	'SMTP_PORT_EXPLAIN'				=> 'Змінюйте порт тільки в тому випадку, якщо вам точно відомо, що сервер використовує інший порт.',
	'SMTP_SERVER'					=> 'Адреса сервера SMTP',
	'SMTP_SETTINGS'					=> 'Налаштування SMTP',
	'SMTP_USERNAME'					=> 'Ім\'я користувача SMTP',
	'SMTP_USERNAME_EXPLAIN'			=> 'Введіть ім\'я тільки у випадку, якщо сервер SMTP вимагає цього.',
	'USE_SMTP'						=> 'Використовувати SMTP для відправки email-повідомлень',
	'USE_SMTP_EXPLAIN'				=> 'Виберіть «Так», якщо хочете або повинні відправляти email-повідомлення через сервер замість локальної функції mail.',
));

// Jabber settings
$lang = array_merge($lang, array(
	'ACP_JABBER_SETTINGS_EXPLAIN'	=> 'Тут ви можете включити і налаштувати використання Jabber в якості миттєвих повідомлень і повідомлень з конференції. Jabber - це протокол з відкритим вихідним кодом, і тому доступний для використання всіма бажаючими. Деякі сервери Jabber мають шлюзи і протоколи передачі, що дозволяють зв\'язуватися з користувачами інших мереж. Не всі сервери надають всі види протоколів передачі, а зміни в протоколах можуть перешкоджати правильній роботі. Переконайтеся в тому, що ви ввели дані зареєстрованої облікового запису - phpBB буде використовувати ці дані у своїй роботі.',

	'JAB_ENABLE'				=> 'Включити Jabber',
	'JAB_ENABLE_EXPLAIN'		=> 'Включення опції дозволить використовувати Jabber для відправки миттєвих повідомлень і сповіщень.',
	'JAB_GTALK_NOTE'			=> 'GTalk не працюватиме, оскільки функція <samp>dns_get_record</samp> не знайдена. Дана функція недоступна в PHP4 і не реалізована на платформах Windows. В даний час функція також не працює на системах BSD, включаючи Mac OS.',
	'JAB_PACKAGE_SIZE'			=> 'Розмір пакета Jabber',
	'JAB_PACKAGE_SIZE_EXPLAIN'	=> 'Кількість повідомлень, що відправляються в одному пакеті. Якщо ввести 0, то повідомлення будуть відправлятися негайно без постановки в чергу для подальшого надсилання.',
	'JAB_PASSWORD'				=> 'Пароль Jabber',
 	'JAB_PASSWORD_EXPLAIN'		=> '<em><strong>Увага:</strong> цей пароль буде збережений в базі даних в незашифрованому вигляді і буде видно всім, хто має доступ до неї або до цієї сторінки налаштувань.</em>',
	'JAB_PORT'					=> 'Порт Jabber',
	'JAB_PORT_EXPLAIN'			=> 'Залиште порожнім, якщо вам відомо, що використовується порт, відмінний від 5222.',
	'JAB_SERVER'				=> 'Сервер Jabber',
	'JAB_SERVER_EXPLAIN'		=> 'Дивіться список серверів на %sjabber.org%s.',
	'JAB_SETTINGS_CHANGED'		=> 'Налаштування Jabber успішно змінені.',
	'JAB_USE_SSL'				=> 'Використовувати SSL для з\'єднання',
	'JAB_USE_SSL_EXPLAIN'		=> 'При включенні опції буде проведена спроба установки безпечного з\'єднання. Порт Jabber буде змінений на 5223, якщо вказано порт 5222.',
	'JAB_USERNAME'				=> 'Ім\'я користувача або JID (ідентифікатор) Jabber',
	'JAB_USERNAME_EXPLAIN'		=> 'Введіть ім\'я або існуючий JID (ідентифікатор) зареєстрованого користувача. Перевірка імені проводитися не буде. Якщо зазначено лише ім\'я, то ваш JID (ідентифікатор) буде складений з цього імені та зазначеного вище імені сервера. В іншому випадку вкажіть існуючий JID (ідентифікатор), наприклад user@jabber.org.',
));
