<?php
/**
*
* acp_permissions [Ukrainian]
*
* @package language
* @copyright (c) 2005 phpBB Group
* @license http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ACP_PERMISSIONS_EXPLAIN'	=> '
		<p>Права доступу надзвичайно деталізовані і згруповані в чотири основні розділи:</p>

		<h2>Глобальні права доступу</h2>
		<p>Ці права використовуються для управління доступом на глобальному рівні і застосовуються до всієї конференції в цілому. Далі вони розділені на права користувачів, груп, адміністраторів і супермодераторів.</p>

		<h2>Локальні права доступу</h2>
		<p>Ці права використовуються для управління доступом на рівні форумів. Далі вони розділені на Доступ до форумів, Модератори форумів, Форумні права користувачів, Форумні права груп.</p>

		<h2>Ролі</h2>
		<p>Вони використовуються для створення різних типових наборів прав доступу, щоб надалі можна було призначати права, засновані на рольовому доступі. Набір ролей за замовчуванням повинен цілком задовольняти потреби адміністрування великих і малих конференцій, проте в кожному з чотирьох розділів ви можете додавати, змінювати і видаляти ролі так, як вважаєте за доцільне.</p>

		<h2>Маски прав доступу</h2>
		<p>Маски прав доступу використовуються для перегляду діючих прав доступу, призначених користувачам, модераторам (локальним і супермодераторів), адміністраторам і на форуми.</p>

		<br />

		<p>Для отримання детальнішої інформації по налаштуванню і управлінню правами доступу вашого phpBB3 форуму дивіться <a href="https://www.phpbb.com/support/documentation/3.0/quickstart/quick_permissions.html">Розділ 1.5 нашого керівництва</a>.</p>
	',

	'ACL_NEVER'				=> 'Ніколи',
	'ACL_SET'				=> 'Налаштування прав доступу',
	'ACL_SET_EXPLAIN'		=> 'Права доступу засновані на простій системі <samp>ТАК</samp>/<samp>НІ</samp>. Встановлення значення <samp>НІКОЛИ</samp> для користувача або групи означає ігнорування будь-яких інших значень, встановлених по даній опції. Якщо ви не хочете призначати право по опції для даного користувача або групи, виберіть <samp>НІ</samp>. Якщо значення по цій опції встановлені де-небудь ще, вони будуть мати більш високий пріоритет, якщо не встановлено <samp>НІКОЛИ</samp>. Всі зазначені об\'єкти (з встановленим прапорцем) відображають встановлені значення прав доступу.',
	'ACL_SETTING'			=> 'Налаштування',

	'ACL_TYPE_A_'			=> 'Права адміністратора',
	'ACL_TYPE_F_'			=> 'Доступ до форумів',
	'ACL_TYPE_M_'			=> 'Права модератора',
	'ACL_TYPE_U_'			=> 'Права користувача',

	'ACL_TYPE_GLOBAL_A_'	=> 'Права адміністратора',
	'ACL_TYPE_GLOBAL_U_'	=> 'Права користувача',
	'ACL_TYPE_GLOBAL_M_'	=> 'Права супермодератора',
	'ACL_TYPE_LOCAL_M_'		=> 'права модератора форума',
	'ACL_TYPE_LOCAL_F_'		=> 'доступ до форумів',

	'ACL_NO'				=> 'Ні',
	'ACL_VIEW'				=> 'Перегляд прав доступу',
	'ACL_VIEW_EXPLAIN'		=> 'Тут ви можете бачити діючі права користувача або групи. Червоний колір вказує на відсутність права у користувача або у групи, а зелений - на наявність права у користувача або у групи.',
	'ACL_YES'				=> 'Так',

	'ACP_ADMINISTRATORS_EXPLAIN'				=> 'Тут ви можете призначати адміністраторські права користувачам і групам. Всі користувачі з ролями адміністраторів можуть переглядати панель адміністратора.',
	'ACP_FORUM_MODERATORS_EXPLAIN'				=> 'Тут ви можете призначати користувачів та групи користувачів модераторами форумів. Для призначення користувачам прав доступу до форумів, а також для визначення прав супермодератора та адміністратора, використовуйте відповідну сторінку.',
	'ACP_FORUM_PERMISSIONS_EXPLAIN'				=> 'Тут ви можете змінювати для кожного користувача і групи доступ до кожного форуму. Для призначення модераторів або визначення прав адміністратора використовуйте відповідну сторінку.',
	'ACP_FORUM_PERMISSIONS_COPY_EXPLAIN'		=> 'Тут ви можете копіювати форумні права доступу з одного форуму на інший форум або відразу в кілька інших форумів.',
	'ACP_GLOBAL_MODERATORS_EXPLAIN'				=> 'Тут ви можете призначати права супермодератора користувачам або групам. Супермодератори подібні звичайним модераторам, за винятком того, що вони мають доступ до управління всіма форумами конференції.',
	'ACP_GROUPS_FORUM_PERMISSIONS_EXPLAIN'		=> 'Тут ви можете призначати форумні права груп.',
	'ACP_GROUPS_PERMISSIONS_EXPLAIN'			=> 'Тут ви можете призначати глобальні права доступу для груп - права користувачів, права супермодераторів і права адміністраторів. Права користувачів включають такі можливості, як використання аватари, відправка особистих повідомлень і так далі; права супермодератора - такі, як схвалення повідомлень, управління темами, управління блокуванням і так далі, і, нарешті, права адміністратора - такі, як зміна прав доступу, визначення нових BBCodes, управління форумами і так далі. Індивідуально права доступу користувачів слід змінювати в крайніх випадках. Переважний метод полягає в приміщенні користувачів у групи і в призначенні прав групам.',
	'ACP_ADMIN_ROLES_EXPLAIN'					=> 'Тут ви можете керувати ролями адміністраторів. Ролі містять діючі права доступу; якщо ви зміните зміст ролі, то зміняться права доступу всіх для користувачів і груп, яким призначена дана роль.',
	'ACP_FORUM_ROLES_EXPLAIN'					=> 'Тут ви можете керувати форумних ролями. Ролі містять діючі права доступу; якщо ви зміните зміст ролі, то зміняться права доступу всіх для користувачів і груп, яким призначена дана роль.',
	'ACP_MOD_ROLES_EXPLAIN'						=> 'Тут ви можете керувати ролями модераторів. Ролі містять діючі права доступу; якщо ви зміните зміст ролі, то зміняться права доступу всіх для користувачів і груп, яким призначена дана роль.',
	'ACP_USER_ROLES_EXPLAIN'					=> 'Тут ви можете керувати призначеними для користувача ролями. Ролі містять діючі права доступу; якщо ви зміните зміст ролі, то зміняться права доступу всіх для користувачів і груп, яким призначена дана роль.',
	'ACP_USERS_FORUM_PERMISSIONS_EXPLAIN'		=> 'Тут ви можете призначати користувачам права доступу до форумів.',
	'ACP_USERS_PERMISSIONS_EXPLAIN'				=> 'Тут ви можете призначати глобальні права доступу для користувачів - права користувачів, права супермодераторів і права адміністраторів. Права користувачів включають такі можливості, як використання аватари, відправка приватни повідомлень і так далі; права супермодератора - такі, як схвалення повідомлень, управління темами, управління блокуванням і так далі, і, нарешті, права адміністратора - такі, як зміна прав доступу, визначення нових BBCodes, управління форумами і так далі. Індивідуально права доступу користувачів слід змінювати в крайніх випадках. Переважний метод полягає в приміщенні користувачів у групи і в призначенні прав групам.',
	'ACP_VIEW_ADMIN_PERMISSIONS_EXPLAIN'		=> 'Тут ви можете переглянути діючі права адміністраторів доступу для обраних користувачів і груп.',
	'ACP_VIEW_GLOBAL_MOD_PERMISSIONS_EXPLAIN'	=> 'Тут ви можете переглянути діючі права супермодераторів доступу для обраних користувачів і груп.',
	'ACP_VIEW_FORUM_PERMISSIONS_EXPLAIN'		=> 'Тут ви можете переглянути діючі локальні права доступу для обраних форумів, користувачів і груп.',
	'ACP_VIEW_FORUM_MOD_PERMISSIONS_EXPLAIN'	=> 'Тут ви можете переглянути діючі права модераторів доступу для обраних форумів, користувачів і груп.',
	'ACP_VIEW_USER_PERMISSIONS_EXPLAIN'			=> 'Тут ви можете переглянути діючі права користувачів доступу для обраних користувачів і груп.',

	'ADD_GROUPS'				=> 'Додати групи',
	'ADD_PERMISSIONS'			=> 'Додати права',
	'ADD_USERS'					=> 'Додати користувачів',
	'ADVANCED_PERMISSIONS'		=> 'Розширені права',
	'ALL_GROUPS'				=> 'Вибрати всі групи',
	'ALL_NEVER'					=> 'Все <samp>НІКОЛИ</samp>',
	'ALL_NO'					=> 'Все <samp>НІ</samp>',
	'ALL_USERS'					=> 'Вибрати всіх користувачів',
	'ALL_YES'					=> 'Все <samp>ТАК</samp>',
	'APPLY_ALL_PERMISSIONS'		=> 'Застосувати всі права',
	'APPLY_PERMISSIONS'			=> 'Застосувати права',
	'APPLY_PERMISSIONS_EXPLAIN'	=> 'Права і роль, зазначені для цього елемента, будуть застосовані до цього елемента і до зазначених елементів.',
	'AUTH_UPDATED'				=> 'Права доступу оновлені.',

	'COPY_PERMISSIONS_CONFIRM'				=> 'Ви дійсно хочете виконати цю дію? Пам\'ятайте, що це дію перезапише всі наявні права обраних форумів.',
	'COPY_PERMISSIONS_FORUM_FROM_EXPLAIN'	=> 'Вихідний форум, з якого ви хочете скопіювати права доступу.',
	'COPY_PERMISSIONS_FORUM_TO_EXPLAIN'		=> 'Кінцеві форуми, до яких ви хочете застосувати скопійовані права доступу.',
	'COPY_PERMISSIONS_FROM'					=> 'Копіювати права з форуму',
	'COPY_PERMISSIONS_TO'					=> 'Застосувати права до форумів',

	'CREATE_ROLE'				=> 'Створити роль',
	'CREATE_ROLE_FROM'			=> 'Використовувати налаштування ролі…',
	'CUSTOM'					=> 'Інше…',

	'DEFAULT'					=> 'За замовчуванням',
	'DELETE_ROLE'				=> 'Видалення ролі',
	'DELETE_ROLE_CONFIRM'		=> 'Ви дійсно хочете видалити цю роль? Об\'єкти з даної роллю <strong>не</strong> втратять визначені нею налаштування прав доступу.',
	'DISPLAY_ROLE_ITEMS'		=> 'Дивитись об\'єкти з даної роллю',

	'EDIT_PERMISSIONS'			=> 'Редагувати права',
	'EDIT_ROLE'					=> 'Редагувати роль',

	'GROUPS_NOT_ASSIGNED'		=> 'Немає груп з даною роллю',

	'LOOK_UP_GROUP'				=> 'Вибір групи',
	'LOOK_UP_USER'				=> 'Вибір користувача',

	'MANAGE_GROUPS'		=> 'Управління групами',
	'MANAGE_USERS'		=> 'Управління користувачами',

	'NO_AUTH_SETTING_FOUND'		=> 'Налаштування прав доступу не визначені.',
	'NO_ROLE_ASSIGNED'			=> 'Роль не призначена…',
	'NO_ROLE_ASSIGNED_EXPLAIN'	=> 'Цей вибір не змінює призначених прав доступу (праворуч). Якщо ви хочете скинути або видалити всі права доступу, то необхідно використовувати посилання «Все <samp>НІ</samp>».',
	'NO_ROLE_AVAILABLE'			=> 'Ролі недоступні',
	'NO_ROLE_NAME_SPECIFIED'	=> 'Введіть ім\'я ролі.',
	'NO_ROLE_SELECTED'			=> 'Роль не знайдена.',
	'NO_USER_GROUP_SELECTED'	=> 'Ви не обрали користувача або групу.',

	'ONLY_FORUM_DEFINED'	=> 'Ви визначили тільки форуми. Виберіть, принаймні, одного користувача або групу.',

	'PERMISSION_APPLIED_TO_ALL'		=> 'Права доступу та роль будуть застосовані для всіх зазначених об\'єктів',
	'PLUS_SUBFORUMS'				=> '+підфоруми',

	'REMOVE_PERMISSIONS'			=> 'Видалити права',
	'REMOVE_ROLE'					=> 'Видалити роль',
	'RESULTING_PERMISSION'			=> 'Підсумкові права',
	'ROLE'							=> 'Роль',
	'ROLE_ADD_SUCCESS'				=> 'Роль успішно добавлена.',
	'ROLE_ASSIGNED_TO'				=> 'Кому призначена роль «%s»',
	'ROLE_DELETED'					=> 'Роль успішно видалена.',
	'ROLE_DESCRIPTION'				=> 'Опис ролі',

	'ROLE_ADMIN_FORUM'			=> 'Адміністратор форуму',
	'ROLE_ADMIN_FULL'			=> 'Адміністратор конференції',
	'ROLE_ADMIN_STANDARD'		=> 'Стандартний адміністратор',
	'ROLE_ADMIN_USERGROUP'		=> 'Адміністратор користувачів та груп',
	'ROLE_FORUM_BOT'			=> 'Доступ для бота',
	'ROLE_FORUM_FULL'			=> 'Повний доступ',
	'ROLE_FORUM_LIMITED'		=> 'Обмежений доступ',
	'ROLE_FORUM_LIMITED_POLLS'	=> 'Обмежений доступ з опитуваннями',
	'ROLE_FORUM_NOACCESS'		=> 'Немає доступа',
	'ROLE_FORUM_ONQUEUE'		=> 'З попереднім схваленням',
	'ROLE_FORUM_POLLS'			=> 'Стандартний доступ з опитуваннями',
	'ROLE_FORUM_READONLY'		=> 'Доступ лише для читання',
	'ROLE_FORUM_STANDARD'		=> 'Стандартний доступ',
	'ROLE_FORUM_NEW_MEMBER'		=> 'Доступ знову зареєстрованих користувачів',
	'ROLE_MOD_FULL'				=> 'Супермодератор',
	'ROLE_MOD_QUEUE'			=> 'Премодератор',
	'ROLE_MOD_SIMPLE'			=> 'Простий модератор',
	'ROLE_MOD_STANDARD'			=> 'Стандартний модератор',
	'ROLE_USER_FULL'			=> 'Всі можливості',
	'ROLE_USER_LIMITED'			=> 'Обмежені можливості',
	'ROLE_USER_NOAVATAR'		=> 'Без аватари',
	'ROLE_USER_NOPM'			=> 'Без приватних повідомлень',
	'ROLE_USER_STANDARD'		=> 'Стандартні можливості',
	'ROLE_USER_NEW_MEMBER'		=> 'Можливості знову зареєстрованих користувачів',

	'ROLE_DESCRIPTION_ADMIN_FORUM'			=> 'Має доступ до управління форумом і до налаштувань прав доступу до форуму.',
	'ROLE_DESCRIPTION_ADMIN_FULL'			=> 'Має доступ до всіх адміністраторських можливостях конференції.<br />Не рекомендовано.',
	'ROLE_DESCRIPTION_ADMIN_STANDARD'		=> 'Має доступ до більшості адміністраторських можливостей, але не може використовувати системні і серверні налаштування.',
	'ROLE_DESCRIPTION_ADMIN_USERGROUP'		=> 'Може управляти користувачами і групами: змінювати права доступу, налаштування, керувати блокуванням і званнями.',
	'ROLE_DESCRIPTION_FORUM_BOT'			=> 'Ця роль рекомендована для ботів і пошукових машин.',
	'ROLE_DESCRIPTION_FORUM_FULL'			=> 'Доступ до використання всіх можливостей на форумі, включаючи створення оголошень і прикріплених тем. Також доступна можливість ігнорування флуд-інтервалу.<br />Не рекомендується для звичайних користувачів.',
	'ROLE_DESCRIPTION_FORUM_LIMITED'		=> 'Доступ до звичайних можливостям на форумі, за винятком прикріплення вкладень або використання значків повідомлень.',
	'ROLE_DESCRIPTION_FORUM_LIMITED_POLLS'	=> 'Аналогічно обмеженому доступу, але з можливістю створення опитувань.',
	'ROLE_DESCRIPTION_FORUM_NOACCESS'		=> 'Повна відсутність доступу, в тому числі можливості бачити форум.',
	'ROLE_DESCRIPTION_FORUM_ONQUEUE'		=> 'Доступ до більшості можливостей на форумі, включаючи прикріплення вкладень, але розміщуються повідомлення і теми вимагають попереднього схвалення модератором.',
	'ROLE_DESCRIPTION_FORUM_POLLS'			=> 'Аналогічно стандартному доступу, але з можливістю створення опитувань.',
	'ROLE_DESCRIPTION_FORUM_READONLY'		=> 'Є доступ до читання форуму, але без можливості створювати нові теми або відповідати на повідомлення.',
	'ROLE_DESCRIPTION_FORUM_STANDARD'		=> 'Доступ до більшості можливостей на форумі, включаючи прикріплення вкладень і видалення своїх тем, але без права закриття своїх тем і створення опитувань.',
	'ROLE_DESCRIPTION_FORUM_NEW_MEMBER'		=> 'Роль для членів спеціальної групи «Нові користувачі», що обмежує можливості знову зареєстрованих користувачів.',
	'ROLE_DESCRIPTION_MOD_FULL'				=> 'Може використовувати всі модераторські можливості, включаючи блокування користувачів.',
	'ROLE_DESCRIPTION_MOD_QUEUE'			=> 'Може здійснювати тільки попереднє схвалення і правку повідомлень.',
	'ROLE_DESCRIPTION_MOD_SIMPLE'			=> 'Може виконувати тільки основні дії в темах. Не може виносити попередження або використовувати відкладену модерацію.',
	'ROLE_DESCRIPTION_MOD_STANDARD'			=> 'Може використовувати більшість модераторських можливостей, але не має доступу до блокування користувачів або зміні учасника повідомлень.',
	'ROLE_DESCRIPTION_USER_FULL'			=> 'Може використовувати всі доступні на форумі можливості для користувача, включаючи зміну імені або ігнорування флуд-інтервалу.<br />Не рекомендовано.',
	'ROLE_DESCRIPTION_USER_LIMITED'			=> 'Має доступ до звичайних можливостям користувача. Прикріплення вкладень, а також відправка електронних і миттєвих повідомлень недоступні.',
	'ROLE_DESCRIPTION_USER_NOAVATAR'		=> 'Має набір обмежених можливостей, і, крім цього, не може використовувати аватару.',
	'ROLE_DESCRIPTION_USER_NOPM'			=> 'Має набір обмежених можливостей, і, крім цього, не має доступу до особистих повідомленнями.',
	'ROLE_DESCRIPTION_USER_STANDARD'		=> 'Має доступ до більшості, але не до всіх можливостей користувача. Наприклад, не може змінювати своє ім\'я або ігнорувати флуд-інтервал.',
	'ROLE_DESCRIPTION_USER_NEW_MEMBER'		=> 'Роль для членів спеціальної групи «Нові користувачі», що обмежує можливості знову зареєстрованих користувачів.',

	'ROLE_DESCRIPTION_EXPLAIN'		=> 'Ви можете ввести короткий опис ролі. Введений текст буде відображений у вигляді опису в переліку ролей.',
	'ROLE_DESCRIPTION_LONG'			=> 'Опис ролі занадто довге. Обмежте опис до 4000 символів.',
	'ROLE_DETAILS'					=> 'Відомості про роль',
	'ROLE_EDIT_SUCCESS'				=> 'Роль успішно змінена.',
	'ROLE_NAME'						=> 'Назва ролі',
	'ROLE_NAME_ALREADY_EXIST'		=> 'Назва ролі <strong>%s</strong> вже існує для даного набору прав доступу.',
	'ROLE_NOT_ASSIGNED'				=> 'Роль не призначена.',

	'SELECTED_FORUM_NOT_EXIST'		=> 'Вибраних форумів не існує.',
	'SELECTED_GROUP_NOT_EXIST'		=> 'Вибраних груп не існує.',
	'SELECTED_USER_NOT_EXIST'		=> 'Вибраних користувачів не існує.',
	'SELECT_FORUM_SUBFORUM_EXPLAIN'	=> 'Обраний тут форум буде включати всі підфоруми.',
	'SELECT_ROLE'					=> 'Вибір ролі…',
	'SELECT_TYPE'					=> 'Виберіть тип',
	'SET_PERMISSIONS'				=> 'Встановити права',
	'SET_ROLE_PERMISSIONS'			=> 'Встановити права для ролі',
	'SET_USERS_PERMISSIONS'			=> 'Встановити користувальницькі права',
	'SET_USERS_FORUM_PERMISSIONS'	=> 'Встановити локальні права',

	'TRACE_DEFAULT'					=> 'За замовчуванням значення кожного права доступу <samp>НІ</samp> (скинуто). Таким чином, права доступу можуть бути перевизначені іншими параметрами налаштувань.',
	'TRACE_FOR'						=> 'Результат для',
	'TRACE_GLOBAL_SETTING'			=> '%s (глобально)',
	'TRACE_GROUP_NEVER_TOTAL_NEVER'	=> 'ЗЗначення права для цієї групи <samp>НІКОЛИ</samp> відповідає результуючому, тому збережено раніше задане значення.',
	'TRACE_GROUP_NEVER_TOTAL_NEVER_LOCAL'	=> 'Значення права групи для цього форуму <samp>НІКОЛИ</samp> відповідає результуючому, тому збережено раніше задане значення.',
	'TRACE_GROUP_NEVER_TOTAL_NO'	=> 'Значення права для цієї групи <samp>НІКОЛИ</samp> стає новим результуючим, оскільки раніше не було задано (було задано <samp>НІ</samp>).',
	'TRACE_GROUP_NEVER_TOTAL_NO_LOCAL'	=> 'Значення права групи для цього форуму <samp>НІКОЛИ</samp> стає новим результуючим, оскільки раніше не було задано (було задано <samp>НІ</samp>).',
	'TRACE_GROUP_NEVER_TOTAL_YES'	=> 'Значення права для цієї групи <samp>НІКОЛИ</ > замінює результуюче <samp>ТАК </samp> на <samp>НІКОЛИ</samp> для даного користувача.',
	'TRACE_GROUP_NEVER_TOTAL_YES_LOCAL'	=> 'Значення права групи для цього форуму <samp>НІКОЛИ</samp> замінює результуюче <samp>ТАК</samp> на <samp>НІКОЛИ</samp> для цього користувача.',
	'TRACE_GROUP_NO'				=> 'Значення права для цієї групи <samp>НІ</samp>, тому збережено раніше заданий результуюче право.',
	'TRACE_GROUP_NO_LOCAL'			=> 'Значення права для цієї групи в цьому форумі <samp>НІ</samp>, тому збережено раніше задане значення.',
	'TRACE_GROUP_YES_TOTAL_NEVER'	=> 'Значення права для цієї групи <samp>ТАК</samp>, але результуюче право <samp>НІКОЛИ</samp> не може бути замінено.',
	'TRACE_GROUP_YES_TOTAL_NEVER_LOCAL'	=> 'Значення права групи для цього форуму <samp>ТАК</samp>, але результуюче право <samp>НІКОЛИ</samp> не може бути замінено.',
	'TRACE_GROUP_YES_TOTAL_NO'		=> 'Значення права для цієї групи <samp>ТАК</samp> стає новим результуючим, оскільки раніше не було задано (було задано <samp>НІ</samp>).',
	'TRACE_GROUP_YES_TOTAL_NO_LOCAL'	=> 'Значення права групи для цього форуму <samp>ТАК</samp> стає новим результуючим, оскільки раніше не було задано (було задано <samp>НІ</samp>).',
	'TRACE_GROUP_YES_TOTAL_YES'		=> 'Значення права для цієї групи <samp>ТАК</samp>, результуючим правом також є <samp>ТАК</samp>, тому збережено раніше задане значення. ',
	'TRACE_GROUP_YES_TOTAL_YES_LOCAL'	=> 'Значення права групи для цього форуму <samp>ТАК</samp>, результуючим правом також є <samp>ТАК</samp>, тому збережено раніше задане значення.',
	'TRACE_PERMISSION'				=> 'Відстежити право доступу — %s',
	'TRACE_RESULT'					=> 'Відстежити результат',
	'TRACE_SETTING'					=> 'Відстежити налаштування',

	'TRACE_USER_GLOBAL_YES_TOTAL_YES'		=> 'Незалежно від форуму значення права цього користувача <samp>ТАК</samp>, результуюче право також одно <samp>ТАК</samp>, таким чином, збережено результуюче значення. %sВідстежити глобальне право%s',
	'TRACE_USER_GLOBAL_YES_TOTAL_NEVER'		=> 'Незалежно від форуму значення права для цього користувача <samp>ТАК</samp>, яке замінює поточне локальне значення <samp>НІКОЛИ</samp>. %sВідстежити глобальне право%s',
	'TRACE_USER_GLOBAL_NEVER_TOTAL_KEPT'	=> 'Незалежно від форуму значення права цього користувача <samp>НІКОЛИ</samp>, яке не впливає на локальне значення.%sВідстежити глобальне право%s',

	'TRACE_USER_FOUNDER'					=> 'Користувач є засновником конференції, тому значення адміністраторських прав завжди встановлені в значення <samp>ТАК</samp>.',
	'TRACE_USER_KEPT'						=> 'Значення права для цього користувача <samp>НІ</samp>, таким чином, збережено раніше заданий результуюче значення.',
	'TRACE_USER_KEPT_LOCAL'					=> 'Значення права для цього користувача на даному форумі <samp>НІ</samp>, таким чином, збережено раніше заданий результуюче значення.',
	'TRACE_USER_NEVER_TOTAL_NEVER'			=> 'Значення права для цього користувача <samp>НІКОЛИ</samp>, результуючим правом також є <samp>НІКОЛИ</samp>, тому зміни не виробляються.',
	'TRACE_USER_NEVER_TOTAL_NEVER_LOCAL'	=> 'Значення права для цього користувача на даному форумі <samp>НІКОЛИ</samp>, результуючим правом також є <samp>НІКОЛИ</samp>, тому зміни не виробляються.',
	'TRACE_USER_NEVER_TOTAL_NO'				=> 'Значення права для цього користувача <samp>НІКОЛИ</samp> стає новим результуючим правом, оскільки раніше було задано <samp>НІ</samp>.',
	'TRACE_USER_NEVER_TOTAL_NO_LOCAL'		=> 'Значення права для цього користувача на даному форумі <samp>НІКОЛИ</samp> стає новим результуючим правом, оскільки раніше було задано <samp>НІ</samp>.',
	'TRACE_USER_NEVER_TOTAL_YES'			=> 'Значення права для цього користувача <samp>НІКОЛИ</samp> замінює раніше задане значення <samp>ТАК</samp>.',
	'TRACE_USER_NEVER_TOTAL_YES_LOCAL'		=> 'Значення права для цього користувача на даному форумі <samp>НІКОЛИ</samp> замінює раніше задане значення <samp>ТАК</samp>.',
	'TRACE_USER_NO_TOTAL_NO'				=> 'Значення права для цього користувача <samp>НІ</samp>, результуючим правом також є <samp>НІ</samp>, тому встановлено значення за умовчанням <samp>НІКОЛИ</samp>.',
	'TRACE_USER_NO_TOTAL_NO_LOCAL'			=> 'Значення права для цього користувача в даному форумі <samp>НІ</samp>, результуючим правом також є <samp>НІ</samp>, тому встановлено значення за умовчанням <samp>НІКОЛИ</samp>.',
	'TRACE_USER_YES_TOTAL_NEVER'			=> 'Значення права для цього користувача <samp>ТАК</samp>, але результатне право <samp>НІКОЛИ</samp> не може бути замінено.',
	'TRACE_USER_YES_TOTAL_NEVER_LOCAL'		=> 'Значення права для цього користувача в даному форумі <samp>ТАК</samp>, але результатне право <samp>НІКОЛИ</samp> не може бути замінене.',
	'TRACE_USER_YES_TOTAL_NO'				=> 'Значення права для цього користувача <samp>ТАК</samp> стає новим результуючим правом, оскільки раніше було задано <samp>НІ</samp>.',
	'TRACE_USER_YES_TOTAL_NO_LOCAL'			=> 'Значення права для цього користувача в даному форумі <samp>ТАК</samp> стає новим результуючим правом, оскільки раніше було задано <samp>НІ</samp>.',
	'TRACE_USER_YES_TOTAL_YES'				=> 'Значення права для цього користувача <samp>ТАК</samp>, результуючим правом також є <samp>ТАК</samp>, тому зміни не виробляються.',
	'TRACE_USER_YES_TOTAL_YES_LOCAL'		=> 'Значення права для цього користувача в даному форумі <samp>ТАК</samp>, результуючим правом також є <samp>ТАК</samp>, тому зміни не виробляються. ',
	'TRACE_WHO'								=> 'В якості',
	'TRACE_TOTAL'							=> 'Підсумок',

	'USERS_NOT_ASSIGNED'			=> 'Немає користувачів з цією роллю',
	'USER_IS_MEMBER_OF_DEFAULT'		=> 'полягає в наступних попередньо встановлених групах',
	'USER_IS_MEMBER_OF_CUSTOM'		=> 'полягає в наступних створених групах',

	'VIEW_ASSIGNED_ITEMS'	=> 'Перегляд призначених елементів',
	'VIEW_LOCAL_PERMS'		=> 'Переглянути локальні права',
	'VIEW_GLOBAL_PERMS'		=> 'Переглянути глобальні права',
	'VIEW_PERMISSIONS'		=> 'Переглянути права',

	'WRONG_PERMISSION_TYPE'				=> 'Вибрано неправильний тип прав.',
	'WRONG_PERMISSION_SETTING_FORMAT'	=> 'Права встановлені в невірному форматі, їх обробка неможлива.',
));
