<?php
/**
*
* This file is part of the phpBB Forum Software package.
*
* @copyright (c) phpBB Limited <https://www.phpbb.com>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* For full copyright and license information, please see
* the docs/CREDITS.txt file.
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// Custom profile fields
$lang = array_merge($lang, array(
	'ADDED_PROFILE_FIELD'	=> 'Додаткове поле успішно добавлено в профіль.',
	'ALPHA_ONLY'			=> 'Тільки буквено-цифрові',
	'ALPHA_SPACERS'			=> 'Тільки буквено-цифрові і роздільники',
	'ALPHA_UNDERSCORE'		=> 'Тільки буквено-цифрові і підкреслення',
	'ALWAYS_TODAY'			=> 'Завжди поточна дата',

	'BOOL_ENTRIES_EXPLAIN'	=> 'Введіть можливі варіанти',
	'BOOL_TYPE_EXPLAIN'		=> 'Вид варіантів вибору: прапорці та перемикачі. Прапорці будуть відображені тільки у випадку, якщо вони помічені для даного користувача. У цьому випадку буде використана <strong>друга</strong> мовна опція. Перемикачі будуть відображені незалежно від їх стану.',

	'CHANGED_PROFILE_FIELD'		=> 'Поле профілю успішно змінено.',
	'CHARS_ANY'					=> 'Любі',
	'CHECKBOX'					=> 'Прапорці',
	'COLUMNS'					=> 'стовпців',
	'CP_LANG_DEFAULT_VALUE'		=> 'Значення за замовчуванням',
	'CP_LANG_EXPLAIN'			=> 'Опис поля',
	'CP_LANG_EXPLAIN_EXPLAIN'	=> 'Підказка до поля, яке показується користувачеві',
	'CP_LANG_NAME'				=> 'Ім\'я поля/заголовок, що показується користувачеві',
	'CP_LANG_OPTIONS'			=> 'Варіанти',
	'CREATE_NEW_FIELD'			=> 'Додати нове поле',
	'CUSTOM_FIELDS_NOT_TRANSLATED'	=> 'Принаймні одне додаткове поле профілю на даний момент не переведено. Введіть необхідні дані, перейшовши за посиланням «Перекласти».',

	'DEFAULT_ISO_LANGUAGE'			=> 'Мова за замовчуванням [%s]',
	'DEFAULT_LANGUAGE_NOT_FILLED'	=> 'Для поля профілю не заповнені змінні мови за замовчуванням.',
	'DEFAULT_VALUE'					=> 'Значення за замовчуванням',
	'DELETE_PROFILE_FIELD'			=> 'Видалення поля профілю',
	'DELETE_PROFILE_FIELD_CONFIRM'	=> 'Ви дійсно хочете видалити це поле?',
	'DISPLAY_AT_PROFILE'			=> 'В особистому розіділі',
	'DISPLAY_AT_PROFILE_EXPLAIN'	=> 'Користувач може змінити значення поля в особистому розділі.',
	'DISPLAY_AT_REGISTER'			=> 'У формі реєстрації',
	'DISPLAY_AT_REGISTER_EXPLAIN'	=> 'Якщо включено, поле можна заповнити при реєстрації.',
	'DISPLAY_ON_MEMBERLIST'			=> 'Відображати в списку користувачів',
	'DISPLAY_ON_MEMBERLIST_EXPLAIN'	=> 'Якщо включено, поле буде відображено на сторінці списку користувачів.',
	'DISPLAY_ON_PM'					=> 'Відображати при перегляді приватних повідомлень',
	'DISPLAY_ON_PM_EXPLAIN'			=> 'Якщо включено, дане поле буде відображено в мініпрофілі при перегляді приватних повідомлень.',
	'DISPLAY_ON_VT'					=> 'На сторінках тем',
	'DISPLAY_ON_VT_EXPLAIN'			=> 'При включенні даної опції поле буде відображатися на сторінках тим під аватарами користувачів.',
	'DISPLAY_PROFILE_FIELD'			=> 'Відображати поле для всіх',
	'DISPLAY_PROFILE_FIELD_EXPLAIN'	=> 'Поле профілю буде показано там, де це дозволено в налаштуваннях навантаження на сервер. Якщо встановлено значення «Ні», дане поле буде приховано при перегляді тем, профілів, списку користувачів.',
	'DROPDOWN_ENTRIES_EXPLAIN'		=> 'Введіть варіанти відповіді, по одній відповіді на рядок',

	'EDIT_DROPDOWN_LANG_EXPLAIN'	=> 'Врахуйте, що ви можете змінювати текст варіантів вибору і додавати нові варіанти в кінець списку. Не рекомендовано додавати нові варіанти між існуючими, це може призвести до того, що в профілях користувачів виявляться інші варіанти вибору. Це також може статися, якщо ви видалите варіанти з середини списку. Видалення варіанта з кінця списку призведе до того, у користувачів, що вибрали в профілі цей варіант, він зміниться на варіант за замовчуванням.',
	'EMPTY_FIELD_IDENT'				=> 'Ви не ввели ідентифікатор поля',
	'EMPTY_USER_FIELD_NAME'			=> 'Введіть ім\'я поля/заголовок',
	'ENTRIES'						=> 'Значення',
	'EVERYTHING_OK'					=> 'Все в порядку',

	'FIELD_BOOL'				=> 'Логічне поле (Так або Ні)',
	'FIELD_CONTACT_DESC'		=> 'Опис контакту',
	'FIELD_CONTACT_URL'			=> 'Посилання на контакт',
	'FIELD_DATE'				=> 'Дата',
	'FIELD_DESCRIPTION'			=> 'Опис поля',
	'FIELD_DESCRIPTION_EXPLAIN'	=> 'Підказка до поля, яке показується користувачеві',
	'FIELD_DROPDOWN'			=> 'Розкривний список',
	'FIELD_IDENT'				=> 'Ідентифікатор поля',
	'FIELD_IDENT_ALREADY_EXIST'	=> 'Поле з таким ідентифікатором вже існує. Введіть інший ідентифікатор.',
	'FIELD_IDENT_EXPLAIN'		=> 'Назва поля для його позначення в базі даних і файлах шаблонів.',
	'FIELD_INT'					=> 'Число',
	'FIELD_IS_CONTACT'			=> 'Відображати поле як контактну інформацію',
	'FIELD_IS_CONTACT_EXPLAIN'	=> 'Поле контакту відображається в розділі контактів профілю користувача, а також у міні профілі.',
	'FIELD_LENGTH'				=> 'Розмір поля введення',
	'FIELD_NOT_FOUND'			=> 'Поле не знайдено.',
	'FIELD_STRING'				=> 'Однорядкове текстове поле',
	'FIELD_TEXT'				=> 'Багаторядкове текстове поле',
	'FIELD_TYPE'				=> 'Тип поля',
	'FIELD_TYPE_EXPLAIN'		=> 'Ви не зможете змінювати тип поля.',
	'FIELD_URL'					=> 'URL (посилання)',
	'FIELD_VALIDATION'			=> 'Допустимі символи',
	'FIRST_OPTION'				=> 'Перший варіант',

	'HIDE_PROFILE_FIELD'			=> 'Приховане поле',
	'HIDE_PROFILE_FIELD_EXPLAIN'	=> 'Поле приховано від усіх, крім самого користувача, адміністраторів і модераторів. Якщо в Особистому розділі опція відображення поля вимкнено, користувач не зможе бачити або змінювати його, це зможуть зробити лише адміністратори.',

	'INVALID_CHARS_FIELD_IDENT'	=> 'Ідентифікатор поля може містити тільки латинські малі літери і _ (символ нижнього підкреслення)',
	'INVALID_FIELD_IDENT_LEN'	=> 'Ідентифікатор поля може бути довжиною не більше 17 символів',
	'ISO_LANGUAGE'				=> 'Мова [%s]',

	'LANG_SPECIFIC_OPTIONS'		=> 'Налаштування для мови [<strong>%s</strong>]',

	'MAX_FIELD_CHARS'		=> 'Максимальне число символів',
	'MAX_FIELD_NUMBER'		=> 'Максимально допустима кількість',
	'MIN_FIELD_CHARS'		=> 'Мінімальне число символів',
	'MIN_FIELD_NUMBER'		=> 'Мінімально припустиме число',

	'NO_FIELD_ENTRIES'			=> 'Не задані можливі варіанти вибору',
	'NO_FIELD_ID'				=> 'Не вказаний ідентифікатор поля.',
	'NO_FIELD_TYPE'				=> 'Не вказаний тип поля.',
	'NO_VALUE_OPTION'			=> 'Незначущий варіант',
	'NO_VALUE_OPTION_EXPLAIN'	=> 'Якщо поле обов\'язково до заповнення та обрано цей варіант, користувачеві виводиться повідомлення про помилку',
	'NUMBERS_ONLY'				=> 'Тільки цифри (0-9)',

	'PROFILE_BASIC_OPTIONS'		=> 'Основні налаштування',
	'PROFILE_FIELD_ACTIVATED'	=> 'Поле профілю успішно включено.',
	'PROFILE_FIELD_DEACTIVATED'	=> 'Поле профілю успішно відключено.',
	'PROFILE_LANG_OPTIONS'		=> 'Мовні параметри',
	'PROFILE_TYPE_OPTIONS'		=> 'Налаштування виду поля',

	'RADIO_BUTTONS'				=> 'Перемикачі',
	'REMOVED_PROFILE_FIELD'		=> 'Поле профілю успішно видалено.',
	'REQUIRED_FIELD'			=> 'Обов\'язкове поле',
	'REQUIRED_FIELD_EXPLAIN'	=> 'Користувачеві необхідно заповнити або виставити значення поля. Поле доступно при реєстрації і в особистому розділі.',
	'ROWS'						=> 'рядків',

	'SAVE'							=> 'Зберегти',
	'SECOND_OPTION'					=> 'Другий варіант',
	'SHOW_NOVALUE_FIELD'			=> 'Відображати поле, якщо обрано незначущий варіант',
	'SHOW_NOVALUE_FIELD_EXPLAIN'	=> 'Встановлює, чи буде відображено поле профілю в разі, якщо обрано незначущий варіант для необов\'язкового поля, або не було вибрано значення для обов\'язкового поля.',
	'STEP_1_EXPLAIN_CREATE'			=> 'Тут ви можете ввести основні параметри нового поля профілю. Ця інформація потрібна для другого кроку, на якому ви зможете встановити залишилися налаштування, зробити попередній перегляд майбутнього поля і внести необхідні виправлення, якщо необхідно.',
	'STEP_1_EXPLAIN_EDIT'			=> 'Тут ви можете змінити основні параметри нового поля профілю. На другому кроці відповідні значення будуть перераховані і ви зможете переглянути і протестувати змінені налаштування.',
	'STEP_1_TITLE_CREATE'			=> 'Додавання поля в профіль',
	'STEP_1_TITLE_EDIT'				=> 'Редагування поля профілю',
	'STEP_2_EXPLAIN_CREATE'			=> 'Тут ви можете задати загальні налаштування майбутнього поля. Потім можна буде подивитися, як виглядатиме для користувача створене поле. Пограйте з настройками, поки не будете задоволені тим, як працює полі.',
	'STEP_2_EXPLAIN_EDIT'			=> 'Тут ви можете змінити загальні налаштування майбутнього поля. <br /><strong>Врахуйте, що ці зміни не вплинуть на вже існуючі поля профілю, заповнені користувачами.</strong>',
	'STEP_2_TITLE_CREATE'			=> 'Налаштування вигляду поля',
	'STEP_2_TITLE_EDIT'				=> 'Налаштування вигляду поля',
	'STEP_3_EXPLAIN_CREATE'			=> 'Так як на конференції встановлено більше однієї мови, необхідно ввести дані для решти мов. Назва поля, підказка і початкове значення будуть відображатися на мові за замовчуванням. Мовні змінні інших мов можна буде ввести пізніше.',
	'STEP_3_EXPLAIN_EDIT'			=> 'Так як на конференції встановлено більше однієї мови, ви можете змінити або додати дані для решти мов. Назва поля, підказка і початкове значення будуть відображатися на мові за замовчуванням.',
	'STEP_3_TITLE_CREATE'			=> 'Мовні змінні інших мов',
	'STEP_3_TITLE_EDIT'				=> 'Мовні визначення',
	'STRING_DEFAULT_VALUE_EXPLAIN'	=> 'Введіть рядок, за замовчуванням відображається в полі. Не вводьте рядок, якщо хочете залишити поле порожнім.',

	'TEXT_DEFAULT_VALUE_EXPLAIN'	=> 'Введіть текст, за замовчуванням відображається в полі. Не вводьте текст, якщо хочете залишити поле порожнім.',
	'TRANSLATE'						=> 'Перекласти',

	'USER_FIELD_NAME'	=> 'Ім\'я поля/заголовок, що показується користувачеві',

	'VISIBILITY_OPTION'				=> 'Видимість поля',
));
