<?php
/**
*
* acp_search [Ukrainian]
*
* @package language
* @copyright (c) 2005 phpBB Group
* @license http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ACP_SEARCH_INDEX_EXPLAIN'				=> 'Тут ви можете керувати індексами пошукового механізму. Оскільки зазвичай використовується тільки один механізм, необхідно видаляти всі невживані індекси. Після зміни будь-яких налаштувань пошуку (наприклад, мінімального/максимального кількості символів) має сенс повторно створити пошукові індекси для того, щоб вони відображали зроблені зміни.',
	'ACP_SEARCH_SETTINGS_EXPLAIN'			=> 'Тут ви можете вказати пошуковий механізм, який буде використовуватися для індексації повідомлень і здійснення пошуку. Також ви можете встановлювати різні налаштування, які можуть впливати на кількість ресурсів, необхідних для обробки пошукових запитів. Деякі з цих налаштувань однакові для всіх пошукових механізмів.',

	'COMMON_WORD_THRESHOLD'					=> 'Поріг загальних слів',
	'COMMON_WORD_THRESHOLD_EXPLAIN'			=> 'Слова, що містяться в основній масі всіх повідомлень, будуть вважатися загальними. Загальні слова ігноруються в пошукових запитах. Введіть 0 для відключення цієї функції. Функція працює тільки за наявності більше 100 повідомлень. Для оновлення списку загальних слів необхідно перестворити пошукові індекси.',
	'CONFIRM_SEARCH_BACKEND'				=> 'Ви дійсно хочете переключитися на інший пошуковий механізм? Після перемикання потрібно буде створити пошукові індекси для використання нового пошукового механізму. Якщо ви не плануєте перемикатися назад на старий пошуковий механізм, то можете видалити пошукові індекси від нього для звільнення системних ресурсів.',
	'CONTINUE_DELETING_INDEX'				=> 'Продовжити попередній процес видалення індексів',
	'CONTINUE_DELETING_INDEX_EXPLAIN'		=> 'Раніше був запущений процес видалення пошукових індексів. Необхідно дочекатися завершення цього процесу для отримання доступу до сторінки пошукових індексів або скасувати його.',
	'CONTINUE_INDEXING'						=> 'Продовжити попередній процес індексування',
	'CONTINUE_INDEXING_EXPLAIN'				=> 'Раніше був запущений процес індексації. Необхідно дочекатися завершення цього процесу для отримання доступу до сторінки пошукових індексів або скасувати його.',
	'CREATE_INDEX'							=> 'Створити індекси',

	'DELETE_INDEX'							=> 'Видалити індекси',
	'DELETING_INDEX_IN_PROGRESS'			=> 'Видалення пошукових індексів…',
	'DELETING_INDEX_IN_PROGRESS_EXPLAIN'	=> 'Йде видалення пошукових індексів. Цей процес може зайняти кілька хвилин.',

	'FULLTEXT_MYSQL_INCOMPATIBLE_DATABASE'	=> 'Механізм повнотекстового пошуку MySQL може використовуватися тільки на MySQL4 і вище.',
	'FULLTEXT_MYSQL_NOT_SUPPORTED'			=> 'Повнотекстові індекси MySQL можуть використовуватися тільки з таблицями MyISAM або InnoDB. Для використання повнотекстових індексів з таблицями InnoDB потрібно MySQL 5.6.4 або пізнішої версії.',
	'FULLTEXT_MYSQL_TOTAL_POSTS'			=> 'Загальна кількість індексованих повідомлень',
	'FULLTEXT_MYSQL_MIN_SEARCH_CHARS_EXPLAIN'	=> 'Слова, що складаються з як мінімум даної кількості символів будуть проіндексовані для пошуку. Змінити дане значення можна тільки шляхом зміни налаштувань сервера MySQL.',
	'FULLTEXT_MYSQL_MAX_SEARCH_CHARS_EXPLAIN'   => 'Слова, які складаються не більш, ніж з даної кількості символів, будуть проіндексовані для пошуку. Змінити дане значення можна тільки шляхом зміни налаштувань сервера MySQL.',

	'FULLTEXT_POSTGRES_INCOMPATIBLE_DATABASE'	=> 'Механізм повнотекстового пошуку PostgreSQL може бути використаний тільки на СУБД PostgreSQL.',
	'FULLTEXT_POSTGRES_TS_NOT_USABLE'	=> 'Механізм повнотекстового пошуку PostgreSQL може бути використаний тільки з версією PostgreSQL 8.3 і вище.',
	'FULLTEXT_POSTGRES_TOTAL_POSTS'			=> 'Загальна кількість індексованих повідомлень',
	'FULLTEXT_POSTGRES_VERSION_CHECK'		=> 'Версія PostgreSQL',
	'FULLTEXT_POSTGRES_TS_NAME'				=> 'Профіль конфігурації повнотекстового пошуку:',
	'FULLTEXT_POSTGRES_MIN_WORD_LEN'			=> 'Мінімальна довжина пошукового запиту',
	'FULLTEXT_POSTGRES_MAX_WORD_LEN'			=> 'Максимальна довжина пошукового запиту',
	'FULLTEXT_POSTGRES_VERSION_CHECK_EXPLAIN'		=> 'Для даного пошукового механізму потрібно PostgreSQL версії 8.3 і вище.',
	'FULLTEXT_POSTGRES_TS_NAME_EXPLAIN'				=> 'Профіль конфігурації повнотекстового пошуку, використовуваний для визначення обробника і словника.',
	'FULLTEXT_POSTGRES_MIN_WORD_LEN_EXPLAIN'			=> 'Слова, які складаються не менше, ніж із зазначеної кількості символів, будуть включені в запит до бази даних.',
	'FULLTEXT_POSTGRES_MAX_WORD_LEN_EXPLAIN'			=> 'Слова, які складаються не більш, ніж із зазначеної кількості символів, будуть включені в запит до бази даних.',

	'FULLTEXT_SPHINX_CONFIGURE'				=> 'Задайте наступні налаштування для створення файлу конфігурації sphinx',
	'FULLTEXT_SPHINX_DATA_PATH'				=> 'Шлях до папки з даними',
	'FULLTEXT_SPHINX_DATA_PATH_EXPLAIN'		=> 'Зазначений шлях буде використаний для зберігання індексів і файлів журналів. Необхідно створити дану папку за межами простору, доступного з веб-простору (шлях повинен закінчуватися прямим слешем)',
	'FULLTEXT_SPHINX_DELTA_POSTS'			=> 'Кількість повідомлень у часто обновлюваному дельта-індексі',
	'FULLTEXT_SPHINX_HOST'					=> 'Сервер Sphinx',
	'FULLTEXT_SPHINX_HOST_EXPLAIN'			=> 'Сервер, на якому запущений процес sphinx (searchd). Залиште значення порожнім для використання локального сервера за замовчуванням',
	'FULLTEXT_SPHINX_INDEXER_MEM_LIMIT'		=> 'Обмеження пам\'яті для процесу індексування',
	'FULLTEXT_SPHINX_INDEXER_MEM_LIMIT_EXPLAIN'	=> 'Дане значення має бути завжди менше, ніж доступне серверу кількість оперативної пам\'яті. Якщо виникають проблеми з продуктивністю, це може бути пов\'язано з надмірним споживанням ресурсів процесом індексування. Зменшення обсягу доступної для нього пам\'яті може знизити навантаження на сервер.',
	'FULLTEXT_SPHINX_MAIN_POSTS'			=> 'Кількість повідомлень в основному індексі',
	'FULLTEXT_SPHINX_PORT'					=> 'Порт Sphinx',
	'FULLTEXT_SPHINX_PORT_EXPLAIN'			=> 'Порт, за яким доступний процес sphinx (searchd). Залиште значення порожнім для використання порту за замовчуванням 9312',
	'FULLTEXT_SPHINX_WRONG_DATABASE'		=> 'Пошуковий механізм sphinx для phpBB підтримує тільки СУБД MySQL і PostgreSQL.',
	'FULLTEXT_SPHINX_CONFIG_FILE'			=> 'Файл конфігурації Sphinx',
	'FULLTEXT_SPHINX_CONFIG_FILE_EXPLAIN'	=> 'Вміст для створення файлу конфігурації sphinx. Зазначені дані повинні бути збережені у файлі sphinx.conf, використовуваний пошуковим процесом sphinx.',
	'FULLTEXT_SPHINX_NO_CONFIG_DATA'		=> 'Шляхи до папок для зберігання даних і конфігурації sphinx не задані. Задайте їх для того, щоб створити файл конфігурації.',

	'GENERAL_SEARCH_SETTINGS'				=> 'Загальні налаштування пошуку',
	'GO_TO_SEARCH_INDEX'					=> 'Перейти на сторінку пошукових індексів',

	'INDEX_STATS'							=> 'Статистика індексації',
	'INDEXING_IN_PROGRESS'					=> 'Йде індексація…',
	'INDEXING_IN_PROGRESS_EXPLAIN'			=> 'Йде індексація всіх наявних повідомлень. Цей процес може зайняти від декількох хвилин до декількох годин залежно від обсягу даних.',

	'LIMIT_SEARCH_LOAD'						=> 'Обмеження пошуку при завантаженні системи',
	'LIMIT_SEARCH_LOAD_EXPLAIN'				=> 'Якщо завантаження системи протягом однієї хвилини перевищує це значення, то пошукова сторінка буде недоступна. Значення 1.0 еквівалентно стовідсотковій використанню одного процесора. Ця опція функціонує тільки на UNIX-подібних серверах.',

	'MAX_SEARCH_CHARS'						=> 'Максимум символів для індексації',
	'MAX_SEARCH_CHARS_EXPLAIN'				=> 'Слова з меншим числом символів будуть проіндексовані і доступні для пошуку.',
	'MAX_NUM_SEARCH_KEYWORDS'				=> 'Максимальне число пошукових слів',
	'MAX_NUM_SEARCH_KEYWORDS_EXPLAIN'		=> 'Максимальна кількість слів, які користувач може шукати одночасно. Встановіть 0 для зняття обмежень.',
	'MIN_SEARCH_CHARS'						=> 'Мінімум символів для індексації',
	'MIN_SEARCH_CHARS_EXPLAIN'				=> 'Слова з великим числом символів будуть проіндексовані і доступні для пошуку.',
	'MIN_SEARCH_AUTHOR_CHARS'				=> 'Мінімальне число символів в іменах',
	'MIN_SEARCH_AUTHOR_CHARS_EXPLAIN'		=> 'Користувачі повинні будуть запровадити не менше зазначеної кількості символів при здійсненні пошуку автора по масці. Якщо ім\'я автора коротше вказаного значення, то можна здійснювати пошук по повному імені автора.',

	'PROGRESS_BAR'							=> 'Індикатор виконання',

	'SEARCH_GUEST_INTERVAL'					=> 'Інтервал між запитами для гостей',
	'SEARCH_GUEST_INTERVAL_EXPLAIN'			=> 'Час в секундах, яке гість повинен почекати перед виконанням наступного пошукового запиту. Якщо пошуком користується один гість, то всі інші в цей час чекають вказане тут час.',
	'SEARCH_INDEX_CREATE_REDIRECT'			=> array(
		2	=> 'Всі повідомлення до повідомлення під номером %2$d успішно проіндексовані, з яких у поточному кроці індексації проіндексовано %1$d повідомлень.<br />',
	),
	'SEARCH_INDEX_CREATE_REDIRECT_RATE'		=> array(
		2	=> 'Поточна швидкість індексації — приблизно %1$.1f повідомлень в секунду.<br />Йде індексація…',
	),
	'SEARCH_INDEX_DELETE_REDIRECT'			=> array(
		2	=> 'Всі повідомлення до повідомлення під номером %2$d успішно видалені з пошукових індексів.<br />Йде видалення…',
	),
	'SEARCH_INDEX_CREATED'					=> 'Всі повідомлення в базі даних успішно проіндексовані.',
	'SEARCH_INDEX_REMOVED'					=> 'Пошукові індекси успішно видалені.',
	'SEARCH_INTERVAL'						=> 'Інтервал між пошуковими запитами',
	'SEARCH_INTERVAL_EXPLAIN'				=> 'Час в секундах, яку користувач повинен почекати перед виконанням наступного пошукового запиту. Цей інтервал перевіряється для кожного користувача.',
	'SEARCH_STORE_RESULTS'					=> 'Кешування результатів пошуку',
	'SEARCH_STORE_RESULTS_EXPLAIN'			=> 'Тривалість кешування результатів пошуку (у секундах). Введіть 0 для відключення кешування результатів.',
	'SEARCH_TYPE'							=> 'Пошуковий механізм',
	'SEARCH_TYPE_EXPLAIN'					=> 'phpBB дозволяє вибрати механізм для здійснення пошуку в повідомленнях. За замовчуванням використовується вбудований повнотекстовий пошуковий механізм phpBB.',
	'SWITCHED_SEARCH_BACKEND'				=> 'Ви переключилися на інший пошуковий механізм. Переконайтеся, що маються індекси для цього пошукового механізму, і у разі необхідності, створіть їх.',

	'TOTAL_WORDS'							=> 'Загальна кількість індексованих слів',
	'TOTAL_MATCHES'							=> 'Число слів, пов\'язаних з повідомленнями',

	'YES_SEARCH'							=> 'Включити пошукові можливості',
	'YES_SEARCH_EXPLAIN'					=> 'Включення пошукових можливостей, включаючи пошук користувачів.',
	'YES_SEARCH_UPDATE'						=> 'Включити повнотекстове оновлення',
	'YES_SEARCH_UPDATE_EXPLAIN'				=> 'Оновлення повнотекстових індексів при відправленні повідомлень. Опція не працює, якщо пошукові можливості відключені.',
));
