<?php
/**
*
* This file is part of the phpBB Forum Software package.
*
* @copyright (c) phpBB Limited <https://www.phpbb.com>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* For full copyright and license information, please see
* the docs/CREDITS.txt file.
*
*/

/**
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$help = array(
	array(
		0 => '--',
		1 => 'Вхід на конференцію і реєстрація'
	),
	array(
		0 => 'Чому я не можу увійти?',
		1 => 'Існує кілька можливих причин. Насамперед переконайтеся, що ви правильно вводите ім\'я користувача та пароль. Якщо дані введені правильно, зв\'яжіться з адміністратором, щоб перевірити, чи не був вам заборонено доступ до форуму. Також можливо, що адміністратор невірно налаштував конфігурацію конференції, зв\'яжіться з ним для виправлення помилки.'
	),
	array(
		0 => 'Навіщо мені взагалі потрібно реєструватися?',
		1 => 'Ви можете цього і не робити. Все залежить від того, як вирішив адміністратор конференції, чи ви зареєструватися, щоб розміщувати повідомлення, чи ні. Проте реєстрація дає вам додаткові можливості, які недоступні для анонімних користувачів: аватари, приватні повідомлення, відсилання email-повідомлень, участь в групах і т.д. Реєстрація забере у вас всього пару хвилин, тому ми рекомендуємо це зробити.'
	),
	array(
		0 => 'Чому мені постійно доводиться повторювати введення імені та пароля.?',
		1 => 'Якщо ви не ставите галочку напроти пункту <em>Запам\'ятати мене</em>, ви зможете залишатися під своїм ім\'ям на конференції лише протягом встановленого часу. Це зроблено для того, щоб ніхто інший не зміг скористатися вашим обліковим записом. Для того щоб вам не доводилося вводити ім\'я користувача і пароль кожен раз, ви можете вибрати зазначений пункт при вході на конференцію. Не рекомендовано робити це на загальнодоступному комп\'ютері, наприклад в бібліотеці, інтернет-кафе, університеті і т. д. Если пункт <em>Запам\'ятати мене</em> відсутній, значить, адміністратор вимкнув цю функцію.'
	),
	array(
		0 => 'Як зробити, щоб я не з\'являвся в списку активних користувачів?',
		1 => 'У налаштуваннях особистого розділу ви знайдете опцію <em>Приховати моє перебування на конференції</em>. Виберіть <em>Так</em>, і ви будете видимі лише адміністраторам, модераторам та собі. Для всіх інших ви будете прихованим користувачем.'
	),
	array(
		0 => 'Я забув пароль!',
		1 => 'Не панікуйте! Хоча ваш пароль не відновити, але можна легко отримати новий. Перейти на сторінку входу на конференцію і напистніть на <em>Забули пароль?</em>. Дотримуйтесь інструкцій і незабаром ви знову зможете увійти на конференцію.'
	),
	array(
		0 => 'Я щойно зареєструвався, але не можу увійти!',
		1 => 'Спочатку перевірте свої ім\'я користувача та пароль. Якщо вони вірні, то можливі два варіанти. Якщо включена підтримка COPPA і при реєстрації ви вказали, що вам менше 13 років, дотримуйтесь інструкцій. На деяких форумах вимагається, щоб усі зареєстровані облікові записи були активовані самостійно користувачами або адміністратором до входу в систему. Ця інформація відображається в процесі реєстрації. Якщо вам було надіслано email-повідомлення, дотримуйтесь інструкцій. Якщо email-повідомлення не отримане, то можливо, що ви вказали правильну адресу email або він заблокований спам-фільтром. Якщо ви впевнені, що ввели правильну адресу email, спробуйте зв\'язатися з адміністратором.'
	),
	array(
		0 => 'Я давно зареєструвався, але тепер не можу увійти!',
		1 => 'Можливо, адміністратор з якоїсь причини деактивував або видалив ваш обліковий запис. Крім того, багато конференції періодично видаляють користувачів, які тривалий час не писали повідомлень, щоб зменшити розмір бази даних. Якщо це трапилось, спробуйте ще раз зареєструватись і прийняти участь у дискусіях.'
	),
	array(
		0 => 'Що таке COPPA?',
		1 => 'COPPA (Child Online Privacy and Protection Act), або Акт про захист приватних прав дитини в інтернеті від 1998 р. - це закон США, який вимагає від сайтів, які можуть збирати інформацію від неповнолітніх віком до 13 років, мати на це письмову згоду батьків. Допустимо або підтвердження від того, що вони дозволяють збір особистої інформації від неповнолітніх віком до 13 років. Якщо ви не впевнені, чи це може до вас, як до зареєструватись, чи до сайту, зверніться за допомогою до юрисконсульта. Зверніть увагу, що phpBB Limited не може надавати консультацій з юридичних питань і не є об\'єктом юридичних відносин, окрім вказаних нижче.',
	),
	array(
		0 => 'Чому я не можу зареєструватись?',
		1 => 'Можливо адміністратор конференції заблокував вашу IP-адресу або ім\'я користувача, яке ви намагаєтесь зареєструвати. Також він міг вимкнути реєстрацію нових користувачів. Зверніться за допомогою до адміністратора конференції.',
	),
	array(
		0 => 'Що робить «Видалити cookies конференції»?',
		1 => 'Вона видаляє всі створені cookies, які дозволяють вам залишатися авторизованим на цій конференції, а також виконують інші функції, такі як відстежування прочитаних повідомлень, якщо ця можливість включена адміністратором. Якщо ви відчуваєте труднощі з входом або виходом з конференції, можливо, видалення cookies допоможе.',
	),
	array(
		0 => '--',
		1 => 'Параметри та налаштування'
	),
	array(
		0 => 'Як мені змінити мої налаштування?',
		1 => 'Якщо ви є зареєстрованим користувачем, усі ваші налаштування зберігаються в базі даних конференції. Щоб змінити їх, перейдіть в <em>Особистий розділ</em>; посилання на нього зазвичай знаходиться вгорі сторінки. Там ви зможете змінити усі ваші налаштування.'
	),
	array(
		0 => 'На конференції неправильний час!',
		1 => 'Можливо час, який відображається, відповідає іншому часовому поясу, а не до того, в якому знаходитесь ви. У цьому випадку змініть налаштуваннях часовий пояс на той, в якому ви перебуваєте: Москва, Київ і т. д. Врахуйте, що зміна часового поясу, як і більшість налаштувань, можуть тільки зареєстровані користувачі. Якщо ви не зареєстровані, то зараз вдалий момент зробити це. '
	),
	array(
		0 => 'Я змінив часовий пояс, але час все одно невірний!',
		1 => 'Якщо ви впевнені, що правильно встановили часовий пояс та літній час, але час все-одно невірний, значить, неправильно встановлено час на сервері. Повідомте про це адміністратора для усунення проблеми.'
	),
	array(
		0 => 'Моєї мови немає у списку!',
		1 => 'Адміністратор не встановив підтримку вашої мови на конференції, або ще ніхто не переказав phpBB на вашу мову. Спробуйте запитати адміністратора, чи може він встановити необхідний вам мовний пакет. Якщо такого мовного пакета не існує, то ви самі можете перекласти phpBB на свою мову. Додаткову інформацію ви можете отримати на сайті phpBB (посилання внизу сторінки конференції).'
	),
	array(
		0 => 'Як я можу розмістити зображення поряд з своїм іменем?',
		1 => 'Разом з ім\'ям користувача можуть бути присутніми два зображення. Одне з них може відноситись до вашого звання, зазвичай у вигляді зірочок, блоків чи крапок, які вказують на те, скільки повідомлень ви написали або ваш статус на конференції. Інше, як правило більше, зображення відоме як «аватара», унікальне для кожного користувача. Від адміністратора конференції залежить чи дозволені аватари, і від нього ж залежить, які аватари можуть бути використані. Якщо ви не можете використовувати аватари, до адміністратора конференції для з\'ясування причин.'
	),
	array(
		0 => 'Що таке звання і як мені його змінити?',
		1 => 'Звання, яке знаходиться під вашим іменем користувача, відображає кількість вами повідомлень або ідентифікувати певних користувачів, таких як модератори або адміністратори. Взагалі ви не можете безпосередньо змінювати жодне звання на форумі, оскільки вони встановлюються адміністратором. Будь-ласка, не засмічуйте форум непотрібними повідомленнями тільки для того, щоб підняти своє звання. На більшості конференцій це заборонено, і модератор або адміністратор може зменшити кількість написаних вами повідомлень.'
	),
	array(
		0 => 'Коли я натискаю на посилання «email», від мене вимагають вхід на конференцію!',
		1 => 'Тільки зареєстровані користувачі можуть відправляти email-mail через вбудовану в конференцію форму, і лише якщо адміністратор увімкнув цю функцію. Це зроблено для того, щоб запобігти зловживанню поштовою системою анонімними користувачами.'
	),
	array(
		0 => '--',
		1 => 'Створення повідомлень'
	),
	array(
		0 => 'Як мені створити тему на форумі?',
		1 => 'Для створення нової теми на форумі клацніть по відповідній кнопці у вікні форуму або теми. Можливо, вам доведеться зареєструватися, перш ніж відправити повідомлення. Перелік ваших прав доступу знаходиться внизу сторінок форуму або теми. Наприклад: «Ви можете починати теми», «Ви можете голосувати в опитуваннях» і т.п.'
	),
	array(
		0 => 'Як мені відредагувати або видалити повідомлення?',
		1 => 'Якщо ви не є адміністратором або модератором конференції, ви можете редагувати і видаляти лише власні повідомлення. Ви можете перейти до редагування, клацнувши по кнопці <em>Редагувати</em> у відповідному повідомленні, інколи лише протягом обмеженого часу з моменту створення. Якщо хтось вже відповів на повідомлення, то під ним з\'явиться невеличкий напис, який показує кількість правок, а також дату і час останньої з них. Воно не з\'явиться, якщо повідомлення або адміністратор редагували модератор, хоча вони можуть самі написати про зроблені зміни на свій розсуд. Врахуйте, що звичайні користувачі не можуть видалити повідомлення, на яке вже хтось відповів.'
	),
	array(
		0 => 'Як мені додати підпис до мого повідомлення?',
		1 => 'Щоб додати підпис до повідомлення, ви повинні спочатку створити його в вашому особистому розділі. Після цього ви можете поставити галочку напроти пункту <em>Приєднати підпис</em> у формі відправки повідомлення, щоб підпис приєднався. Ви також можете налаштувати додавання підпису за замовчуванням до усіх ваших повідомлень, зробивши відповідний вибір у параграфі «Відправлення повідомлень» пункту «Особисті налаштування» в особистому розділі. Незважаючи на це, ви зможете скасувати додавання підпису у окремих повідомленнях, прибравши прапорець <em>Приєднати підпис</em> у формі відправки повідомлення.'
	),
	array(
		0 => 'Як мені створити опитування?',
		1 => 'При створенні теми або редагування першого повідомлення теми клацніть на закладці або перейдіть у форму <em>Створити опитування</em> під основною формою написання повідомлення, залежно від використовуваного стилю; якщо ви не бачите її форми, то ви не маєте прав для створення опитувань. Задайте тему і як мінімум два варіанти відповіді в відповідних полях, переконавшись, що кожен варіант знаходиться на окремому рядку текстового поля. Ви також можете задати кількість варіантів, які може обирати користувачі при голосуванні за допомогою опції «Варіантів відповіді», період проведення голосування в днях (0 означає, що опитування буде постійним) і можливість зміни, за який вони проголосували.'
	),
	array(
		0 => 'Чому я не можу додати більше варіантів відповідей?',
		1 => 'Обмеження варіантів відповідей встановлюється адміністратором конференцій. Якщо вам потрібно додати кількість варіантів, аніж це передбачено, зв\'яжіться з адміністратором конференції.'
	),
	array(
		0 => 'Як мені змінити або видалити опитування?',
		1 => 'Так само, як і повідомлення, опитування можуть редагуватись лише їхнім автором, модераторами або адміністраторами. Для редагування опитування перейдіть до редагування першого повідомлення в темі; опитування завжди пов\'язане з ним. Якщо ніхто не встиг проголосувати, то ви можете видалити опитування або відредагувати будь-який з варіантів відповіді. Однак якщо вже хтось проголосував, лише модератори та адміністратори можуть редагувати та видаляти опитування. Це зроблено для того, щоб не можна було змінювати варіанти відповіді під час голосування.'
	),
	array(
		0 => 'Чому мені недоступні деякі форуми?',
		1 => 'Деякі форуми доступні тільки певним користувачам або групам користувачів. Щоб переглядати такі форуми, створювати в них теми і залишати повідомлення, вчиняти інші дії, вам може знадобитися спеціальний дозвіл. Зв\'яжіться з модератором або адміністратором  конференції для отримання такого дозволу.'
	),
	array(
		0 => 'Чому я не можу приєднувати вкладення?',
		1 => 'Права на приєднання файлів встановлюються на рівні форумів, груп або користувача. Адміністратор конференції можливо заборонив приєднання файлів в форумі. Також можливо, що написати, або можливо лише певні групи. Якщо ви не знаєте, чому не можете додавати файли, зв\'яжіться з адміністратором конференції.'
	),
	array(
		0 => 'Чому я отримав попередження?',
		1 => 'На кожній конференції адміністратори встановлюють свої правила. Якщо ви порушили правила, ви можете отримати попередження. Врахуйте, що це рішення адміністратора конференції, і phpBB Limited немає жодного відношення до попереджень, винесеним на даному сайті. Якщо ви не знаєте, за що отримали попередження, зв\'яжіться з адміністратором конференції.'
	),
	array(
		0 => 'Як мені поскаржитись на повідомлення модератору?',
		1 => 'Поруч з кожним повідомленням ви побачите кнопку, якою відправлення скарги на нього, якщо це дозволено адміністратором конференції. Натиснувши на неї, ви пройдете через ряд кроків, необхідних для відправлення скарги на повідомлення.'
	),
	array(
		0 => 'Що означає кнопка «Зберегти» в формі написання повідомлення?',
		1 => 'Вона дозволяє вам зберігати повідомлення для того, щоб завершити та розмістити їх пізніше. Для завантажити їх, перейдіть в параграф «Чернетки» особистого розділу..'
	),
	array(
		0 => 'Чому моє повідомлення потребує схвалення?',
		1 => 'Адміністратор конференції можливо вирішив, що повідомлення вимагають попереднього перегляду перед відправкою на форум. Можливо також, що адміністратор додав вас до групи користувачів, повідомлення яких, за його або її думку, потребують перегляду перед відправкою. Будь-ласка, зв\'яжіться з адміністратором для отримання більш детальної інформації.'
	),
	array(
		0 => 'Як мені знову підняти мою тему?',
		1 => 'Натиснувши на посилання «Підняти тему» при її перегляді, ви «піднімете» тему в верхню частину першої сторінки форуму. Якщо цього не відбувається, то це означає, що можливість підняття тим могла бути відключена, або час, який повинен пройти до повторного підняття теми, ще не пройшло. Також можна підняти тему, просто відповівши на неї, однак переконайтесь, що ви не порушуєте правила конференції, в якій знаходитесь.'
	),
	array(
		0 => '--',
		1 => 'Форматування повідомлень та типи створюваних тем'
	),
	array(
		0 => 'Що таке BBCode?',
		1 => 'BBCode — це особлива реалізація HTML, великі можливості щодо форматування окремих частин повідомлення. Можливість використання BBCode визначається адміністратором, однак BBCode також може бути відключений на рівні повідомлення в кожній формі написання. BBCode схожий на HTML, теги заключаються в квадратні дужки  [ и ], а не в &lt; і &gt; . За додатковою інформацією про BBCode зверніться до керівництва по BBCode, посилання на яке доступна з сторінки написання повідомлення.'
	),
	array(
		0 => 'Чи можу я використовувати HTML?',
		1 => 'Ні. На цій конференції неможливе написання та обробка HTML-коду в повідомленнях. Більшість можливостей HTML для форматування тексту може бути реалізована за допомогою використання BBCode.'
	),
	array(
		0 => 'Що таке смайлики?',
		1 => 'Смайли, або емотикони - це маленькі зображення, які можуть бути використані для вираження почуттів, наприклад :) означає радість, :( означає сум. Повний список смайликів можна побачити в формі написання повідомлення. Тільки не перестарайтеся, використовуючи їх: вони легко можуть зробити повідомлення нечитабельним, і модератор може відредагувати ваше повідомлення або взагалі видалити його. Адміністратор конференції може обмежувати кількість смайликів, яке можна використовувати в повідомленні.'
	),
	array(
		0 => 'Чи можу я розміщувати зображення?',
		1 => 'Так, ви можете розміщувати зображення в своїх повідомленнях. Якщо адміністратор дозволив приєднання файлів, ви зможете завантажити зображення на конференцію. Якщо ні, ви повинні розмістити посилання на зображення, збережене на загальнодоступному веб-сервері. Приклад посилання: http://www.example.com/my-picture.gif. Ви не можете розміщувати посилання ні на зображення, які знаходяться на вашому комп\'ютері (якщо він не є загальнодоступним сервером), ні на зображення, для доступу до яких потрібна автентифікація, наприклад, на поштові скриньки Hotmail або Yahoo, захищені паролем сайти і т. п. Для вказівки посилань на зображення в повідомленні тег BBCode [img].'
	),
	array(
		0 => 'Що таке важливі оголошення?',
		1 => 'Важливі оголошення містять важливу інформацію і вам необхідно прочитати їх по можливості. Вони відображаються в верхній частині форуму та в вашому Особистому розділі. Права на створення важливих оголошень адміністратором конференції.'
	),
	array(
		0 => 'Що таке оголошення?',
		1 => 'Оголошення найчастіше містять важливу інформацію для форуму, на якому ви знаходитеся зараз, і ви повинні прочитати їх якнайшвидше. Оголошення відображаються в верхній частині кожної сторінки форуму, в якому вони створені. Так само, як і з важливими оголошеннями, можливість написання вами оголошень надаються адміністратором.'
	),
	array(
		0 => 'Що таке прикріплені теми?',
		1 => 'Прикріплені теми на форумі розміщуються під оголошеннями і виключно на першій сторінці. Вони найчастіше містять достатньо важливу інформацію, тому ви повинні прочитати їх якнайшвидше. Так само, як і з оголошеннями, можливість створення вами прикріплених тем встановлених адміністратором.'
	),
	array(
		0 => 'Що таке закриті теми?',
		1 => 'Це такі теми, в яких користувачі більше не можуть залишати повідомлення, і все які опитування в них автоматично завершуються. Теми можуть бути закриті виключно модераторами або адміністраторами конфренції. Ви також можете мати можливість закривати створені вами теми, залежно від прав, наданих вам адміністратором конференції.'
	),
	array(
		0 => 'Що таке значки тем?',
		1 => 'Значки тем - це встановлені автором зображення, які пов\'язані з повідомленнями та відображають їхній зміст. Можливість використання значків тем залежить від прав, встановлених адміністратором.'
	),
	// This block will switch the FAQ-Questions to the second template column
	array(
		0 => '--',
		1 => '--'
	),
	array(
		0 => '--',
		1 => 'Рівні користувачів та групи'
	),
	array(
		0 => 'Хто такі адміністратори?',
		1 => 'Адміністратори - особи, які мають найвищий рівень контролю над конференцією. Вони можуть керувати усіма аспектами роботи конференції, які включають розмежування прав доступу, закриття користувачів, створення груп, призначення модераторів і т.п., в залежності від прав, наданих їм засновником конференції. Вони також можуть володіти усіма можливостями модераторів в усіх форумах, залежно від прав, наданих ним засновником конференції.'
	),
	array(
		0 => 'Хто такі модератори?',
		1 => 'Модератори - це користувачі (або групи користувачів), які щодня стежать за роботою форуму. Вони мають право редагувати або видаляти повідомлення, закривати, відкривати, переміщати, видаляти і об\'єднувати теми на форумі, за який вони відповідають. Основне завдання модераторів - не допускати відхилень від тем (оффтопіків), образ.'
	),
	array(
		0 => 'Що таке групи користувачів?',
		1 => 'Групи користувачів ділять спільноту учасників на підрозділи, якими керують адміністратори конференції. Кожен учасник може належати до декількох груп і кожній групі може бути надано індивідуальні права доступу. Це полегшує адміністраторам призначити кількох користувачів, наприклад, модераторами форуму або надати їм доступ до приватних форумів.'
	),
	array(
		0 => 'Де знаходяться групи користувачів і як мені вступити в них?',
		1 => 'Ви можете отримати інформацію про всі існуючі групах за посиланням «Групи» у вашому особистому розділі. Якщо ви бажаєте вступити в одну з них, натисніть відповідну кнопку. Однак не усі групи є загальнодоступними. Деякі з них потребують схвалення для вступу, деякі можуть бути закритими або навіть прихованими. Якщо група є відкритою, ви можете вступити до неї натиснувши відповідну кнопку. Якщо потрібне схвалення на участь у групі, ви можете відправити запит на вступ, клацнувши по відповідній кнопці. Лідер групи повинен схвалити ваш в групі і може запитати, чому ви бажаєте приєднатись. Будь-ласка, не діставайте лідера групи, якщо він відхилив ваш запит у нього можуть бути для цього свої причини.'
	),
	array(
		0 => 'Як мені стати Лідером групи?',
		1 => 'Призначає лідера групи створюються адміністратором конференції. Якщо ви зацікавлені у створенні групи, для початку зв\'яжіться з адміністратором конференції, відправивши йому приватне повідомлення.'
	),
	array(
		0 => 'Чому групи мають різні кольори?',
		1 => 'Адміністратор конференції може встановлювати кольори учасникам груп для того, щоб їх легше було розрізняти один від одного.'
	),
	array(
		0 => 'Що таке група за замовчуванням?',
		1 => 'Якщо ви є учасником більш ніж одної групи, ваша група за замовчуванням використовується для того, щоб визначити, який колір та звання буде присвоєно. Адміністратор конференції може надати вам право змінювати вашу групу за замовчуванням в вашому особистому розділі.'
	),
	array(
		0 => 'Що означає посилання «Наша команда»?',
		1 => 'На цій сторінці ви знайдете список адміністраторів і модераторів та інформацію, таку як відомості про форуми, які вони модерують.'
	),
	array(
		0 => '--',
		1 => 'Приватні повідомлення'
	),
	array(
		0 => 'Я не можу відсилати приватні повідомлення!',
		1 => 'Це може бути викликано трьома причинами: ви не зареєструвались і/або не ввійшли на конференцію, адміністратор заборонив відправлення приватних повідомлень на форумі; або ж адміністратор заборонив це вам особисто. Зв\'яжіться з адміністратором конференції для отримання додаткової інформації.'
	),
	array(
		0 => 'Я постійно отримую небажані приватні повідомлення!',
		1 => 'Ви можете автоматично видаляти приватні повідомлення користувачів, скориставшись правилами повідомлень в Особистому розділі. Якщо Ви отримуєте образливі приватні повідомлення від одного з учасників, відправте скарги на повідомлення модераторам; вони можуть заборонити відправлення приватних повідомлень.'
	),
	array(
		0 => 'Я отримав спам або образливий email від учасника цієї конференції!',
		1 => 'Ми шкодуємо про це. Форма відправки email на цій конференції і включає запобіжні заходи і можливість відслідковування учасників, які відсилають подібні повідомлення. Відправте email-повідомлення адміністратору конференції з повною копією отриманого листа. Дуже важливо включити усі заголовки, в яких міститься детальна інформація про відправника. Адміністратор зреагує і зробить відповідні дії.'
	),
	array(
		0 => '--',
		1 => 'Друзі та недруги'
	),
	array(
		0 => 'Що таке список друзів та недругів?',
		1 => 'Ви можете використовувати ці списки інших користувачів конференції. Учасники, додані до списку друзів, будуть відображатись в особистому розділі для швидкого доступу до інформації про те, чи вони зараз в мережі, і для відсилання їм приватних повідомлень. Повідомлення від цих користувачів можуть виділятись, якщо це підтримується стилем конференції. Якщо ви додали учасника в список ваших недругів, усі його повідомлення буде приховано за замовчуванням.'
	),
	array(
		0 => 'Як я можу додавати/видаляти користувачів в мій список друзів та недругів?',
		1 => 'Ви можете додавати учасників в свої списки двома способами. В профілі кожного учасника є можливість додати його в ваш список друзів або недругів. Крім того, ви можете зробити це прямо з вашого особистого розділу, безпосереднім введенням імені користувача. Ви також можете видаляти учасників з ваших списків на тій же сторінці.'
	),
	array(
		0 => '--',
		1 => 'Пошук по форумах'
	),
	array(
		0 => 'Як мені здійснити пошук по форуму або формами?',
		1 => 'Введіть умови пошуку в поле, розташованому на головній сторінці форуму та на сторінках перегляду форумів та тем. Ви можете здійснити розширений пошук, доступний за посиланням «Розширений пошук», доступною на всіх сторінках конференції. Спосіб доступу до пошуку може залежати від використовуваного стилю.'
	),
	array(
		0 => 'Чому мій пошук не дає результатів?',
		1 => 'Ваш пошуковий запит, можливо, був занадто невизначеним і включав багато загальних умов, за якими не індексуються phpBB3. Для більш чітко та скористайтесь можливостями розширеного пошуку.'
	),
	array(
		0 => 'В результаті пошуку я отримав порожню сторінку!',
		1 => 'Ваш пошук дав надто велику кількість результатів, які веб-сервер не зміг обробити. Використайте «Розширений пошук», більш точно задавайте умови пошуку і форуми, на яких він має бути здійснений.'
	),
	array(
		0 => 'Як мені знайти учасників конференції?',
		1 => 'Перейдіть на сторінку «Учасники» і натисніть по посиланню «Знайти учасника».'
	),
	array(
		0 => 'Як мені знайти власні повідомлення та теми?',
		1 => 'Ви можете знайти свої повідомлення, натиснувши або за посиланням «Ваші повідомлення» на головній сторінці, або за посиланням «Знайти повідомлення користувача» у вашому особистому розділі. Щоб знайти створені вами теми, скористайтесь розширеним пошуком і задайте необхідні для цього критерії.'
	),
	array(
		0 => '--',
		1 => 'Закладки і підписка на теми та'
	),
	array(
		0 => 'Чим відрізняються закладки від підписки?',
		1 => 'ЗЗакладки в phpBB3 схожі на закладки в вашому веб-браузері. Ви не будете попереджені про зміни, що, але ви зможете перейти в тему пізніше. Однак, оформивши підписку, ви будете отримувати повідомлення про зміни в тему чи форум за допомогою встановленого вами способа чи способів.'
	),
	array(
		0 => 'Як мені підписатись на певні форуми чи теми?',
		1 => 'Щоб підписатись на певний форум, зайдіть на нього і натисніть по посиланню «Підписатися на форум». Щоб підписатися на тему, поставте відповідну галочку при написанні відповіді або натисніть на посилання "«Підписатись на тему» в потрібній вам темі.'
	),
	array(
		0 => 'Як мені відмовитись від підписки?',
		1 => 'Для відмови від підписки, перейдіть в особистий розділ і натисніть по посиланню «Підписка».'
	),
	array(
		0 => '--',
		1 => 'Вкладення'
	),
	array(
		0 => 'Які саме файли можна на цьому форумі?',
		1 => 'Адміністратор кожного форуму сам визначає типи вкладень. Якщо ви не знаєте, які саме файли можна, зв\'яжіться з адміністратором конференції для отримання допомоги.'
	),
	array(
		0 => 'Як мені знайти мої вкладення?',
		1 => 'Щоб знайти список усіх приєднаних вами файлів, перейдіть в Особистий розділ і клацніть по посиланню «Вкладення».'
	),
	array(
		0 => '--',
		1 => 'Інформація про phpBB3'
	),
	array(
		0 => 'Хто написав цю конференцію?',
		1 => 'Це програмне забезпечення (в своїй незміненій формі) створене і поширюється <a href="https://www.phpbb.com/">phpBB Limited</a>. Воно доступне за умовами GNU General Public Licence і може вільно поширюватися. Для отримання додаткової інформації перейдіть за посиланням.'
	),
	array(
		0 => 'Чому тут немає якоїсь функції?',
		1 => 'Це програмне забезпечення створене і ліцензоване phpBB Limited. Якщо ви вважаєте, що якась функція повинна бути додана будь ласка, відвідайте <a href="https://www.phpbb.com/ideas/">phpBB Ideas Centre</a> де ви можете подивитися існуючі ідеї або запропонувати свою ідею.'
	),
	array(
		0 => 'З ким мені зв\'язатись з питань некоректного використання і/або юридичних питань, пов\'язаних з цією конференцією?',
		1 => 'Ви можете зв\'язатися з будь-яким з адміністраторів, перерахованих в списку на сторінці «Наша команда». Якщо ви не отримаєте відповіді, зв\'яжіться з власником домену (зробіть <a href="https://www.google.com/search?q=whois">whois lookup</a>) або, якщо це безкоштовний сервіс (наприклад, chat.ru, Yahoo!, free.fr, f2s.com и т. п.), скерівництвом або техпідтримкою цього сервісу. Врахуйте, що phpBB Limited <strong>не має ніякого контролю над даною конференцією</strong> і не може нести ніякої відповідальності за те, ким і як використовується даний форум. Не звертайтесь до phpBB Limited з юридичних питань (про припинення роботи форуму, відповідальності за неї і т. д.), які <strong>не належать безпосередньо</strong> до сайту phpBB.com або які частково відносяться до програмного забезпечення phpBB Limited. Якщо ж ви все-таки надішлете email на адресу phpBB Limited з приводу використання цього <strong>третьою стороною</strong>, то не чекайте детальної відповіді чи ви можете взагалі не отримати відповіді.'
	),
);
