<?php
/**
*
* help_bbcode [Ukrainian]
*
* @package language
* @copyright (c) 2005 phpBB Group
* @license http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
*
*/

/**
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$help = array(
	array(
		0 => '--',
		1 => 'Вступ'
	),
	array(
		0 => 'Що таке BBCode?',
		1 => 'BBCode — це спеціальний варіант HTML. Чи зможете ви використовувати BBCode в ваших повідомленнях чи ні, визначається адміністратором форумів. Крім того, ви зможете відключити використання BBCode у конкретному повідомленні при його розміщенні. Сам BBCode за стилем схожий на HTML, теги укладені в квадратні дужки [ и ], а не в &lt; і &gt;; він дає більше можливостей управління тим, як виводяться дані. При використанні деяких шаблонів ви зможете додавати BBCode в ваші повідомлення, користуючись простим інтерфейсом, розташованим над полем для введення тексту. Але навіть у цьому випадку дане керівництво може виявитися корисним.'
	),
	array(
		0 => '--',
		1 => 'Форматування тексту'
	),
	array(
		0 => 'Як зробити текст жирним, курсивом чи підкреслений',
		1 => 'BBCode включає теги для швидкого зміни стилю шрифту, зробити це можна наступними способами: <ul><li>Щоб зробити текст жирним, укладіть його в <strong>[b][/b]</strong>, наприклад:<br /><br /><strong>[b]</strong>Привіт<strong>[/b]</strong><br /><br />стане <strong>Привіт</strong></li><li>Для підкреслення використовуйте <strong>[u][/u]</strong>, наприклад:<br /><br /><strong>[u]</strong>Доброго ранку<strong>[/u]</strong><br /><br />стане <span style="text-decoration: underline">Доброго ранку</span></li><li>Курсив робиться тегами <strong>[i][/i]</strong>, наприклад:<br /><br />Це <strong>[i]</strong>здорово!<strong>[/i]</strong><br /><br />видасть Це <i>здорово!</i></li></ul>'
	),
	array(
		0 => 'Як змінити колір або розмір тексту',
		1 => 'Для зміни кольору або розміру шрифту можуть бути використані наступні теги (остаточний вигляд буде залежати від системи і браузера користувача): <ul><li>Колір тексту можна змінити, оточивши його <strong>[color=][/color]</strong>. Ви можете вказати або відоме ім\'я кольору (red, blue, yellow и т. п.), або шістнадцяткове уявлення, наприклад #FFFFFF, #000000. Таким чином, для створення червоного тексту ви можете використовувати:<br /><br /><strong>[color=red]</strong>Привіт!<strong>[/color]</strong><br /><br />або<br /><br /><strong>[color=#FF0000]</strong>Привіт!<strong>[/color]</strong><br /><br />обидва способи дадуть в результаті <span style="color:red">Привіт!</span></li><li>Зміна розміру досягається аналогічним чином при використанні <strong>[size=][/size]</strong>. Цей тег залежить від використовуваних шаблонів, рекомендований формат - число, що показує розмір тексту у відсотках, від 20% (дуже маленький) до 200% (дуже великий) від розміру за замовчуванням. наприклад:<br /><br /><strong>[size=30]</strong>МАЛЕНЬКИЙ<strong>[/size]</strong><br /><br />скоріш за все буде <span style="font-size:30%;">МАЛЕНЬКИЙ</span><br /><br />в той час як:<br /><br /><strong>[size=200]</strong>ВЕЛИКИЙ!<strong>[/size]</strong><br /><br />буде <span style="font-size:200%;">ВЕЛИКИЙ!</span></li></ul>'
	),
	array(
		0 => 'Чи можу я комбінувати теги?',
		1 => 'Так, звичайно, можете. Наприклад, для залучення чиєїсь уваги ви зможете написати:<br /><br /><strong>[size=200][color=red][b]</strong>ПОДИВІТЬСЯ НА МЕНЕ!<strong>[/b][/color][/size]</strong><br /><br />що видасть <span style="color:red;font-size:200%;"><strong>ПОДИВІТЬСЯ НА МЕНЕ!</strong></span><br /><br />Ми не рекомендуємо виводити таким чином довгі тексти! Врахуйте, що ви, автор повідомлення, повинні подбати про те, щоб теги були правильно вкладені. Ось цей BBCode, наприклад, неправильний:<br /><br /><strong>[b][u]</strong>це невірно<strong>[/b][/u]</strong>'
	),
	array(
		0 => '--',
		1 => 'Цитування та виведення тексту'
	),
	array(
		0 => 'Цитування при відповідях',
		1 => 'Є два способи процитувати текст, з посиланням та без.<ul><li>Коли ви використовуєте кнопку «Цитата» для відповіді на повідомлення, то його текст додається в поле введення оточеним блоком <strong>[quote=&quot;&quot;][/quote]</strong>. Цей метод дозволить вам цитувати з посиланням на автора або на щось ще, що ви туди впишете. Наприклад, для цитування уривка тексту, написаного Mr. Blobby, ви напишете:<br /><br /><strong>[quote=&quot;Mr. Blobby&quot;]</strong>Текст Mr. Blobby буде тут<strong>[/quote]</strong><br /><br />У результаті перед текстом будуть вставлені слова «Mr. Blobby писав(ла):». Пам\'ятайте, ви <strong>повинні</strong> заключити ім\'я в лапки &quot;&quot;, вони не можуть бути опущені.</li><li>Другий метод просто дозволяє вам щось процитувати. Для цього вам треба заключити текст в теги <strong>[quote][/quote]</strong>. При перегляді повідомлення буде просто показаний текст у блоці цитування.</li></ul>'
	),
	array(
		0 => 'Виведення коду або форматованого тексту',
		1 => 'Якщо вам треба вивести шматок програми або щось, що повинно бути виведено шрифтом фіксованої ширини (Courier), ви повинні укласти текст в теги <strong>[code][/code]</strong>, наприклад:<br /><br /><strong>[code]</strong>echo &quot;This is some code&quot;;<strong>[/code]</strong><br /><br />Всі форматування, використовуване усередині тегів <strong>[code][/code]</strong>, буде збережено. Підсвічування синтаксису мови PHP може бути включена за допомогою <strong>[code=php][/code]</strong> і рекомендується при відправці повідомлень з PHP-кодом для поліпшення його легкості читання.'
	),
	array(
		0 => '--',
		1 => 'Створення списків'
	),
	array(
		0 => 'Створення маркованого списку',
		1 => 'BBCode підтримує два види списків: марковані та нумеровані. Вони практично ідентичні своїм еквівалентів з HTML. У маркірованих списку всі елементи виводяться послідовно, кожен відзначається символом-маркером. Для створення маркованого списку використовуйте <strong>[list][/list]</strong> і визначте кожен елемент за допомогою <strong>[*]</strong>. Наприклад, щоб вивести свої улюблені кольори, ви можете використовувати:<br /><br /><strong>[list]</strong><br /><strong>[*]</strong>Червоний<br /><strong>[*]</strong>Синій<br /><strong>[*]</strong>Жовтий<br /><strong>[/list]</strong><br /><br />Це видасть такий список:<ul><li>Червоний</li><li>Синій</li><li>Жовтий</li></ul>'
	),
	array(
		0 => 'Створення нумерованого списку',
		1 => 'Другий тип списку, нумерований, дозволяє вибрати, що саме буде виводитися перед кожним елементом. Для створення нумерованого списку використовуйте <strong>[list=1][/list]</strong> або <strong>[list=a][/list]</strong> для створення алфавітного списку. Як і у випадку маркованого списку, елементи визначаються за допомогою <strong>[*]</strong>. Наприклад:<br /><br /><strong>[list=1]</strong><br /><strong>[*]</strong>Піти в магазин<br /><strong>[*]</strong>Купити новий процесор<br /><strong>[*]</strong>Купити новий монітор<br /><strong>[/list]</strong><br /><br />видасть наступне:<ol style="list-style-type: decimal"><li>Піти в магазин</li><li>Купити новий процесор</li><li>Купити новий монітор</li></ol>Для алфавитного списка используйте:<br /><br /><strong>[list=a]</strong><br /><strong>[*]</strong>Перша можлива відповідь<br /><strong>[*]</strong>Друга можлива відповідь<br /><strong>[*]</strong>Третя можлива відповідь<br /><strong>[/list]</strong><br /><br />що видасть<ol style="list-style-type: lower-alpha"><li>Перша можлива відповідь</li><li>Друга можлива відповідь</li><li>Третя можлива відповідь</li></ol>'
	),
	// This block will switch the FAQ-Questions to the second template column
	array(
		0 => '--',
		1 => '--'
	),
	array(
		0 => '--',
		1 => 'Створення посилань'
	),
	array(
		0 => 'Посилання на інший сайт',
		1 => 'У BBCode підтримується кілька способів створення URL\'лів.<ul><li>Перший з них використовує тег <strong>[url=][/url]</strong>, після знаку = повинен йти потрібний URL. Наприклад, для посилання на phpBB.com ви могли б використовувати:<br /><br /><strong>[url=http://www.phpbb.com/]</strong>Відвідайте phpBB!<strong>[/url]</strong><br /><br />Це створить таке посилання: <a href="http://www.phpbb.com/">Відвідайте phpBB!</a> Врахуйте, що посилання буде відкриватися в тому ж або в новому вікні, в залежності від налаштувань браузера користувача.</li><li>Якщо ви хочете, щоб в якості тексту посилання показувався сам URL, ви можете просто зробити наступне:<br /><br /><strong>[url]</strong>http://www.phpbb.com/<strong>[/url]</strong><br /><br />Це видасть наступне посилання: <a href="http://www.phpbb.com/">http://www.phpbb.com/</a></li><li>Крім того, phpBB підтримує можливість, звану <i>Автоматичні посилання</i>, це переведе будь синтаксично правильний URL в посилання без необхідності вказівки тегів і навіть префікса http://. Наприклад, введення www.phpbb.com в ваше повідомлення призведе до автоматичної видачі <a href="http://www.phpbb.com/">www.phpbb.com</a> при перегляді повідомлення.</li><li>Те ж саме відноситься і до адрес email, ви можете або вказати адресу в явному вигляді:<br /><br /><strong>[email]</strong>no.one@domain.adr<strong>[/email]</strong><br /><br />що видасть <a href="emailto:no.one@domain.adr">no.one@domain.adr</a>, або просто ввести no.one@domain.adr до вашого повідомлення, і він буде автоматично перетворено при перегляді.</li></ul>Як і з усіма іншими тегами BBCode, ви можете укладати в URL\'и будь-які інші теги, наприклад <strong>[img][/img]</strong> (див. наступний пункт), <strong>[b][/b]</strong> и т.д. Як і з тегами форматування, правильна вкладеність тегів залежить від вас, наприклад:<br /><br /><strong>[url=http://www.google.com/][img]</strong>http://www.google.com/intl/en_ALL/images/logo.gif<strong>[/url][/img]</strong><br /><br /> <span style="text-decoration: underline">невірно</span>, що може призвести до подальшого видалення вашого повідомлення, так що будьте акуратніше.'
	),
	array(
		0 => '--',
		1 => 'Показ зображень у повідомленнях'
	),
	array(
		0 => 'Додавання зображення до повідомлення',
		1 => 'BBCode включає тег для додавання картинки в ваше повідомлення. При цьому слід пам\'ятати дві дуже важливі речі: по-перше, багатьох користувачів дратує велика кількість зображень, по-друге, ваше зображення вже повинне бути розміщене в інтернеті (тобто воно не може бути розташоване тільки на вашому комп\'ютері, якщо, звичайно , ви не запустили на ньому веб-сервер!). На даний момент немає можливості зберігати зображення локально на phpBB (очікується, що це обмеження буде знято в наступній версії phpBB). Для виведення зображення ви повинні оточити його URL тегами <strong>[img][/img]</strong>. Наприклад:<br /><br /><strong>[img]</strong>http://www.google.com/intl/en_ALL/images/logo.gif<strong>[/img]</strong><br /><br />Як зазначено в попередньому пункті, ви можете укласти зображення в теги <strong>[url][/url]</strong>, тобто<br /><br /><strong>[url=http://www.google.com/][img]</strong>http://www.google.com/intl/en_ALL/images/logo.gif<strong>[/img][/url]</strong><br /><br />видасть:<br /><br /><a href="http://www.google.com/"><img src="http://www.google.com/intl/en_ALL/images/logo.gif" alt="" /></a>'
	),
	array(
		0 => 'Додавання додатковиї файлів до повідомлення',
		1 => 'Тепер вкладення можуть бути поміщені в будь-якій частині повідомлення за допомогою нового тега BBCode <strong>[attachment=][/attachment]</strong>, якщо вкладення дозволені адміністратором конференції і якщо ви маєте необхідні права доступу. На сторінці розміщення повідомлення знаходиться список, що випадає (відповідно кнопка) для розміщення вкладень у повідомленні.'
	),
	array(
		0 => '--',
		1 => 'Інше'
	),
	array(
		0 => 'Чи можу я додати власні теги?',
		1 => 'Якщо ви є адміністратором цієї конференції і маєте достатні права, то можете додати нові теги BBCode в Панелі адміністратора.'
	)
);
