<?php
/**
*
* install [Ukrainian]
*
* @package language
* @copyright (c) 2005 phpBB Group
* @license http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ADMIN_CONFIG'				=> 'Налаштування адміністратора',
	'ADMIN_PASSWORD'			=> 'Пароль адміністратора',
	'ADMIN_PASSWORD_CONFIRM'	=> 'Підтвердження пароля адміністратора',
	'ADMIN_PASSWORD_EXPLAIN'	=> 'Введіть пароль довжиною від 6 до 30 символів.',
	'ADMIN_TEST'				=> 'Перевірка налаштувань адміністратора',
	'ADMIN_USERNAME'			=> 'Ім\'я адміністратора',
	'ADMIN_USERNAME_EXPLAIN'	=> 'Введіть ім\'я довжиною від 3 до 20 символів.',
	'APP_MAGICK'				=> 'Підтримка Imagemagick [ вкладення ]',
	'AUTHOR_NOTES'				=> 'Нотатки учасника<br />» %s',
	'AVAILABLE'					=> 'Доступно',
	'AVAILABLE_CONVERTORS'		=> 'Доступні конвертери',

	'BEGIN_CONVERT'					=> 'Почати конвертування',
	'BLANK_PREFIX_FOUND'			=> 'Перегляд ваших таблиць показав наявність підходящої конференції без префікса таблиць.',
	'BOARD_NOT_INSTALLED'			=> 'phpBB3 не встановлений',
	'BOARD_NOT_INSTALLED_EXPLAIN'	=> 'Для роботи єдиної системи конвертації потрібна встановлена ​​за замовчуванням версія phpBB3, будь ласка, <a href="%s">спочатку перейдіть до установки phpBB3</a>.',
	'BACKUP_NOTICE'					=> 'Створіть резервну копію конференції на випадок виникнення проблем у процесі оновлення.',

	'CATEGORY'					=> 'Категорія',
	'CACHE_STORE'				=> 'Тип кеша',
	'CACHE_STORE_EXPLAIN'		=> 'Фізичне розташування даних кешу, краща файлова система.',
	'CAT_CONVERT'				=> 'Конвертація',
	'CAT_INSTALL'				=> 'Встановлення',
	'CAT_OVERVIEW'				=> 'Введення',
	'CAT_UPDATE'				=> 'Оновлення',
	'CHANGE'					=> 'Змінити',
	'CHECK_TABLE_PREFIX'		=> 'Перевірте правильність префікса таблиць і спробуйте знову.',
	'CLEAN_VERIFY'				=> 'Очищення і перевірка кінцевої структури',
	'CLEANING_USERNAMES'		=> 'Очищення імен користувачів',
	'COLLIDING_CLEAN_USERNAME'	=> 'Очищене ім\'я <strong>%s</strong> відповідає іменам користувачів:',
	'COLLIDING_USERNAMES_FOUND'	=> 'На вашій старій конференції знайдені конфліктуючі імена користувачів. Для завершення перетворення видаліть або перейменуйте цих користувачів так, щоб кожному очищеному імені відповідав тільки один користувач старої конференції.',
	'COLLIDING_USER'			=> '» ідентифікатор користувача: <strong>%d</strong> ім\'я користувача: <strong>%s</strong> (повідомлення: %d)',
	'CONFIG_CONVERT'			=> 'Конвертація конфігурації',
	'CONFIG_FILE_UNABLE_WRITE'	=> 'Не вдалося записати конфігураційний файл. Інші методи створення цього файлу вказані нижче.',
	'CONFIG_FILE_WRITTEN'		=> 'Конфігураційний файл записаний. Тепер ви можете приступити до наступного етапу установки.',
	'CONFIG_PHPBB_EMPTY'		=> 'Змінна конфігурації phpBB3 для «%s» пуста.',
	'CONFIG_RETRY'				=> 'Повторити',
	'CONTINUE_CONVERT'			=> 'Продовжити конвертування',
	'CONTINUE_CONVERT_BODY'		=> 'Виявлена ​​попередня спроба конвертування. Ви можете почати нове конвертування або продовжити попереднє',
	'CONTINUE_LAST'				=> 'Продовжити виконання заключних операцій',
	'CONTINUE_OLD_CONVERSION'	=> 'Продовжити раніше розпочате конвертування',
	'CONVERT'					=> 'Конвертувати',
	'CONVERT_COMPLETE'			=> 'Конвертація завершено',
	'CONVERT_COMPLETE_EXPLAIN'	=> 'Ви успішно сконвертування вашу конференцію у формат phpBB 3.1. Ви можете <a href="../">увійти на конференцію</a>. Переконайтеся, що всі налаштування успішно перенесені, перш ніж запустіть конференцію, видаливши папку install. Пам\'ятайте, що допоміжну інформацію з використання phpBB можна отримати в інтернеті, вивчивши <a href="https://www.phpbb.com/support/documentation/3.0/">документацію(англійською)</a> і <b><a href="http://phpbbukraine.net/forum25.html">документацію(українською)</a></b>, а також на <a href="https://www.phpbb.com/phpBB/viewforum.php?f=46">форумі підтримки phpBB Group</a> <b><a href="http://phpbbukraine.net/">і форумі української підтримки phpBB Ukraine</a></b>.',
	'CONVERT_INTRO'				=> 'Вас вітає система конвертації phpBB',
	'CONVERT_INTRO_BODY'		=> 'Тут ви маєте можливість імпортувати дані з інших (встановлених) типів конференцій. У списку нижче містяться доступні нині модулі для конвертування. Якщо в ньому відсутня конференція, яку ви хотіли б конвертувати, будь ласка, відвідайте наш веб-сайт, на якому можуть бути доступні для завантаження додаткові модулі.',
	'CONVERT_NEW_CONVERSION'	=> 'Нове конвертування',
	'CONVERT_NOT_EXIST'			=> 'Зазначеного конвертера не існує.',
	'CONVERT_OPTIONS'			=> 'Параметри',
	'CONVERT_SETTINGS_VERIFIED'	=> 'Перевірка вказаної вами інформації завершена. Щоб почати конвертування, натисніть кнопку нижче.',
	'CONV_ERR_FATAL'					=> 'Критична помилка при конвертації',

	'CONV_ERROR_ATTACH_FTP_DIR'			=> 'На старій конференції включена завантаження вкладень по FTP. Вимкніть її і переконайтеся у правильності зазначеної папки для завантаження, потім скопіюйте всі файли вкладень в цю нову папку, доступну через інтернет. Після цього перезапустіть конвертер.',
	'CONV_ERROR_CONFIG_EMPTY'			=> 'Відсутня доступна інформація про конфігурацію для конвертації.',
	'CONV_ERROR_FORUM_ACCESS'			=> 'Не вдалося отримати інформацію про локальні правах доступу.',
	'CONV_ERROR_GET_CATEGORIES'			=> 'Не вдалося отримати інформацію про категорії.',
	'CONV_ERROR_GET_CONFIG'				=> 'Не вдалося отримати інформацію про конфігурації конференції.',
	'CONV_ERROR_COULD_NOT_READ'			=> 'Не вдалося отримати доступ або прочитати «%s».',
	'CONV_ERROR_GROUP_ACCESS'			=> 'Не вдалося одержати інформацію про права груп.',
	'CONV_ERROR_INCONSISTENT_GROUPS'	=> 'Виявлено порушення цілісності таблиці груп в add_bots(). Необхідно додати всі спеціальні групи вручну.',
	'CONV_ERROR_INSERT_BOT'				=> 'Не вдалося додати бота в таблицю користувачів.',
	'CONV_ERROR_INSERT_BOTGROUP'		=> 'Не вдалося додати бота в таблицю ботів.',
	'CONV_ERROR_INSERT_USER_GROUP'		=> 'Неможливо додати користувача в таблицю user_group.',
	'CONV_ERROR_MESSAGE_PARSER'			=> 'Помилка обробки повідомлення',
	'CONV_ERROR_NO_AVATAR_PATH'			=> 'Примітка розробнику: ви повинні вказати $convertor[\'avatar_path\'] для використання %s.',
	'CONV_ERROR_NO_FORUM_PATH'			=> 'Не вказаний відносний шлях до вихідної конференції.',
	'CONV_ERROR_NO_GALLERY_PATH'		=> 'Примітка розробнику: ви повинні вказати $convertor[\'avatar_gallery_path\'] для використання %s.',
	'CONV_ERROR_NO_GROUP'				=> 'Не вдалося знайти групу «%1$s» в %2$s.',
	'CONV_ERROR_NO_RANKS_PATH'			=> 'Примітка розробнику: ви повинні вказати $convertor[\'ranks_path\'] для використання %s.',
	'CONV_ERROR_NO_SMILIES_PATH'		=> 'Примітка розробнику: ви повинні вказати $convertor[\'smilies_path\'] для використання %s.',
	'CONV_ERROR_NO_UPLOAD_DIR'			=> 'Примітка розробнику: ви повинні вказати $convertor[\'upload_path\'] для використання %s.',
	'CONV_ERROR_PERM_SETTING'			=> 'Не вдалося додати/оновити налаштування прав доступу.',
	'CONV_ERROR_PM_COUNT'				=> 'Не вдалося відібрати кількість особистих повідомлень у папці.',
	'CONV_ERROR_REPLACE_CATEGORY'		=> 'Не вдалося додати новий форум замість старій категорії.',
	'CONV_ERROR_REPLACE_FORUM'			=> 'Не вдалося додати новий форум замість старого форуму.',
	'CONV_ERROR_USER_ACCESS'			=> 'Не вдалося дані аутентифікації користувача.',
	'CONV_ERROR_WRONG_GROUP'			=> 'Виявлена ​​неправильна група «%1$s» в %2$s.',
	'CONV_OPTIONS_BODY'					=> 'На цій сторінці вам пропонується ввести дані, необхідні для доступу до вихідної конференції. Вкажіть інформацію про базу даних вашої старій конференції; конвертер не вноситиме до неї ніяких змін. Для забезпечення повноцінної конвертації вихідну конференцію слід відключити.',
	'CONV_SAVED_MESSAGES'				=> 'Обережені повідомлення',

	'COULD_NOT_COPY'			=> 'Не вдалося скопіювати файл <strong>%1$s</strong> в <strong>%2$s</strong><br /><br />Перевірте, що кінцева папка існує і що в неї може здійснюватися запис.',
	'COULD_NOT_FIND_PATH'		=> 'Не вдалося знайти шлях до старої конференції. Перевірте налаштування і спробуйте знову.<br />» Шлях %s був вказаний як вихідний.',

	'DBMS'						=> 'Тип бази даних',
	'DB_CONFIG'					=> 'Конфігурація бази даних (БД)',
	'DB_CONNECTION'				=> 'Підключення до бази даних',
	'DB_ERR_INSERT'				=> 'Помилка при обробці запиту <code>INSERT</code>.',
	'DB_ERR_LAST'				=> 'Помилка при обробці <var>query_last</var>.',
	'DB_ERR_QUERY_FIRST'		=> 'Помилка при виконанні <var>query_first</var>.',
	'DB_ERR_QUERY_FIRST_TABLE'	=> 'Помилка при виконанні <var>query_first</var>, %s («%s»).',
	'DB_ERR_SELECT'				=> 'Помилка при обробці запиту <code>SELECT</code>.',
	'DB_HOST'					=> 'Ім\'я сервера БД або DSN',
	'DB_HOST_EXPLAIN'			=> 'DSN — це ім\'я джерела даних і потрібно тільки при установці з використанням ODBC.  В PostgreSQL використовуйте ім\'я localhost для з\'єднання з локальним сервером через сокет домену UNIX или адрес 127.0.0.1 для з\'єднання через TCP. Для SQLite задайте повний шлях до файлу бази даних.',
	'DB_NAME'					=> 'Назва бази даних',
	'DB_PASSWORD'				=> 'Пароль до БД',
	'DB_PORT'					=> 'Порт сервера БД',
	'DB_PORT_EXPLAIN'			=> 'Залиште поле порожнім, якщо сервер використовує порт за замовчуванням.',
	'DB_UPDATE_NOT_SUPPORTED'	=> 'На жаль, даний сценарій не підтримує оновлення з версій phpBB до «%1$s». Встановлена ​​вами версія — «%2$s». Оновлення попередню версію перед виконанням цього сценарію. Допомога з цієї проблеми можна знайти на форумах підтримки на сайті phpBB.com.',
	'DB_USERNAME'				=> 'Ім\'я користувача БД',
	'DB_TEST'					=> 'Перевірка підключення',
	'DEFAULT_LANG'				=> 'Мова конференції за замовчуванням',
	'DEFAULT_PREFIX_IS'			=> 'Конвертеру не вдалося знайти таблиці phpBB2 із зазначеним префіксом. Переконайтеся, що ви ввели правильні дані про стару конференції. У таблиць конференції %1$s префікс <strong>%2$s</strong>.',
	'DEV_NO_TEST_FILE'			=> 'У конвертері не вказано значення змінної test_file. Якщо ви користувач цього конвертера, то повідомте про цю помилку його автору, оскільки вона не повинна виникати. Якщо ви автор конвертера, то ви повинні задати ім\'я існуючого файлу конвертованій конференції для перевірки правильності шляху до неї.',
	'DIRECTORIES_AND_FILES'		=> 'Налаштування папок і файлів',
	'DISABLE_KEYS'				=> 'Відключення ключів',
	'DLL_FIREBIRD'				=> 'Firebird',
	'DLL_FTP'					=> 'Підтримка віддаленого FTP [ встановлення ]',
	'DLL_GD'					=> 'Підтримка графічної бібліотеки GD [ візуальне підтвердження ]',
	'DLL_MBSTRING'				=> 'Підтримка мультибайтних символів',
	'DLL_MSSQL'					=> 'MSSQL Server 2000+',
	'DLL_MSSQL_ODBC'			=> 'MSSQL Server 2000+ через ODBC',
	'DLL_MSSQLNATIVE'			=> 'MSSQL Server 2005+ [ Native ]',
	'DLL_MYSQL'					=> 'MySQL',
	'DLL_MYSQLI'				=> 'MySQL з розширенням MySQLi',
	'DLL_ORACLE'				=> 'Oracle',
	'DLL_POSTGRES'				=> 'PostgreSQL',
	'DLL_SQLITE'				=> 'SQLite',
	'DLL_XML'					=> 'Підтримка XML [ Jabber ]',
	'DLL_ZLIB'					=> 'Підтримка стиснення zlib [ gz, .tar.gz, .zip ]',
	'DL_CONFIG'					=> 'Завантажити файл конфігурації',
	'DL_CONFIG_EXPLAIN'			=> 'Ви можете цілком завантажити файл config.php до себе на комп\'ютер. Потім вам буде потрібно вручну закачати цей файл в кореневу папку phpBB 3.1, замінивши вихідний config.php. Пам\'ятайте, що файл повинен бути закачаний на сервер у форматі ASCII (якщо ви не знаєте як цього домогтися, зверніться до документації вашого FTP-клієнта). Після того, як закачаєте config.php, клацніть «Готово» для переходу до наступного кроку.',
	'DL_DOWNLOAD'				=> 'Завантажити',
	'DONE'						=> 'Готово',

	'ENABLE_KEYS'				=> 'Відновлення ключів. Ця дія може зайняти деякий час.',

	'FILES_OPTIONAL'			=> 'Необов\'язкові файли і папки',
	'FILES_OPTIONAL_EXPLAIN'	=> 'Наступні файли, папки або права доступу <strong>не є обов\'язковими</strong>. Програма установки спробує використовувати різні методи для їх створення, якщо вони не існують або якщо для них немає прав на запис. Проте їх наявність прискорить процес встановлення',
	'FILES_REQUIRED'			=> 'Файли та папки',
	'FILES_REQUIRED_EXPLAIN'	=> 'Для правильної роботи phpBB <strong>необхідний</strong> доступ на читання або запис певних файлів і папок. Якщо ви побачите напис «Не знайдено», то необхідно створити відповідний файл або папку. А якщо побачите напис «Немає прав на запис», то необхідно змінити права на файл або на папку, щоб дозволити phpBB запис в них.',
	'FILLING_TABLE'				=> 'Заповнення таблиці <strong>%s</strong>',
	'FILLING_TABLES'			=> 'Заповнення таблиць',

	'FIREBIRD_DBMS_UPDATE_REQUIRED'		=> 'phpBB більше не підтримує Firebird/Interbase до версії 2.1. Перед продовженням процесу оновлення поновіть Firebird, принаймні, до версії 2.1.0.',

	'FINAL_STEP'				=> 'Заключний етап',
	'FORUM_ADDRESS'				=> 'Адрес конференції',
	'FORUM_ADDRESS_EXPLAIN'		=> 'URL старої конференції, наприклад, <samp>http://www.example.com/phpBB2/</samp>. Якщо ви заповните це поле, то у всіх повідомленнях, ПП і підписах цю адресу буде замінений на адресу нової конференції.',
	'FORUM_PATH'				=> 'Шлях до конференції',
	'FORUM_PATH_EXPLAIN'		=> '<strong>Відносний</strong> шлях до старої конференції від <strong>кореневої папки встановленого phpBB3</strong>.',
	'FOUND'						=> 'Знайдений',
	'FTP_CONFIG'				=> 'Перенести файл конфігурації по FTP',
	'FTP_CONFIG_EXPLAIN'		=> 'Виявлено наявність модуля FTP на сервері. Ви можете спробувати встановити файл config.php за допомогою цього модуля. Вам знадобиться ввести наступні дані,. Пам\'ятайте, що ці ім\'я користувача і пароль відносяться до вашого сервера! Якщо ви не знаєте їх, то зверніться за допомогою до свого хостинг-провайдера.',
	'FTP_PATH'					=> 'Шлях FTP',
	'FTP_PATH_EXPLAIN'			=> 'Шлях від кореневої папки FTP до кореневої папки phpBB, наприклад, <samp>htdocs/phpBB3/</samp>',
	'FTP_UPLOAD'				=> 'Закачати',

	'GPL'						=> 'General Public License',

	'INITIAL_CONFIG'			=> 'Базова конфігурація',
	'INITIAL_CONFIG_EXPLAIN'	=> 'Ппрограма встановлення визначила, що phpBB може працювати на вашому сервері, і тепер вам необхідно ввести деякі дані. Якщо ви не знаєте, як підключитися до вашої базі даних, то зв\'яжіться зі своїм провайдером (у першу чергу) або зверніться за допомогою на наші форуми підтримки. Після введення даних ретельно перевірте їх перед відправкою.',
	'INSTALL_CONGRATS'			=> 'Вітаємо!',
	'INSTALL_CONGRATS_EXPLAIN'	=> '
		<p>Ви успішно встановили phpBB %1$s. Тепер ви можете вирішити, що робити далі з тільки що встановленим phpBB3:</p>
		<h2>Зконвертувати наявну конференцію в phpBB3</h2>
		<p>Єдина система конвертації phpBB підтримує конвертування з phpBB 2.0.x та інших типів конференцій в phpBB3. Якщо у вас є конференція, яку ви бажаєте зконвертувати, то <a href="%2$s">перейдіть в систему конвертації</a>.</p>
		<h2>Почати використання phpBB3!</h2>
		<p>Натиснувши на кнопку нижче, ви потрапите на сторінку відправки статистичних даних phpBB в адміністраторському розділі (ACP). Ми будемо вам дуже вдячні, якщо ви допоможете нам, відправивши трохи статистичної інформації про вашому сервері і конфігурації phpBB. На основі цієї інформації ми будемо приймати рішення про функціональність майбутнього phpBB. Потім ознайомтеся з наявними пунктами меню і настройками адміністраторського розділу. Освоєння наявних можливостей phpBB3 може зайняти деякий час. Пам\'ятайте про доступну в інтернеті <a href="https://www.phpbb.com/support/documentation/3.0/">документації</a>, <a href="%3$s">вбудованому файлі README</a> и <a href="https://www.phpbb.com/community/viewforum.php?f=46">форумі підтримки</a> (англійською), а також на форумі української підтримки <a href="http://phpbbukraine.net">phpBB Ukraine</a>.</p><p><strong>Видаліть, перемістіть або перейменуйте папку «install» перед використанням конференції. В іншому випадку буде доступна тільки Панель адміністратора</strong>',
	'INSTALL_INTRO'				=> 'Вас вітає програма встановлення phpBB',

	'INSTALL_INTRO_BODY'		=> 'За допомогою цієї програми встановлення ви зможете встановити phpBB3 на сервер.</p><p>Для цього вам необхідно знати реквізити доступу до бази даних. Якщо ви не знаєте їх, то зв\'яжіться з компанією, що надає вам послуги хостингу, і дізнайтеся їх у неї. Ви не зможете продовжити установку без цих даних. Також вам потрібно знати наступне:</p>

	<ul>
		<li>Тип бази даних (БД) — тієї, яку ви будете використовувати.</li>
		<li>Ім\'я сервера БД або DSN — адреса сервера бази даних.</li>
		<li>Порт сервера БД — порт сервера бази даних (не потрібно вказувати у більшості випадків).</li>
		<li>Назва бази даних - ім\'я бази даних на сервере.</li>
		<li>Ім\'я користувача БД і Пароль до БД - дані для доступу до бази даних.</li>
	</ul>

	<p><strong>Примітка:</strong> якщо ви виконуєте установку з використанням SQLite, то вам необхідно ввести повний шлях до файлу бази даних в полі «Ім\'я сервера бази даних або DSN» і залишити порожніми поля імені користувача та пароля. З міркувань безпеки, вам необхідно упевнитися в тому, що цей файл недоступний через інтернет.</p>

	<p>phpBB3 підтримує наступні бази даних:</p>
	<ul>
		<li>MySQL 3.23 і вище (підтримується MySQLi)</li>
		<li>PostgreSQL 8.3 і вище</li>
		<li>SQLite 2.8.2 і вище</li>
		<li>Firebird 2.1 і вище</li>
		<li>MS SQL Server 2000 і вище (безпосередньо або через ODBC)</li>
		<li>MS SQL Server 2005 і вище (native)</li>
		<li>Oracle</li>
	</ul>

	<p>У списку вибору типу бази даних будуть відображатися лише ті, які підтримує ваш сервер.',
	'INSTALL_INTRO_NEXT'		=> 'Натисніть кнопку нижче, щоб почати установку.',
	'INSTALL_LOGIN'				=> 'Вхід',
	'INSTALL_NEXT'				=> 'Наступний етап',
	'INSTALL_NEXT_FAIL'			=> 'Частина перевірок завершилася невдало. Вам необхідно виправити знайдені проблеми перед переходом до наступного етапу. В іншому випадку установка конференції буде незакінченою.',
	'INSTALL_NEXT_PASS'			=> 'Всі основні перевірки пройдені, і ви можете перейти до наступного етапу установки. Якщо ви змінили будь-які права, модулі, і т. п., то ви можете повторно пройти перевірки, натиснувши відповідну кнопку.',
	'INSTALL_PANEL'				=> 'Встановлення phpBB',
	'INSTALL_SEND_CONFIG'		=> 'На жаль, не вдалося записати конфігурацію phpBB безпосередньо у файл config.php. Можливо, файл не існує, або відсутні права на запис. Нижче представлений список варіантів, що дозволяють завершити встановлення config.php.',
	'INSTALL_START'				=> 'Почати встановлення',
	'INSTALL_TEST'				=> 'Повторна перевірка',
	'INST_ERR'					=> 'Помилка при встановленні',
	'INST_ERR_DB_CONNECT'		=> 'Не вдалося підключитися до бази даних. Нижче показаний текст повідомлення про помилку.',
	'INST_ERR_DB_FORUM_PATH'	=> 'Зазначений файл бази даних знаходиться в папці конференції. Необхідно перемістити його в папку, недоступну з інтернету.',
	'INST_ERR_DB_INVALID_PREFIX'=> 'Вказано неправильну префікс. Він повинен починатися з літери і може містити тільки букви, числа і знаки підкреслення.',
	'INST_ERR_DB_NO_ERROR'		=> 'Немає повідомлення про помилку.',
	'INST_ERR_DB_NO_MYSQLI'		=> 'Встановлена ​​на сервері версія MySQL несумісна з обраним варіантом «MySQL з розширенням MySQLi». Замість нього спробуйте вибрати варіант «MySQL».',
	'INST_ERR_DB_NO_SQLITE'		=> 'У вас встановлена ​​застаріла версія розширення SQLite. Її необхідно оновити хоча б до версії 2.8.2.',
	'INST_ERR_DB_NO_ORACLE'		=> 'Для встановленої на сервері версії Oracle необхідно встановити значення параметра <var>NLS_CHARACTERSET</var> м <var>UTF8</var>. Або поновіть базу даних до версії 9.2 або вище, або змініть значення параметра.',
	'INST_ERR_DB_NO_FIREBIRD'	=> 'Встановлена ​​на сервері версія Firebird старіше 2.1. Поновити базу даних до нової версії.',
	'INST_ERR_DB_NO_FIREBIRD_PS'=> 'Обрана база даних Firebird має розмір сторінки менше 8192. Розмір сторінки повинен бути не менше 8192.',
	'INST_ERR_DB_NO_POSTGRES'	=> 'Обрана база даних створена не з кодуванням <var>UNICODE</var> або <var>UTF8</var>.Спробуйте встановити конференцію в базу даних з кодуванням <var>UNICODE</var> або <var>UTF8</var>.',
	'INST_ERR_DB_NO_NAME'		=> 'Не вказано назву бази даних.',
	'INST_ERR_EMAIL_INVALID'	=> 'Введений адресу email недопустимий.',
	'INST_ERR_EMAIL_MISMATCH'	=> 'Введені адреси email не збігаються.',
	'INST_ERR_FATAL'			=> 'Критична помилка при встановленні',
	'INST_ERR_FATAL_DB'			=> 'Сталася критична помилка при роботі з базою даних. встановлення перервана. Причиною може бути відсутність необхідних прав на виконання операцій створення і додавання даних (<code>CREATE TABLES</code>, <code>INSERT</code> або аналогічних). Більш детальна інформація надана нижче. Зв\'яжіться зі своїм провайдером або зверніться на форуми підтримки phpBB за додатковою інформацією.',
	'INST_ERR_FTP_PATH'			=> 'Не вдалося перейти в задану папку. Переконайтеся в правильності відносного шляху.',
	'INST_ERR_FTP_LOGIN'		=> 'Не вдалося увійти на FTP-сервер. Перевірте правильність введення імені користувача та пароля.',
	'INST_ERR_MISSING_DATA'		=> 'На цій сторінці необхідно заповнити всі поля.',
	'INST_ERR_NO_DB'			=> 'Не вдалося завантажити модуль PHP для обраного типу бази даних.',
	'INST_ERR_PASSWORD_MISMATCH'	=> 'Введені паролі не збігаються.',
	'INST_ERR_PASSWORD_TOO_LONG'	=> 'Введений пароль занадто довгий. Довжина пароля не повинна перевищувати 30 символів.',
	'INST_ERR_PASSWORD_TOO_SHORT'	=> 'Введений пароль занадто короткий. Мінімальна довжина пароля - 6 символів.',
	'INST_ERR_PREFIX'			=> 'Таблиці із зазначеним префіксом вже існують. Введіть інший префікс.',
	'INST_ERR_PREFIX_INVALID'	=> 'Зазначений префікс недопустимий для вашої бази даних. Введіть інший префікс без спеціальних символів типу дефіса.',
	'INST_ERR_PREFIX_TOO_LONG'	=> 'Зазначений префікс таблиць занадто довгий. Довжина префікса не повинна перевищувати %d символів.',
	'INST_ERR_USER_TOO_LONG'	=> 'Введене ім\'я користувача занадто довге. Довжина імені користувача не повинна перевищувати 20 символів.',
	'INST_ERR_USER_TOO_SHORT'	=> 'Введене ім\'я користувача занадто коротке. Мінімальна довжина імені користувача - 3 знаки.',
	'INVALID_PRIMARY_KEY'		=> 'Недопустимий первинний ключ: %s',

	'LONG_SCRIPT_EXECUTION'		=> 'Виконання може зайняти деякий час ... Будь ласка, не зупиняйте процес.',

	// mbstring
	'MBSTRING_CHECK'						=> 'Перевірка розширення <samp>mbstring</samp>',
	'MBSTRING_CHECK_EXPLAIN'				=> '<strong>Необхідно</strong>. <samp>mbstring</samp> — це розширення PHP, що забезпечує роботу багатобайтові строкових функцій. Деякі можливості mbstring несумісні з phpBB і повинні бути відключені.',
	'MBSTRING_FUNC_OVERLOAD'				=> 'Перевантаження функції',
	'MBSTRING_FUNC_OVERLOAD_EXPLAIN'		=> 'Значення <var>mbstring.func_overload</var> має бути встановлено в 0 або в 4.',
	'MBSTRING_ENCODING_TRANSLATION'			=> 'Прозоре кодування символів',
	'MBSTRING_ENCODING_TRANSLATION_EXPLAIN'	=> 'Значення <var>mbstring.encoding_translation</var> с в 0.',
	'MBSTRING_HTTP_INPUT'					=> 'Кодування вхідних символів',
	'MBSTRING_HTTP_INPUT_EXPLAIN'			=> 'Значення <var>mbstring.http_input</var> має бути встановлено в <samp>pass</samp>.',
	'MBSTRING_HTTP_OUTPUT'					=> 'Кодування вихідних символів',
	'MBSTRING_HTTP_OUTPUT_EXPLAIN'			=> 'Значення <var>mbstring.http_output</var> м в <samp>pass</samp>.',

	'MAKE_FOLDER_WRITABLE'		=> 'Переконайтеся, що ця папка існує і у сервера є права на запис у неї, потім повторіть спробу:<br />»<strong>%s</strong>.',
	'MAKE_FOLDERS_WRITABLE'		=> 'Переконайтеся, що ці папки існують і у сервера є права на запис у них, потім повторіть спробу:<br />»<strong>%s</strong>.',

	'MYSQL_SCHEMA_UPDATE_REQUIRED'	=> 'Схема вашої бази даних MySQL застаріла. phpBB виявив, що використовується схема для MySQL 3.x/4.x, але сервер працює на MySQL %2$s.<br /><strong>Перед початком процесу оновлення вам необхідно провести оновлення схеми бази даних. </strong><br /><br />Прочитайте в базі знань <a href="https://www.phpbb.com/kb/article/doesnt-have-a-default-value-errors/">статтю про оновлення бази даних MySQL</a>. При виникненні проблем звертайтеся на <a href="http://www.phpbbukraine.net/">форуми української підтримки phpBB</a>.',

	'NAMING_CONFLICT'			=> 'Конфлікт імен: обидва імені %s и %s є псевдонімами<br /><br />%s',
	'NEXT_STEP'					=> 'Наступний крок',
	'NOT_FOUND'					=> 'Не знайден',
	'NOT_UNDERSTAND'			=> 'Не вдалося розібрати вираз %s #%d, таблица %s («%s»)',
	'NO_CONVERTORS'				=> 'Немає доступних для використання конвертерів.',
	'NO_CONVERT_SPECIFIED'		=> 'Не вибрано конвертер.',
	'NO_LOCATION'				=> 'Не вдалося знайти додаток. Якщо ви знаєте, що Imagemagick встановлений, то ви можете вказати шлях до нього після встановлення конференції в Панелі адміністратора.',
	'NO_TABLES_FOUND'			=> 'Таблиць не знайдено.',

	'OVERVIEW_BODY'					=> 'Ласкаво просимо в phpBB3!<br /><br />phpBB® є найбільш поширеним рішенням з відкритим кодом для організації конференцій в інтернеті. phpBB3 є новітнім продуктом в лінійці починаючи з 2000 року. Як і його попередники, phpBB3 є функціональним, має дружній інтерфейс і повністю підтримується phpBB Team. У phpBB3 істотно поліпшені якості, які зробили популярним phpBB2, додані найбільш необхідні функції, які були відсутні в попередніх версіях. Сподіваємося, що це перевершить ваші очікування.<br /><br />Ця система проведе вас через процеси встановлення phpBB3, поновлення попередніх релізів до останньої версії phpBB3, а також конвертації в phpBB3 іншого програмного забезпечення для конференцій (включаючи phpBB2). Для отримання додаткової інформації ми пропонуємо вам ознайомитися з <a href="../docs/INSTALL.html">керівництвом по встановленню</a>.<br /><br />Щоб ознайомитися з ліцензійними умовами phpBB3 або дізнатись про підтримку, виберіть відповідний пункт у бічному меню. Для продовження виберіть потрібну закладку вище.',

	'PCRE_UTF_SUPPORT'				=> 'Підтримка UTF-8 в PCRE',
	'PCRE_UTF_SUPPORT_EXPLAIN'		=> 'phpBB <strong>не буде</strong> працювати, якщо PHP зібраний без підтримки UTF-8 для розширення PCRE.',
	'PHP_GETIMAGESIZE_SUPPORT'			=> 'Функція PHP <var>getimagesize()</var> доступна',
	'PHP_GETIMAGESIZE_SUPPORT_EXPLAIN'	=> '<strong>Необхідна</strong>. Для правильної роботи phpBB необхідно наявність функції getimagesize.',
	'PHP_JSON_SUPPORT'        		=> 'Підтримка PHP JSON',
	'PHP_JSON_SUPPORT_EXPLAIN'    	=> '<strong>Необхідна</strong>. Для правильної роботи phpBB необхідно наявність розширення PHP JSON.',
	'PHP_OPTIONAL_MODULE'			=> 'Необов\'язкові модулі',
	'PHP_OPTIONAL_MODULE_EXPLAIN'	=> 'Ці модулі та програми <strong>не є обов\'язковими</strong>. Проте вони надають розширені можливості майбутньої конференції.',
	'PHP_SUPPORTED_DB'				=> 'Підтримувані бази даних',
	'PHP_SUPPORTED_DB_EXPLAIN'		=> 'Ваша версія PHP повинна підтримувати <strong>не менше однієї</strong> з перерахованих нижче баз даних. Якщо в списку не виявиться підтримуваних баз, то зв\'яжіться зі своїм провайдером або зверніться до відповідного розділу документації PHP.',
	'PHP_REGISTER_GLOBALS'			=> 'Параметр PHP <var>register_globals</var> відключений',
	'PHP_REGISTER_GLOBALS_EXPLAIN'	=> 'phpBB буде працювати, навіть якщо параметр register_globals включений. Але, по можливості, його рекомендується відключити з міркувань безпеки.',
	'PHP_SAFE_MODE'					=> 'Безпечний режим (Safe mode)',
	'PHP_SETTINGS'					=> 'Версія і налаштування PHP',
	'PHP_SETTINGS_EXPLAIN'			=> 'Для встановлення phpBB <strong>потрібна<strong> версія PHP не нижче 5.3.3. Якщо нижче написанийо <var>Безпечний режим (Safe mode)</var>, то PHP працює в цьому режимі. Це накладе деякі обмеження на віддалене адміністрування та аналогічні функції.',
	'PHP_URL_FOPEN_SUPPORT'			=> 'Параметр PHP <var>allow_url_fopen</var> включений',
	'PHP_URL_FOPEN_SUPPORT_EXPLAIN'	=> '<strong>Необов\'язково</strong>. Хоча цей параметр не є обов\'язковим, деякі функції phpBB, типу зовнішніх аватар, не працюватимуть належним чином. ',
	'PHP_VERSION_REQD'				=> 'Версія PHP ≥ 5.3.3',
	'POST_ID'						=> 'Ідентифікатор повідомлення',
	'PREFIX_FOUND'					=> 'Перегляд ваших таблиць показав наявність підходящої конференції з префіксом таблиць <strong>%s</strong>.',
	'PREPROCESS_STEP'				=> 'Виконання попередніх функцій/запитів',
	'PRE_CONVERT_COMPLETE'			=> 'Всі етапи підготовки до конвертування успішно завершені. Тепер ви можете почати процес конвертування. Врахуйте, що вам, можливо, доведеться вручну зробити деякі дії і налаштування. Після конвертації обов\'язково перевірте призначені права доступу, відновіть пошуковий індекс, який не підлягав конвертуванню, якщо необхідно, а також переконайтеся, що всі файли були успішно скопійовані (наприклад, аватари і смайлики).',
	'PROCESS_LAST'					=> 'Виконання заключних операцій',

	'REFRESH_PAGE'				=> 'Оновлювати сторінку для продовження конвертування',
	'REFRESH_PAGE_EXPLAIN'		=> '«Так» означає, що конвертер буде автоматично перезавантажувати сторінку, щоб продовжити конвертування після завершення чергового етапу. Якщо це ваша перша конвертація з метою тестування і перевірки на помилки, ми радимо встановити значення цього параметра в «Ні».',
	'REQUIREMENTS_TITLE'		=> 'Програмна сумісність',
	'REQUIREMENTS_EXPLAIN'		=> 'Перед встановленням phpBB3 будуть проведені перевірки файлів і конфігурації сервера, щоб упевнитися в тому, що phpBB3 можна встановити і запустити. Уважно ознайомтеся з результатами і не переходьте до наступного кроку встановлення до тих пір, поки необхідні перевірки не будуть пройдені. Якщо вам потрібні які-небудь з додаткових можливостей конференції, переконайтеся, що відповідні їм тести також успішно пройдені.',
	'RETRY_WRITE'				=> 'Повторити спробу запису конфігурації',
	'RETRY_WRITE_EXPLAIN'		=> 'При бажанні ви можете змінити права на файл config.php, щоб дозволити phpBB запис в нього. У цьому випадку натисніть на кнопку «Повторити» нижче». Не забудьте повернути права на файл config.php після завершення встановлення.',

	'SCRIPT_PATH'				=> 'Шлях до конференції',
	'SCRIPT_PATH_EXPLAIN'		=> 'Шлях до папки, яка містить phpBB, відносно кореня сайту. Наприклад, <samp>/phpBB3</samp>.',
	'SELECT_LANG'				=> 'Виберіть мову',
	'SERVER_CONFIG'				=> 'Конфігурація сервера',
	'SEARCH_INDEX_UNCONVERTED'	=> 'Пошуковий індекс не був сконвертовані',
	'SEARCH_INDEX_UNCONVERTED_EXPLAIN'	=> 'Ваш старий пошуковий індекс ні сконвертовані. Будь пошуковий запит поверне порожній результат. Щоб створити новий пошуковий індекс, перейдіть в Панель адміністратора, виберіть підрозділ «Обслуговування» і в ньому пункт «Пошуковий індекс».',
	'SELECT_FORUM_GA'			=> 'У phpBB 3.1 важливі теми прив\'язані до форумів. Виберіть форум для даної важливої ​​теми (тема може бути перенесена на інший форум пізніше):',
	'SOFTWARE'					=> 'Тип конференції',
	'SPECIFY_OPTIONS'			=> 'Визначення установок конвертації',
	'STAGE_ADMINISTRATOR'		=> 'Відомості про адміністратора',
	'STAGE_ADVANCED'			=> 'Додаткові параметри',
	'STAGE_ADVANCED_EXPLAIN'	=> 'Змінювати параметри на цій сторінці необхідно лише в тому випадку, якщо ви знаєте, що вам не підійдуть налаштування за замовчуванням. Якщо ви не впевнені, то пропустіть цю сторінку і сміливо переходьте до наступного етапу установки - всі ці налаштування можна буде змінити пізніше в Панелі адміністратора.',
	'STAGE_CONFIG_FILE'			=> 'Файл конфігурації',
	'STAGE_CREATE_TABLE'		=> 'Створення таблиць бази даних',
	'STAGE_CREATE_TABLE_EXPLAIN'	=> 'Таблиці бази даних phpBB 3.1 створені і заповнені початковими даними. Перейдіть до наступного етапу для завершення встановлення phpBB.',
	'STAGE_DATABASE'			=> 'Налаштування бази даних',
	'STAGE_FINAL'				=> 'Заключний етап',
	'STAGE_INTRO'				=> 'Введення',
	'STAGE_IN_PROGRESS'			=> 'Конвертація',
	'STAGE_REQUIREMENTS'		=> 'Вимоги',
	'STAGE_SETTINGS'			=> 'Параметри',
	'STARTING_CONVERT'			=> 'Початок конвертації',
	'STEP_PERCENT_COMPLETED'	=> 'Етап <strong>%d</strong> із <strong>%d</strong>',
	'SUB_INTRO'					=> 'Введення',
	'SUB_LICENSE'				=> 'Ліцензія',
	'SUB_SUPPORT'				=> 'Підтримка',
	'SUCCESSFUL_CONNECT'		=> 'Успішне підключення',
	'SUPPORT_BODY'				=> 'Повна підтримка надається для останнього стабільного релізу phpBB3 безкоштовно. Вона включає:</p><ul><li>встановлення</li><li>конфігурацію</li><li>технічні питання</li><li>проблеми, пов\'язані з потенційними помилками програмного забезпечення</li><li>оновлення версій - кандидатів на реліз (RC) до останньої стабільної версії</li><li>конвертування phpBB 2.0.x в phpBB3</li><li>конвертація в phpBB3 іншого програмного забезпечення для конференцій (дивіться <a href="https://www.phpbb.com/community/viewforum.php?f=65">Convertors Forum</a>)</li></ul><p>Ми пропонуємо користувачам, досі використовують бета-версії phpBB3, заново встановити останню версію. </p><h2>МОДи/Стилі</h2><p>Питання, пов\'язані з модами, обговорюються у відповідному форумі <a href="https://www.phpbb.com/community/viewforum.php?f=81">Modifications Forum</a>.<br />Питання, пов\'язані зі стилями, обговорюються у відповідному форумі <a href="https://www.phpbb.com/community/viewforum.php?f=80">Styles Forum</a>.<br /><br />Якщо ваше питання пов\'язаний з конкретним продуктом, задавайте його в темі, присвяченій цьому продукту.</p><h2>Отримання підтримки</h2><p><a href="https://www.phpbb.com/community/viewtopic.php?f=14&amp;t=571070">З чого почати</a><br /><a href="https://www.phpbb.com/support/">Підтримка</a><br /><a href="https://www.phpbb.com/support/documentation/3.0/quickstart/">Короткий посібник</a><br /><br />Щоб бути в курсі останніх новин і релізів, ви можете підписатися на <a href="https://www.phpbb.com/support/">нашу розсилку</a><br /> Якщо Вам потрібна підтримка, то ви можете написати на <a href="http://www.phpbbukraine.net/">Форум української підтримки phpBB</a>.<br /><br />',
	'SYNC_FORUMS'				=> 'Синхронізація форумів',
	'SYNC_POST_COUNT'			=> 'Синхронізація кількості повідомлень',
	'SYNC_POST_COUNT_ID'		=> 'Синхронізація кількості повідомлень з <var>entry</var> от %1$s до %2$s',
	'SYNC_TOPICS'				=> 'Синхронізація тем',
	'SYNC_TOPIC_ID'				=> 'Синхронізація тем з <var>topic_id</var> від %1$s до %2$s.',

	'TABLES_MISSING'			=> 'Не вдалося знайти таблиці<br />» <strong>%s</strong>.',
	'TABLE_PREFIX'				=> 'Префікс для таблиць в базі даних',
	'TABLE_PREFIX_EXPLAIN'		=> 'Префікс повинен починатися з літери і може містити тільки букви, числа і знаки підкреслення.',
	'TABLE_PREFIX_SAME'			=> 'Префікс таблиць повинен бути тим же, який використовується конвертованій конференцією.<br />» Зазначений префікс — %s.',
	'TESTS_PASSED'				=> 'Перевірки пройдені',
	'TESTS_FAILED'				=> 'Перевірки не пройдено',

	'UNABLE_WRITE_LOCK'			=> 'Не вдалося записати файл блокування.',
	'UNAVAILABLE'				=> 'Недоступно',
	'UNWRITABLE'				=> 'немає прав на запис',
	'UPDATE_TOPICS_POSTED'		=> 'Створення списку тим, в яких писав користувач',
	'UPDATE_TOPICS_POSTED_ERR'	=> 'Сталася помилка при створення списку тим, в яких писав користувач. Ви можете повторити спробу виконати цей етап у Панелі адміністратора після завершення процесу перетворення.',
	'VERIFY_OPTIONS'			=> 'Перевірка налаштувань конвертації',
	'VERSION'					=> 'Версія',

	'WELCOME_INSTALL'			=> 'Вас вітає програма встановлення phpBB3.',
	'WRITABLE'					=> 'допускає запис',
));

// Updater
$lang = array_merge($lang, array(
	'ALL_FILES_UP_TO_DATE'		=> 'Всі файли відповідають самій останній версії phpBB.',
	'ARCHIVE_FILE'				=> 'Файл-джерело в архіві',

	'BACK'				=> 'Назад',
	'BINARY_FILE'		=> 'Бінарний файл',
	'BOT'				=> 'Павук/Робот',

	'CHANGE_CLEAN_NAMES'			=> 'Метод, використовуваний для перевірки на використання одного і того ж імені декількома користувачами, був змінений. Є декілька користувачів, що мають одне і те ж ім\'я при порівнянні новим методом. Для продовження необхідно видалити або перейменувати цих користувачів, щоб упевнитися, що кожне ім\'я використовується тільки одним користувачем.',
	'CHECK_FILES'					=> 'Порівняти файли',
	'CHECK_FILES_AGAIN'				=> 'Повторно порівняти файли',
	'CHECK_FILES_EXPLAIN'			=> 'На наступному етапі всі файли будуть порівняні з файлами оновлення. Ця дія може зайняти деякий час, якщо порівняння файлів проводиться вперше.',
	'CHECK_FILES_UP_TO_DATE'		=> 'Згідно інформації, що знаходиться в базі даних, ваша версія phpBB найновіша. Ви можете приступити до порівняння файлів, щоб переконатися в тому, що всі файли дійсно відповідають самій останній версії phpBB.',
	'CHECK_UPDATE_DATABASE'			=> 'Продовжити оновлення',
	'COLLECTED_INFORMATION'			=> 'Відомості про файли',
	'COLLECTED_INFORMATION_EXPLAIN'	=> 'Список нижче демонструє відомості про файли, що потребують оновлення. Прочитайте інформацію, що передує блоку файлів кожного типу, щоб зрозуміти їх зміст і що потрібно зробити для виконання успішного оновлення.',
	'COLLECTING_FILE_DIFFS'			=> 'Перевірка відмінностей у файлах',
	'COMPLETE_LOGIN_TO_BOARD'		=> '<a href="../ucp.php?mode=login">Увійдіть на конференцію</a> і перевірте, що все працює нормально. Не забудьте видалити, перейменувати або перемістити папку install!',
	'CONTINUE_UPDATE_NOW'			=> 'Продовжуйте процес оновлення',		// Shown within the database update script at the end if called from the updater
	'CONTINUE_UPDATE'				=> 'Продовжуйте оновлення',				// Shown after file upload to indicate the update process is not yet finished
	'CURRENT_FILE'					=> 'Початок конфлікту - код вихідного файлу до поновлення',
	'CURRENT_VERSION'				=> 'Поточна версія',

	'DATABASE_TYPE'						=> 'Тип бази даних',
	'DATABASE_UPDATE_COMPLETE'			=> 'База даних оновлена!',
	'DATABASE_UPDATE_CONTINUE'			=> 'Продовжити оновлення бази даних.',
	'DATABASE_UPDATE_INFO_OLD'			=> 'Файл оновлення бази даних в папці install застарів. Переконайтеся, що закачали справну версію цього файлу.',
	'DATABASE_UPDATE_NOT_COMPLETED'		=> 'Оновлення бази даних ще не завершено.',
	'DELETE_USER_REMOVE'				=> 'Видалити користувача та його повідомлення',
	'DELETE_USER_RETAIN'				=> 'Видалити користувача, але залишити його повідомлення',
	'DESTINATION'						=> 'Файл-получатель',
	'DIFF_INLINE'						=> 'Усередині тексту',
	'DIFF_RAW'							=> 'Код об\'єднаних відмінностей',
	'DIFF_SEP_EXPLAIN'					=> 'Код, що використовується в оновленому файлі',
	'DIFF_SIDE_BY_SIDE'					=> 'Паралельно',
	'DIFF_UNIFIED'						=> 'Об\'єднані відмінності',
	'DO_NOT_UPDATE'						=> 'Не оновлювати цей файл',
	'DONE'								=> 'Готово',
	'DOWNLOAD'							=> 'Завантажити',
	'DOWNLOAD_AS'						=> 'Завантажити в форматі',
	'DOWNLOAD_UPDATE_METHOD_BUTTON'		=> 'Завантажити архів з модифікованими файлами (рекомендовано)',
	'DOWNLOAD_CONFLICTS'				=> 'Завантажити конфліктні місця для цього файлу',
	'DOWNLOAD_CONFLICTS_EXPLAIN'		=> 'Шукати &lt;&lt;&lt; для виявлення конфліктів',
	'DOWNLOAD_UPDATE_METHOD'			=> 'Завантажити архів з модифікованими файлами',
	'DOWNLOAD_UPDATE_METHOD_EXPLAIN'	=> 'Завантаживши архів, розпакуйте його. У ньому ви знайдете змінені файли, які потрібно закачати в корінь phpBB, при цьому кожен файл повинен виявитися у відповідній йому папці. Після цього знову проведіть порівняння файлів, натиснувши відповідальну за це кнопку нижче.',

	'EDIT_USERNAME'	=> 'Змінити ім\'я користувача',
	'ERROR'			=> 'Помилка',
	'EVERYTHING_UP_TO_DATE'    => 'Все оновлено до самої останньої версії phpBB. Тепер <a href="%1$s">Увійдіть на конференцію</a> і перевірте, що все працює нормально. Не забудьте видалити, перейменувати або перемістити папку «install»! Будь ласка, відправте нам оновлену інформацію про вашому сервері і конфігурації конференції за допомогою сторінки <a href="%2$s">Статистичні дані</a> в Панелі адміністратора.',

	'FILE_ALREADY_UP_TO_DATE'		=> 'Файл вже відповідає новій версії.',
	'FILE_DIFF_NOT_ALLOWED'			=> 'Немає прав на виконання команди diff для цього файлу.',
	'FILE_USED'						=> 'Інформація з файлу',			// Single file
	'FILES_CONFLICT'				=> 'Конфліктуючі файли',
	'FILES_CONFLICT_EXPLAIN'		=> 'Наступні файли модифіковані і не відповідають оригінальним файлам старої версії. phpBB визначив, що ці файли будуть створювати конфлікт при об\'єднанні їх з новими версіями. Вивчіть конфліктні місця і спробуйте виправити їх вручну, або продовжите оновлення, вибравши відповідний тип об\'єднання файлів. Якщо ви будете вирішувати конфлікти вручну, то знову проведіть порівняння файлів після внесення до них змін. Для кожного файлу окремо ви можете вибрати кращий метод об\'єднання з новою версією. Результатом роботи першого методу буде файл, в якому відкинуті конфліктуючі рядки зі свого старого файлу, у другому методі будуть відкинуті конфліктуючі рядки з нової версії.',
	'FILES_MODIFIED'				=> 'Змінені файли',
	'FILES_MODIFIED_EXPLAIN'		=> 'Наступні файли модифіковані і не відповідають оригінальним файлам старої версії. Оновлений файл буде результатом об\'єднання вашого модифікованого і нового файлу.',
	'FILES_NEW'						=> 'Нові файли',
	'FILES_NEW_EXPLAIN'				=> 'Наступних файлів немає у вашій версії phpBB. Ці файли будуть додані.',
	'FILES_NEW_CONFLICT'			=> 'Нові конфліктуючі файли',
	'FILES_NEW_CONFLICT_EXPLAIN'	=> 'Наступні файли з\'явилися лише в останній версії. Але файл з таким же ім\'ям і в тому ж місці вже існує. Цей файл буде перезаписаний файлом з нової версії.',
	'FILES_NOT_MODIFIED'			=> 'Незмінені файли',
	'FILES_NOT_MODIFIED_EXPLAIN'	=> 'Наступні файли не було змінено і являють собою оригінальні файли phpBB тій версії, яку ви хочете оновити.',
	'FILES_UP_TO_DATE'				=> 'Вже оновлені файли',
	'FILES_UP_TO_DATE_EXPLAIN'		=> 'Наступні файли вже відповідають файлам нової версії і не потребують оновлення.',
	'FTP_SETTINGS'					=> 'Налаштування FTP',
	'FTP_UPDATE_METHOD'				=> 'Завантажити по FTP',

	'INCOMPATIBLE_UPDATE_FILES'		=> 'Знайдені файли оновлення не підходять для встановленої версії phpBB. Ваша версія — %1$s, а файл оновлення призначено переходу з версії %2$s до версиї %3$s.',
	'INCOMPLETE_UPDATE_FILES'		=> 'Неповний набір файлів оновлення.',
	'INLINE_UPDATE_SUCCESSFUL'		=> 'Оновлення бази даних успішно завершено. Тепер необхідно продовжити процес оновлення.',

	'KEEP_OLD_NAME'		=> 'Залишити колишнє ім\'я',

	'LATEST_VERSION'		=> 'Остання версія',
	'LINE'					=> 'Рядок',
	'LINE_ADDED'			=> 'Додано',
	'LINE_MODIFIED'			=> 'Змінено',
	'LINE_REMOVED'			=> 'Видалено',
	'LINE_UNMODIFIED'		=> 'Не змінено',
	'LOGIN_UPDATE_EXPLAIN'	=> 'Для того, щоб оновити версію phpBB, спершу необхідно увійти на конференцію.',

	'MAPPING_FILE_STRUCTURE'	=> 'Для полегшення закачування файлів тут вказані відповідності розташувань файлів в архіві і у вашій версії phpBB.',

	'MERGE_MODIFICATIONS_OPTION'	=> 'Об\'єднати зміни',

	'MERGE_NO_MERGE_NEW_OPTION'	=> 'Не об\'єднувати - використовувати новий файл',
	'MERGE_NO_MERGE_MOD_OPTION'	=> 'Не об\'єднувати - використовувати наявний файл',
	'MERGE_MOD_FILE_OPTION'		=> 'Об\'єднати зміни (видалити новий код у конфліктному місці)',
	'MERGE_NEW_FILE_OPTION'		=> 'Об\'єднати зміни (видалити змінений код у конфліктному місці)',
	'MERGE_SELECT_ERROR'		=> 'Невірно обрані способи об\'єднання конфліктного файлу з новою версією.',
	'MERGING_FILES'				=> 'Об\'єднання відмінностей',
	'MERGING_FILES_EXPLAIN'		=> 'Зараз проводиться остаточна зміна файлів.<br /><br />Дочекайтеся закінчення всіх операцій по зміні файлів.',

	'NEW_FILE'						=> 'Кінець конфліктного місця',
	'NEW_USERNAME'					=> 'Нове ім\'я',
	'NO_AUTH_UPDATE'				=> 'У вас немає прав на виконання оновлення phpBB',
	'NO_ERRORS'						=> 'Без помилок',
	'NO_UPDATE_FILES'				=> 'Наступні файли будуть оновлені',
	'NO_UPDATE_FILES_EXPLAIN'		=> 'Наступні файли з\'явилися або були змінені в останній версії, але папка, в якій вони повинні знаходитися, не знайдено в поточній версії phpBB. Присутність у списку файлів, що не відносяться до папки мов (language /) або стилів (styles /), може означати, що ви змінили структуру папок і оновлення буде неповним.',
	'NO_UPDATE_FILES_OUTDATED'		=> 'Не знайдено папка з оновленнями, переконайтеся, що ви закачали відповідні файли. <br /> <br /> Ваша версія phpBB %1$s <strong>НЕ</strong> найостанніша, для неї доступні оновлення. Зайдіть на сторінку <a href="https://www.phpbb.com/downloads/" rel="external">https://www.phpbb.com/downloads/</a>, щоб завантажити потрібний вам пакет оновлення з версії %2$s до версії %3$s.',
	'NO_UPDATE_FILES_UP_TO_DATE'	=> 'Ваша версія phpBB сама остання. Немає необхідності запускати програму оновлення. Якщо ви хочете провести перевірку цілісності файлів, упевніться, що закачали підходящі файли оновлення.',
	'NO_UPDATE_INFO'				=> 'Не знайдені дані файлу оновлення.',
	'NO_UPDATES_REQUIRED'			=> 'Оновлення не потрібне',
	'NO_VISIBLE_CHANGES'			=> 'Немає видимих ​​змін',
	'NOTICE'						=> 'Сповіщення',
	'NUM_CONFLICTS'					=> 'Число конфліктних місць',
	'NUMBER_OF_FILES_COLLECTED'	=> 'Впорядковано відмінності в %1$d файлах из %2$d.<br />Дочекайтеся повної перевірки всіх файлів.',

	'OLD_UPDATE_FILES'		=> 'Наявні файли оновлення phpBB застаріли. Вони призначені для оновлення з версії %1$s до версиъ %2$s, але остання версія phpBB — %3$s.',

	'PACKAGE_UPDATES_TO'				=> 'Поточний пакет оновлює до версії',
	'PERFORM_DATABASE_UPDATE'			=> 'Оновлення бази даних',
	'PERFORM_DATABASE_UPDATE_EXPLAIN'	=> 'Нижче ви знайдете кнопку оновлення бази даних. Оновлення може зайняти деякий час, тому не слід обривати процес його виконання, якщо вам здасться, що він завис. Після завершення дотримуйтесь інструкцій для продовження процесу оновлення.',
	'PREVIOUS_VERSION'					=> 'Попередня версія',
	'PROGRESS'							=> 'Хід виконання',

	'RESULT'					=> 'Результат',
	'RUN_DATABASE_SCRIPT'		=> 'Оновити базу даних',

	'SELECT_DIFF_MODE'			=> 'Виберіть режим diff',
	'SELECT_DOWNLOAD_FORMAT'	=> 'Виберіть формат архіву для завантаження',
	'SELECT_FTP_SETTINGS'		=> 'Установка налаштувань FTP',
	'SHOW_DIFF_CONFLICT'		=> 'Відмінності/конфліктні місця',
	'SHOW_DIFF_FINAL'			=> 'Підсумковий файл',
	'SHOW_DIFF_MODIFIED'		=> 'Відмінності з об\'єднаним файлом',
	'SHOW_DIFF_NEW'				=> 'Вміст файлу',
	'SHOW_DIFF_NEW_CONFLICT'	=> 'Відмінності у файлах',
	'SHOW_DIFF_NOT_MODIFIED'	=> 'Відмінності у файлах',
	'SOME_QUERIES_FAILED'		=> 'Виконання деяких запитів завершилося невдачею, тексти запитів і помилок наведені нижче.',
	'SQL'						=> 'SQL-запит',
	'SQL_FAILURE_EXPLAIN'		=> 'Швидше за все, хвилюватися не про що, процес оновлення буде продовжений. Якщо він не буде завершений, то пошукайте довідку на наших форумах підтримки. Для отримання відомостей про отримання підтримки дивіться файл <a href="../docs/README.html">README</a>.',
	'STAGE_FILE_CHECK'			=> 'Проверка файлов',
	'STAGE_UPDATE_DB'			=> 'Оновлення бази даних',
	'STAGE_UPDATE_FILES'		=> 'Оновлення файлів',
	'STAGE_VERSION_CHECK'		=> 'Перевірка версії',
	'STATUS_CONFLICT'			=> 'Змінений файл, що створює конфлікти',
	'STATUS_MODIFIED'			=> 'Змінений файл',
	'STATUS_NEW'				=> 'Новий файл',
	'STATUS_NEW_CONFLICT'		=> 'Конфліктуючий новий файл',
	'STATUS_NOT_MODIFIED'		=> 'Незмінений файл',
	'STATUS_UP_TO_DATE'			=> 'Вже оновлений файл',

	'TOGGLE_DISPLAY'			=> 'Показати/приховати список файлів',
	'TRY_DOWNLOAD_METHOD'		=> 'Ви можете спробувати завантажити змінені файли.<br />Цей метод найбільш надійний і є рекомендованим способом оновлення.',
	'TRY_DOWNLOAD_METHOD_BUTTON'=> 'Спробувати цей метод',

	'UPDATE_COMPLETED'				=> 'Оновлення завершено',
	'UPDATE_DATABASE'				=> 'Оновити базу даних',
	'UPDATE_DATABASE_EXPLAIN'		=> 'На наступному етапі будуть внесені необхідні зміни в базу даних.',
	'UPDATE_DATABASE_SCHEMA'		=> 'Оновлення структури бази даних',
	'UPDATE_FILES'					=> 'Оновити файли',
	'UPDATE_FILES_NOTICE'			=> 'Переконайтеся в тому, що ви також оновили файли конференції. Цей файл оновлює тільки базу даних.',
	'UPDATE_INSTALLATION'			=> 'Оновлення версії phpBB',
	'UPDATE_INSTALLATION_EXPLAIN'	=> 'Тут ви можете оновити вашу версію phpBB до останньої.<br />Під час цього процесу всі ваші файли будуть перевірені на цілісність. Ви зможете переглянути файли і вносяться до них зміни перед оновленням.<br /><br />Саме оновлення може бути виконано двома способами.</p><h2>Оновлення вручну</h2><p>Цей спосіб полягає в тому, що ви завантажуєте індивідуальний набір оновлених файлів, щоб не втратити зроблені вами зміни до наявних файлах. Завантаживши цей архів, ви повинні вручну закачати файли з нього у відповідні їм місця розташування щодо кореневої папки phpBB. Після цього вам буде дана можливість провести перевірку, що всі файли займають належні їм місця.</p><h2>Автоматичне оновлення по FTP</h2><p>Цей спосіб схожий на перший, але без необхідності завантажувати оновлені файли і закачувати їх на сервер самостійно, це буде зроблено за вас. Щоб скористатися цим способом, вам потрібно знати запитувані програмою оновлення дані про ваше FTP-сервері. Після закінчення ви будете направлені на повторне порівняння файлів з ​​метою упевнитися, що оновлення пройшло успішно.<br /><br />',
	'UPDATE_INSTRUCTIONS'			=> '

		<h1>Оголошення про вихід нової версії</h1>

		<p>Перш ніж продовжити процес оновлення, прочитайте <a href="%1$s" title="%1$s"><strong>оголошення про випуск останньої версії</strong></a>, воно може містити корисну для вас інформацію. Крім того, в ньому присутні посилання на скачування нової версії, оновлень, а також перелік змін.</p>

		<br />

		<h1>Як оновити свою версію phpBB за допомогою пакету автоматичного оновлення</h1>

		<p>Рекомендований тут спосіб оновлення phpBB придатний тільки для пакету автоматичного оновлення. Ви також можете оновитись, використовуючи методи, зазначені в документі INSTALL.html. Для автоматичного оновлення потрібно виконати наступні кроки:</p>

		<ul style="margin-left: 20px; font-size: 1.1em;">
			<li>Перейти на <a href="https://www.phpbb.com/downloads/" title="https://www.phpbb.com/downloads/">сторінку файлів phpBB.com</a>і завантажити архів з пакетом автоматичного оновлення («Automatic Update Package»).<br /><br /></li>
			<li>Розпакуйте архів.<br /><br /></li>
			<li>Завантажте розархівовану папку install в корінь phpBB (туди, де знаходиться файл config.php).<br /><br /></li>
		</ul>

		<p>Після цього конференція стане доступна для звичайних користувачів, через те, що тепер присутня закачана вами папка install.<br /><br />
		<strong><a href="%2$s" title="%2$s">Тепер ви можете почати процес оновлення, перейшовши в папку install</a>.</strong><br />
		<br />
		Вам будуть дані вказівки в ході процесу оновлення, а по його закінченні вам повідомлять про це.
		</p>
	',
	'UPDATE_INSTRUCTIONS_INCOMPLETE'	=> '

		<h1>Незавершене автоматичне оновлення</h1>

		<p>Виявлено, що попереднє автоматичне оновлення не завершено. Переконайтеся в тому, що всі кроки автоматичного оновлення були виконані. Перейдіть по посиланню нижче або безпосередньо в папку установки.</p>
	',
	'UPDATE_METHOD'					=> 'Спосіб оновлення',
	'UPDATE_METHOD_EXPLAIN'			=> 'Зараз ви можете вибрати зручний для вас спосіб закачування файлів. Якщо ви віддасте перевагу закачування по FTP, вам буде запропоновано заповнити форму даних про обліковий запис вашого FTP-сервера. Цей спосіб забезпечує автоматичне переміщення файлів в нові місця розташування і створення резервних копій їх старих версій з додаванням. .bak до імені файлу. Якщо ви виберіть скачування архіву з модифікованими файлами, то зможете розпакувати його і закачати файли у відповідні їм місця розташування вручну.',
	'UPDATE_REQUIRES_FILE'			=> 'Для оновлення необхідно наявність наступного файлу: %s',
	'UPDATE_SUCCESS'				=> 'Оновлення успішно завершено',
	'UPDATE_SUCCESS_EXPLAIN'		=> 'Всі файли успішно оновлені. Наступний крок включає в себе повторну перевірку відповідності файлів останньої версії phpBB.',
	'UPDATE_VERSION_OPTIMIZE'		=> 'Оновлення версії і оптимізація таблиць',
	'UPDATING_DATA'					=> 'Оновлення даних',
	'UPDATING_TO_LATEST_STABLE'		=> 'Оновлення бази даних до останньої стабільної версії',
	'UPDATED_VERSION'				=> 'Оновлена ​​версія',
	'UPGRADE_INSTRUCTIONS'			=> 'Доступна нова версія: <strong>%1$s</strong>. Прочитайте <a href="%2$s" title="%2$s"><strong>оголошення про вихід нової версії</strong></a>, щоб отримати інформацію про нововведення і способах оновлення.',
	'UPLOAD_METHOD'					=> 'Спосіб завантаження',

	'UPDATE_DB_SUCCESS'				=> 'База даних успішно оновлена.',
	'UPDATE_FILE_SUCCESS'			=> 'Файл успішно оновлений.',
	'USER_ACTIVE'					=> 'Активований користувач',
	'USER_INACTIVE'					=> 'Аккаунт не активований користувач',

	'VERSION_CHECK'					=> 'Перевірка версії',
	'VERSION_CHECK_EXPLAIN'			=> 'Перевіряє, що поточна версія phpBB сама остання.',
	'VERSION_NOT_UP_TO_DATE'		=> 'Ваша версія phpBB не остання. Продовжуйте процес оновлення.',
	'VERSION_NOT_UP_TO_DATE_ACP'	=> 'Ваша версія phpBB не остання.<br />Нижче ви знайдете посилання на оголошення про випуск останньої версії, яке містить додаткову інформацію, а також інструкції з оновлення phpBB.',
	'VERSION_NOT_UP_TO_DATE_TITLE'	=> 'Ваша версія phpBB не остання.',
	'VERSION_UP_TO_DATE'			=> 'Ваша версія phpBB сама остання. На даний момент для неї немає оновлень. Проте ви можете перейти до перевірки файлів на відповідність останній версії.',
	'VERSION_UP_TO_DATE_ACP'		=> 'Ваша версія phpBB сама остання. На даний момент для неї немає оновлень.',
	'VIEWING_FILE_CONTENTS'			=> 'Перегляд вмісту файлу',
	'VIEWING_FILE_DIFF'				=> 'Перегляд відмінностей у файлах',

	'WRONG_INFO_FILE_FORMAT'	=> 'Помилковий формат файлу відомостей про оновлення',
));

// Default database schema entries…
$lang = array_merge($lang, array(
	'CONFIG_BOARD_EMAIL_SIG'		=> 'Спасибі, Адміністрація',
	'CONFIG_SITE_DESC'				=> 'Короткий опис вашої конференції',
	'CONFIG_SITENAME'				=> 'ваш_домен.ua',

	'DEFAULT_INSTALL_POST'			=> 'Це приклад повідомлення вашої phpBB3 конференції. Все працює правильно. Ви можете видалити це повідомлення та продовжити налаштування вашої конференції. У процесі встановлення вашій першій категорії та вашому першому форуму було встановлено відповідні права доступу для передвстановлених груп адміністраторів, супермодераторів, гостей, зареєстрованих користувачів та зареєстрованих у користувачів COPPA. Якщо ви видалите вашу першу категорію та ваш перший форум, не забудьте встановити права доступу для всіх нових категорій і форумів, які ви створюєте. Рекомендуємо перейменувати вашу першу категорію та ваш перший форум та скопіювати права з них при створенні нових категорій та форумів. Удачі!',

	'FORUMS_FIRST_CATEGORY'			=> 'Ваша перша категорія',
	'FORUMS_TEST_FORUM_DESC'		=> 'Опис вашого першого форуму.',
	'FORUMS_TEST_FORUM_TITLE'		=> 'Ваш перший форум',

	'RANKS_SITE_ADMIN_TITLE'		=> 'Адміністратор',
	'REPORT_WAREZ'					=> 'Повідомлення містить посилання на незаконні або піратські програми.',
	'REPORT_SPAM'					=> 'Повідомлення має єдиною метою рекламу сайтів, програм або інших продуктів, товарів, послуг і пр.',
	'REPORT_OFF_TOPIC'				=> 'Повідомлення не відноситься до обговорюваної теми.',
	'REPORT_OTHER'					=> 'Причина оскарження не відноситься ні до однієї з перерахованих, використовуйте поле додаткової інформації.',

	'SMILIES_ARROW'					=> 'Стрілка',
	'SMILIES_CONFUSED'				=> 'Спантеличений',
	'SMILIES_COOL'					=> 'Все добре',
	'SMILIES_CRYING'				=> 'Плаче або сильно засмучений',
	'SMILIES_EMARRASSED'			=> 'Збентежений',
	'SMILIES_EVIL'					=> 'Злий або дуже роздратований',
	'SMILIES_EXCLAMATION'			=> 'Вигук',
	'SMILIES_GEEK'					=> 'Ботан',
	'SMILIES_IDEA'					=> 'Ідея',
	'SMILIES_LAUGHING'				=> 'Сміється',
	'SMILIES_MAD'					=> 'Роздратований',
	'SMILIES_MR_GREEN'				=> 'Зелений',
	'SMILIES_NEUTRAL'				=> 'Нейтральний',
	'SMILIES_QUESTION'				=> 'Питання',
	'SMILIES_RAZZ'					=> 'Дражниться',
	'SMILIES_ROLLING_EYES'			=> 'Закочує очі',
	'SMILIES_SAD'					=> 'Сумний',
	'SMILIES_SHOCKED'				=> 'В шоці',
	'SMILIES_SMILE'					=> 'Посміхається',
	'SMILIES_SURPRISED'				=> 'Здивований',
	'SMILIES_TWISTED_EVIL'			=> 'Дуже злий',
	'SMILIES_UBER_GEEK'				=> 'Мегаботан',
	'SMILIES_VERY_HAPPY'			=> 'Дуже задоволений',
	'SMILIES_WINK'					=> 'Підморгує',

	'TOPICS_TOPIC_TITLE'			=> 'Ласкаво просимо на phpBB3',
));
