<?php
/**
*
* This file is part of the phpBB Forum Software package.
*
* @copyright (c) phpBB Limited <https://www.phpbb.com>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* For full copyright and license information, please see
* the docs/CREDITS.txt file.
*
*/

if (!defined('IN_PHPBB'))
{
	exit;
}

$synonyms = array(
	'абонент'			=> 'абонент',
	'абориген'			=> 'абориген',
	'абревіатура'		=> 'абревіатура',
	'авангард'			=> 'авангарт',
	'авіапошта'			=> 'авіопочта',
	'автомобіль'		=> 'машина',
	'агресивний'		=> 'агресивний',
	'агресія'			=> 'агресия',
	'агрессор'			=> 'агресор',
	'ад\'ютант'			=> 'ад\'ютант',
	'адекватний'		=> 'нормальний',
	'ажиотаж'			=> 'ажиатаж',
	'аккомпанемент'		=> 'аккомпанимент',
	'акклиматизация'	=> 'аклиматизация',
	'аксіома'			=> 'аксеома',
	'аккумулятор'		=> 'акумулятор',
	'акуратний'			=> 'акуратний',
	'амплітуда'			=> 'амплетуда',
	'анестезія'			=> 'анастезія',
	'апартаменти'		=> 'квартира',
	'аппарат'			=> 'апарат',
	'аппаратура'		=> 'апаратура',
	'апелляция'			=> 'апеляція',
	'аппендицит'		=> 'апендицит',
	'аранжировка'		=> 'оранжировка',
	'ассистент'			=> 'асистент',

	'баррикада'			=> 'барикада',
	'блондин'			=> 'бландин',
	'блондинка'			=> 'білявка',
	'боротьба'			=> 'бокс',
	'брошура'			=> 'брошура',
	'бюлетень'			=> 'бюлетень',

	'весь'				=> 'евсь',
	'взгляд'			=> 'взлгяд',
	'високий'			=> 'великий',

	'горила'			=> 'мавпа',

	'документ'			=> 'докмент',
	'дорога'			=> 'доорга',
	'другой'			=> 'другйо',

	'если'				=> 'елси',

	'завантажити'		=> 'скачати',
	'завантаження'		=> 'скачування',

	'инженер'			=> 'инжинер',
	'инцидент'			=> 'инциндент',

	'комп\'ютер'		=> 'комп',
	'костюм'			=> 'наряд',

	'немаожна'			=> 'нельзя',

	'пошук'				=> 'знахідка',
	'просто'			=> 'легко',

	'розвиток'			=> 'розвивання',

	'повідомлення'		=> 'пост',

	'танец'				=> 'пляска',
	'том'				=> 'розділ',
	'важко'				=> 'складно',

	'пристрій'			=> 'обладнання',

	'центр'				=> 'центер',

	'шоу'				=> 'виступ',

	'енциклопедія'		=> 'енцеклопедія',
	'эффект'			=> 'эфект',
);
